{"id": "advertising-can-be-hilarious", "title": "On Advertising", "content": "Advertising can be hilarious. It’s amazing what lengths people go through to make their product seem appealing. A recent campaign on billboards throughout the city made me laugh, but here’s another advert that made me laugh a bit. How it is relevant, I don’t know.<div class=\"readmore\"><br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/aytX3Xp7vKk.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" iq=\"true\" src=\"data/images/aytX3Xp7vKk.jpg\"/></a><br/></div><br/>That was just a diversion. The thing I really wanted to talk about is the recent advertising campaign around the city by Multichoice, advertising DSTV. They use three mini-billboards attached to three consecutive street light poles. They show a single scoop ice-cream for R5 a day and advertise a basic package. Then a double scoop ice-cream for R8 a day, and advertise a medium level package. Then they show a triple scoop ice-cream for R15 a day, and advertise a full package. The intention is to say that DSTV is cheap and affordable if you look at it on a daily cost basis.<br/><br/>The truth is, if I had the choice between DSTV and a triple scoop ice-cream, then ignoring the health risks, I’d take a triple scoop ice-cream every day. I understand that they are just trying to say that sacrificing just one ice-cream a day is all you need to do to afford DSTV. The problem is that I do not know a single person who has ice-cream every day. I probably never will, since they’re probably too huge to make it through the door.<br/><br/>The whole thing reminds me of a life insurance advert that used to be on TV when I was in high school. It was a ridiculously long advert. I think it was during the infomercials (which I used to watch during school holidays, having not much else to do). I remember the line “For no more than the price of a sandwich a day, you and your family can have the cover they deserve.” It’s a good point, but the choice of airing time was a bit poor. They used to show shortly before noon – roughly the time my stomach was starting to point out (rather loudly, the way someone would point something out after a night (and probably afternoon and morning) of non-stop drinking) that a sandwich would be a much more welcome right then.<br/><br/>If you expect people to sacrifice a meal for your product, then it had better be an incredible product.</div>", "published": "2009-09-20T15:38:00.003000+02:00", "updated": "2011-04-07T13:04:57.804000+02:00", "draft": false, "categories": ["incompetence", "advertising", "food"]}