{"id": "amusing-hat-day", "title": "On Amusing Hat Day for Incompetence Awareness 2013", "content": "Incompetence can be cured, if only we'd all make the effort. Make the effort, and on Friday 23 August 2013, wear anything on your head that wouldn't normally be considered a hat. Don't forget to <a href=\"https://www.facebook.com/events/167130896774512\">join the Facebook event</a> too. <div class=\"readmore\"><br/><br/><a href=\"data/images/3HA1iSk61uI.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/3HA1iSk61uI.png\"/></a><br/><br/>Every year, over 7 billion people are affected by either their own or someone else's incompetence. Somewhere along the line, being incompetent became something to be ashamed of. All to often, we belittle people for something they can't do. Quite frankly, that's half the problem. Being incompetent is not something that anyone does deliberately. Many incompetent people are too embarrassed to admit that they don't know what they are doing. More often, they're not even aware of their incompetence. If only these people could be made aware of their shortcomings so that they could take steps to learn. So often, an incompetent person needs nothing more than to be taken by the hand and taught how to teach themselves.<br/><br/>Of course, awareness can only go so far. Somewhere along the line, we also need to start doing something. If you have any spare books lying around, then donate them to a local library or school. Offer your services to help out at a school or children's home. If you have no books, and are too busy to help, then donate some money to an orphanage, and let them know you want it to go towards a child's education. If you have no money, then use your creativity. Wear your amusing hat, and if anyone asks about it, use the opportunity to ask them to help out too.<br/><br/>If we all work together, we can solve the problem of global incompetence, and with it, the vast majority of the worlds other problems.<br/><br/></div>", "published": "2013-03-11T21:49:00+02:00", "updated": "2013-03-13T21:42:19.044000+02:00", "draft": false, "categories": ["incompetence", "Amusing Hat Day"]}