{"id": "build-society-from-scratch", "title": "On What I Could Contribute if I had to Build Society from Scratch", "content": "Imagine you're suddenly transported somehow into another <div class=\"readmore\">planet Earth in some other </div>universe. Everything in that universe is exactly like ours in every way except that, technologically, the inhabitants are around ten thousand years behind us. <div class=\"readmore\">Luckily, their languages have magically and inexplicably managed to evolve the same ways as ours, so they understand everything you tell them, and you understand everything they tell you. They've got a pretty good idea of how to start fires, make sharp tools, and they're not too bad with farming, but they have little more than that. </div>While their quaint rural lifestyle would probably seem nice and relaxing for the first few days, no doubt you'd start to miss some of your modern comforts after a while. You have all the knowledge of a late twentieth/early twenty-first century education. How much of ten millennia worth of technological advancement could you reproduce in the remainder of your lifetime?<div class=\"readmore\"><br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>1. So... What am I starting from?</b></span><br/><br/>Lets set the stage. We're talking the equivalent of roughly 8000 BCE in our world, which is the middle of the Neolithic Era. People are still using stone tools - this is about a thousand years before the first copper came on the scene (and about three thousand more before it's use is widespread), bronze tools are still five thousand years away, and iron tools will only start appearing a couple thousand years after that. However, they're getting quite advanced with stone technology. They're not just bashing rocks until they have a sharp point any more. They're taking the time to grind and polish their tools, and getting pretty good at it too. <br/><br/>Domestic dogs, sheep, and pigs are pretty widespread, but the idea of domesticated cattle is a fairly new one. Farming plants is also a pretty new idea, and is mainly limited to annuals like pulses, grains and gourds. If you want fruit, you'd most likely have to find a wild tree or bush. There are lots of farms, and a handful of villages. There are even a couple of towns in the most developed parts of the world - with walls and towers and everything - although they only have a few thousand inhabitants each. <br/><br/>Not having to go hunting for food actually frees up a surprising amount of time, and these people are just starting to discover recreation. They're already carving crude statues and making jewellery from brightly coloured stones, but concepts like wheels and pottery are still 1500 years away.<br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>2. Why would I be able to contribute?</b></span><br/><br/>I supposedly have all the knowledge that comes from being educated in the last decade of the twentieth century. I have an engineering degree from the first decade of the twenty-first century. Lets assume that I'm a quick enough negotiator so that they don't consider me a threat and kill me, and that I somehow manage to convince them to listen to me. What can I offer to this backward civilisation?<br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>3. The Basics.</b></span><br/><br/>Well, the wheel is a pretty obvious place to start. I could also teach them them that mud can be used for more than just mud huts and teach them to use clay to do some basic pottery. Not that I'm particularly knowledgeable about pottery, but I'm sure I could convey some of the basic ideas.<br/><br/>Another obvious, and probably essential technology would be writing. They'd actually be about five thousand years away from inventing written language on their own. However, starting with very young children, and trying to mimic the methods that are used in millions of our own schools across the world, I feel I could have children reading, writing and understanding within about six to eight years. Following on from that, I see no reason why I couldn't introduce a crude wooden printing press, even though they're almost nine and a half thousand years from inventing it on their own.<br/><br/>Once that's out the way, a crash course in Western philosophy may be appropriate. It would be wonderful if I could somehow get deductive logic to be a permanent feature in the education system from the very start. And naturally, I could follow with mathematics. I feel that with my knowledge, I could teach them basic arithmetic, quite a bit of algebra, some introductory statistics, and I think it may even be a good idea to introduce some very elementary calculus. Of course, I'd have to start teaching some Newtonian mechanics to make it all make sense, and then I could teach them some basic engineering design to make it all useful.<br/><br/>I also think I'd have to teach ethics from very early on. In fact, I should probably lead with that.<br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>4. What Could I Contribute From <i>My</i> Education?</b></span><br/><br/>Well... I did spend two years in university specialising in metallurgy. Is that useful at all? They're not far off from working out how much you can do with copper. I could easily teach them everything they need to know to build a simple clay copper smelter, and how to work the copper to make tools. I could even bypass the whole copper age, and show them how to introduce tin to make bronze. I could tell them all about alloys, and how you can affect the properties of metals by mixing them in different ratios. There's one catch though, and it's a fairly big and embarrassing one. I actually have no idea how to differentiate copper ore in a pile of rock. I wouldn't be able to identify any metal ore, in fact. So unless they know what copper ore is, but just haven't figured out what to use it for, none of my metallurgy knowledge is going to be particularly useful at all.<br/><br/>I spent the following four years studying aeronautical engineering. Obviously they're not quite ready for aircraft, but there are some pretty important things I could teach them that they could put to immediate use. Windmills are incredibly useful for grinding grain. I could also probably teach them a bit about propellants, and maybe make some crude rockets, but I'm not sure if this would be a good idea. In fact, most of what I could teach them from my university education would have only military uses to a civilisation like theirs. I think I should most definitely lead with teaching them ethics.<br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>5. What Would Actually Happen?</b></span><br/><br/>The course of events that would actually take place becomes pretty obvious, the more I think about it. I would arrive in their world. I would encounter the first tribe, and convince them not to kill me. Knowing people, I'd presumably have to do this by demonstrating that I can provide some military advantage over their rivals. They'd be terrified that I'd be captured by their rivals, so they'd kill me to prevent my knowledge falling into the wrong hands. Progress would resume as if I'd never been there.<br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>6. Conclusion - What <i>Should</i> I Do?</b></span><br/><br/>The answer is simple. Remain isolated. Live as a hermit. Avoid all contact with the humans that inhabit that planet. Never reveal anything. Unfortunately, I'm too much of a show off, so even then, I'd probably try something stupid and get myself killed. So the safest thing to do is to avoid being transported to a universe whose human inhabitants are ten thousand years behind ours.<br/><br/>What would you do? What could you contribute?<br/><br/><br/>[<b>Editor's note: </b><i>Proof-reading this post made me realise that it sounds like a very generic blog topic. In fact, it probably sounds like it came straight from a random writing prompt. It didn't. As usual, I've probably been playing too much Minecraft, and it got me thinking. This is not too far off what that game is all about.</i>]<br/><br/></div>", "published": "2013-04-02T15:06:00.001000+02:00", "updated": "2013-04-02T15:06:48.035000+02:00", "draft": false, "categories": ["fixing the world", "history"]}