{"id": "favourite-classical-music", "title": "On My 13 Favourite Pieces of Classical Music", "content": "I felt like compiling another list of music I enjoy. I'm told that I listen to a fairly broad range of music, but I don't really. All of the music I really enjoy falls into the genres of metal, alternative rock and classical, and even within those genres, I'm quite discerning. Anyway, here is a list of the 13 pieces of classical music that I would list as my favourite<div class=\"readmore\">, in no particular order. It wasn't easy, but I did try limit myself to listing each composer only once</div>. Sit back, listen, and enjoy.<div class=\"readmore\"><br/><br/><br/><span style=\"font-size: large;\">    <b>1. <a href=\"http://www.youtube.com/watch?v=nGdFHJXciAQ\">Vivaldi's \"Winter\" from <i>The Four Seasons</i></a></b></span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Antonio_Vivaldi\">Antonio Vivaldi's</a> music was incredibly advanced for it's time. Although it is a full concerto in it's own right (No. 4 in F minor), it is usually listed as the final part of the set <i>The Four Seasons</i>. The first concerto, <a href=\"http://www.youtube.com/watch?v=-4kTei0XrCs\">\"Spring\"</a> is probably the most famous (and you'd probably recognise the opening bars if you heard them), but of the four, it is definitely the one I like least.<br/><br/><br/><span style=\"font-size: large;\">    <b>2. <a href=\"http://www.youtube.com/watch?v=rsouEMV4Pb8\">The Funeral March from Mahlers's Symphony No. 5</a></b></span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Gustav_Mahler\">Gustav Mahler</a> wrote a couple of funeral marches throughout his life. The first, <a href=\"http://www.youtube.com/watch?v=0z8y1K0DLdo\">\"Hunter's Funeral\"</a>, which served as the third movement of his first symphony is probably one you'd recognise - the melody is from the nursery rhyme <a href=\"http://en.wikipedia.org/wiki/Are_you_sleeping\">\"Are You Sleeping?\"</a>. The opening movement of his 5th symphony, however, is far more powerful. It portrays such complex emotion, more than just the sadness which funeral marches tend to carry. It contains pieces which carry grief, distress, frustration, resignation, and gratefulness all pulled together in a single piece of music.<br/><br/><br/><span style=\"font-size: large;\">    <b>3. <a href=\"http://www.youtube.com/watch?v=_4IRMYuE1hI\">Beethoven's <i>Symphony No. 5</i>, Movement I</a></b></span><br/><br/>There is a reason why <a href=\"http://en.wikipedia.org/wiki/Beethoven\">Ludwig van Beethoven's</a> 5th symphony is one of the most famous pieces of classical music ever written. I enjoy the majority of Beethoven's work from his middle period, but his fifth symphony (together with the more light hearted <a href=\"http://www.youtube.com/watch?v=Sr3lsI4OVis\">eighth symphony</a> and the <a href=\"http://www.youtube.com/watch?v=4Tr0otuiQuU\"><i>Moonlight Sonata</i></a>) really stands out from the rest.<br/><br/><br/><span style=\"font-size: large;\">    <b>4. <a href=\"http://www.youtube.com/watch?v=8vXuVBd99k4\">Dvořák's <i>New World Symphony</i>, Movement IV</a></b></span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Anton%C3%ADn_Dvo%C5%99%C3%A1k\">Antonín Dvořák's</a> <i>From the New World</i> was apparently one of the pieces of music that Neil Armstrong chose to take with him to the moon. As far as epic music goes, the final movement is one of the best. Having been a big fan of this piece for years, I was incredibly excited when I first heard <a href=\"http://www.youtube.com/watch?v=L95MNCQzD-A\"><i>The Wizard's Last Rhymes</i></a> (by the Italian power metal band <a href=\"http://en.wikipedia.org/wiki/Rhapsody_of_Fire\">Rhapsody of Fire</a>) use it to such good effect.<br/><br/><br/><span style=\"font-size: large;\">    <b>5. <a href=\"http://www.youtube.com/watch?v=S76CGGPqI3s\">Tchaikovsky's \"Scene\" from Act II of <i>Swan Lake</i></a></b></span><br/><br/>Although <a href=\"http://en.wikipedia.org/wiki/Tchaikovsky\">Pyotr Ilyich Tchaikovsky's</a> <a href=\"http://www.youtube.com/watch?v=VbxgYlcNxE8\"><i>1812 Overture</i></a> was the first piece of instrumental music that I heard that portrayed it's story perfectly (who can't love music that uses <i>cannons</i> as a musical instrument), but it's just not quite as beautiful as the <i>Swan Lake's</i> \"Scene\".<br/><br/><br/><span style=\"font-size: large;\">    <b>6. <a href=\"http://www.youtube.com/watch?v=DUmq1cpcglQ\">Prokofiev's <i>Dance of the Knights</i></a></b></span><br/><br/>I first heard this piece in the form of <i><a href=\"http://www.youtube.com/watch?v=DymceY5CowE\">Lords of Bedlam</a></i> (by the Austrian symphonic black metal band <a href=\"http://en.wikipedia.org/wiki/Hollenthon\">Hollenthon</a>), and eventually went on a hunt for <a href=\"http://en.wikipedia.org/wiki/Prokofiev\">Sergei Sergeyevich Prokofiev's</a> original from his <i>Romeo and Juliet</i> ballet. It's the sort of tune that gets stuck in your head for years, and never truly leaves.<br/><br/><br/><span style=\"font-size: large;\">    <b>7. <a href=\"http://www.youtube.com/watch?v=tvm2ZsRv3C8\">Chopin's <i>Fantaisie-Impromptu</i></a></b></span><br/><br/>Limiting myself to listing <a href=\"http://en.wikipedia.org/wiki/Chopin\">Frédéric François Chopin</a> only once was difficult, since Chopin's <a href=\"http://www.youtube.com/watch?v=ef-4Bv5Ng0w\"><i>Prelude No. 4 in E minor</i></a> is by far, the most emotional piece of music I have ever heard, and no single piece of music has quite as much effect on me. However, <i>Fantaisie-Impromptu</i>, which is heavily inspired by Beethoven's <i>Moonlight Sonata</i> (another work which maybe should have made this list) is easily one of my favourite pieces of pieces of piano music. Interestingly, it's the most complex piece I've ever tried learning on the piano. Too date, I have mastered the first two notes. <br/><br/><br/><span style=\"font-size: large;\">    <b>8. <a href=\"http://www.youtube.com/watch?v=fKfGDqXEFkE\">Grieg's <i>Piano Concerto in A minor</i>, Movement I</a></b></span><br/><br/>Apparently, the only piano concerto <a href=\"http://en.wikipedia.org/wiki/Edvard_Grieg\">Edvard Hagerup Grieg</a> ever wrote is somehow the one of the most famous piano concerto's ever. It's the introduction that I enjoy most, but the rest of the piece is extremely relaxing and perfect background music when reading or working. As <a href=\"http://en.wikipedia.org/wiki/Bill_Bailey\">Bill Bailey's</a> character Manny from <a href=\"http://en.wikipedia.org/wiki/Black_books\">Black Books</a> says, <a href=\"http://www.youtube.com/watch?v=vjyaJ-7P9ho&amp;t=9m48s\">\"It's good isn't it. It's sort of relaxing.\"</a><br/><br/><br/><span style=\"font-size: large;\">    <b>9. <a href=\"http://www.youtube.com/watch?v=TdiAwCPb_As\">Rachmaninoff's <i>Piano Concerto No. 2</i>, Movement II</a></b></span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Sergei_Rachmaninoff\">Sergei Rachmaninoff</a> hated his second piano concerto. He wrote it while trying to recover from clinical depression and severe writer's block. I have mixed feelings about a lot of Rachmaninoff's work, but this particular piece is one that I always enjoy listening to. For some reason though, the depressing 1975 pop song (which will remain unnamed) that features the main theme from this movement is one song I can't stand listening to.<br/><br/><br/><span style=\"font-size: large;\">    <b>10. <a href=\"http://www.youtube.com/watch?v=hOA-2hl1Vbc\">Pachelbel's <i>Canon</i></a></b></span><br/><br/>Apparently, <a href=\"http://en.wikipedia.org/wiki/Johann_Pachelbel\">Johann Pachelbel's</a> <i>Canon</i> is quite popular at weddings. Having only been to one wedding in my life, I didn't actually know that. I enjoy it because of the complex harmonies that arise out of such a technically simple piece. For those who don't know, a <a href=\"http://en.wikipedia.org/wiki/Canon_(music)\">canon</a> is a single melody that is played, with one or more instruments picking up the same melody after a delay (much like rounds in singing). In Pachelbel's <i>Canon</i>, all of the variation and complexity in the music essentially comes from a single melody interacting with two delayed versions of itself.<br/><br/><br/><span style=\"font-size: large;\">    <b>11. <a href=\"http://www.youtube.com/watch?v=TwmFcu6QAqI\">\"Rondo\" from Paganini's <i>Violin Concerto No. 2</i></a></b></span><br/><br/>I was torn between listing <a href=\"http://en.wikipedia.org/wiki/Niccol%C3%B2_Paganini\">Niccolò Paganini's</a> original violin concerto and <a href=\"http://en.wikipedia.org/wiki/Franz_Liszt\">Franz Liszt's</a> piano version, <a href=\"http://www.youtube.com/watch?v=hEnfZjqMSy0\"><i>La Campanella</i></a>. In the end, I chose Paganini. I'm not sure why. It's probably because of the violin<br/><br/><br/><span style=\"font-size: large;\">    <b>12. <a href=\"http://www.youtube.com/watch?v=_FXoyr_FyFw\">Bach's <i>Toccata and Fugue in D minor</i></a></b></span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Johann_Sebastian_Bach\">Johann Sebastian Bach</a> actually wrote three Toccata and Fugues for the organ - two of which were in D minor. Two of them (<a href=\"http://www.youtube.com/watch?v=hX8IvbKPoR0\">BWV 538 in D minor</a> and <a href=\"http://www.youtube.com/watch?v=URuYYy0-AxI\">BWV 540 in F major</a>) are quite similar, and I'm not a big fan of either of them. In fact, I dislike almost all of Bach's music. The one exception, of course is the better known of the three Toccata and Fugues, BWV 565, which is one of the most recognisable organ pieces ever written. It is completely different to any of Bach's other works, and indeed contains many features that were either extremely rare or completely unique at the time. There are <a href=\"http://en.wikipedia.org/wiki/Toccata_and_Fugue_in_D_minor,_BWV_565#Attribution\">two possible explanations for this</a>. The first is that it was not written by Bach at all (there is actually no manuscript signed by Bach), and the second is that it was actually written for violin and later transcribed for organ.<br/><br/><br/><span style=\"font-size: large;\">    <b>13. <a href=\"http://www.youtube.com/watch?v=_5REOSSRalc\">\"The Sea and Sinbad's Ship\" from Rimsky-Korsakov's <i>Scheherazade</i></a></b></span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Rimsky-Korsakov\">Nikolai Andreyevich Rimsky-Korsakov</a> had an incredible talent for telling stories through music, and most of his orchestral works are the sort of thing you can just sit and listen to at any time. <i>Scheherazade</i> is just one of my favourite examples of that. He was also renowned as an excellent teacher, describing his philosophy as \"I will speak, and you will listen. Then I will speak less, and you will start to work. And finally I will not speak at all, and you will work.\"<br/><br/><br/></div>", "published": "2013-02-28T14:51:00+02:00", "updated": "2013-02-28T14:51:44.853000+02:00", "draft": false, "categories": ["music"]}