{"id": "first-things-i-do-on-a-new-computer", "title": "On the First Things I Do on a New Computer", "content": "Having formatted my desktop twice earlier this month, and with a new netbook due to arrive in the next day or two, I compiled a short list of things I do while setting up a new computer. <div class=\"readmore\"> Regardless of what operating system I use (and I firmly believe different OSs are suited to different tasks, so I use a couple), I make a few changes to the appearance and the default settings and software. This is a summary of some of the changes I usually make to a freshly installed OS. <br/><br/>    <span style=\"font-size: large;\"><b>Noises.</b></span><br/><br/>Without fail, the very first thing I do is turn off system sounds. They're annoying, and who knows why they're still turned on by default on every system I've ever used?<br/><br/>    <span style=\"font-size: large;\"><b>Space.</b></span><br/><br/>In Windows, I move the start bar to the side of the screen, because I feel that vertical real estate is far more valuable than horizontal on a wide screen. In GNOME, I disable the bottom panel for the same reason. I then shrink the icons to the smallest size that's practical and still looks good.<br/><br/>    <span style=\"font-size: large;\"><b>Security.</b></span><br/><br/>I install an antivirus in Windows (usually <a href=\"free.avg.com\">AVG Free</a>), or make sure that a simple firewall is installed and switched on in Linux (I like <a href=\"http://en.wikipedia.org/wiki/Uncomplicated_Firewall\">UncomplicatedFirewall</a>). Along the same lines, I disable the guest login account if it isn't already.<br/><br/>    <span style=\"font-size: large;\"><b>Browser.</b></span><br/><br/>I usually install <a href=\"www.google.com/chrome\">Google Chrome</a>, because the billions of saved passwords I have but can never remember are automatically synced. If <a href=\"http://www.mozilla.org/en-US/firefox/new/\">Firefox</a> comes installed by default (as on a number of Linux distros), I might just enable the <a href=\"https://addons.mozilla.org/en-US/firefox/addon/omnibar/\">Omnibar</a> extension and put off this step until I need one of those passwords.<br/><br/>    <span style=\"font-size: large;\"><b>Drivers.</b></span><br/><br/>I install any drivers that came with the computer, and update the graphics drivers with the latest version from the manufacturer's website.<br/><br/>    <span style=\"font-size: large;\"><b>Dropbox.</b></span><br/><br/><a href=\"https://www.dropbox.com/\">Dropbox</a>, or whatever cloud syncing app you use to make backups and store those things you can't do without.<br/><br/>    <span style=\"font-size: large;\"><b>Desktop.</b></span><br/><br/>After setting the desktop wallpaper, I'll delete all of the icons (Oh how I wish Windows would let you delete Recycle Bin). I spend very little time looking at the desktop, so icons there are just a messy eyesore (I launch apps from the menu anyway). Its usually at this point in Ubuntu when I install <a href=\"https://apps.ubuntu.com/cat/applications/quantal/gnome-tweak-tool/\">Gnome Tweak Tool</a>, and turn off \"Have file manager handle the desktop\".<br/><br/>    <span style=\"font-size: large;\"><b>Screensaver.</b></span><br/><br/>I get rid of them. I set the display to turn off after 10 minutes and lock the computer. I never did like screensavers.<br/><br/>    <span style=\"font-size: large;\"><b>Autorun.</b></span><br/><br/>Like screensavers, I've never liked software that runs itself when I insert a disc or plug in a device. I set the computer to do nothing on media insertion. On Windows, you can achieve this by going to Control Panel -&gt; Hardware &amp; Sound -&gt; AutoPlay and setting it all to \"Take no action\".<br/><br/>    <span style=\"font-size: large;\"><b>Appearance.</b></span><br/><br/>In Windows, there's not too much room here, but in any Linux distro, you can do almost anything. Firstly, I set the theme to something as dark but clear as possible. In Ubuntu and related distros, I install <a href=\"http://ubuntu-tweak.com/\">Ubuntu Tweak</a>. I set the date format to a sensible order (day-month-year), and make sure it shows the day of the week (because I can never remember that). I also always move the close button to the left (because my clumsy clicking often closes when I meant to maximize). Other than that, I will spend several days trying out various settings and tweaking minor details until I am completely happy with the results.<br/><br/>    <span style=\"font-size: large;\"><b>Software.</b></span><br/><br/>I cannot function on Windows without <a href=\"http://www.rarlab.com/download.htm\">WinRAR</a>, <a href=\"http://notepad-plus-plus.org/\">Notepad++</a> and <a href=\"http://windirstat.info/\">WinDirStat</a>, so I install those first. Second is a codec pack that includes <a href=\"http://mpc-hc.sourceforge.net/\">Media Player Classic</a> (<a href=\"http://codecguide.com/\">K-Lite</a> is all you really need). In Linux, it means taking a stroll through the package manager (I prefer to use <a href=\"http://www.nongnu.org/synaptic/\">Synaptic</a>, so I'll usually install that first), and adding whatever you need. <a href=\"https://apps.ubuntu.com/cat/applications/ubuntu-restricted-extras/\">Ubuntu Restricted Extras</a> are essential if you're going to be using the computer to play any media. Whichever OS I'm on, I'll install <a href=\"http://calibre-ebook.com/\">Calibre</a> to manage my e-books and <a href=\"http://www.gimp.org/\">the Gimp</a> to edit images.<br/><br/>    <span style=\"font-size: large;\"><b>Shortcuts.</b></span><br/><br/>As I mentioned, I don't use desktop shortcuts. Although I launch almost all applications from the app search bar that most OSs have these days, I still like to have quick ways to launch a couple of my more frequently used programs. I pin a few programs (namely the browser and media player) the the taskbar or panel, and add a couple shortcuts (text editor and calculator) to the start menu .<br/><br/>Although I compiled this list mainly as a reminder to myself, I've shared it with you in the hopes that you find it useful. Don't be scared to experiment, and remember that if you stuff everything up, you can always just format and start over.<br/><br/>What are some of the first things you do on a freshly installed OS?<br/><br/></div>", "published": "2013-01-22T17:43:00+02:00", "updated": "2013-02-26T08:41:16.821000+02:00", "draft": false, "categories": ["technology"]}