{"id": "i-was-watching-mythbusters-on-discovery", "title": "On a Misconception in the Chronological Succession of Mathematics", "content": "I was watching Mythbusters on the Discovery Channel the other day, when an announcement came on, warning that the next scene had an unusually high science content. I understand that not everyone is mathematically or scientifically inclined, and that possibly, they actually don’t care about the maths. Of course, I’d rather no one had a panic attack when coming across some unexpected mathematics, so in future, I’ll be employing a sign.<div class=\"readmore\"><br/><br/><div style=\"text-align: center;\"><span style=\"font-size: large;\"><span style='font-family: \"Courier New\", Courier, monospace;'><span style='color: red; font-family: Times, \"Times New Roman\", serif;'><strong>WARNING: HIGH MATHEMATICAL CONTENT.</strong></span> </span></span><br/></div><div style=\"text-align: center;\"><span style=\"color: red;\">If you wish to remain socially functional, do not pay</span><br/></div><div style=\"text-align: center;\"><span style=\"color: red;\">to much attention to the technical details.</span><br/></div><br/>Of course, if you are already socially dysfunctional, there's not much more damage that can be done, so I guess there’s no harm in reading on. If you are not mathematically inclined, but ignored my warning, it’s probably OK. There's actually not too much maths here. If you think back to high school, you’ll probably remember calculus. You may not remember what it involved, but you remember the name. If I mention the term differentiation, you may vaguely remember it. You may have forgotten how to do it, but the term sticks in your head. You may not remember integration. I certainly don’t, at least not from the high school syllabus. If you have any tertiary training in maths, however, you will probably remember these all too well, probably to the point of being sick of them.<br/><br/>To sum it all up, the interaction between any two interdependent properties can be described by a mathematical function. Calculus involves using this function to extract information about this interaction from the function. Differentiation is an operation which extracts information about how the interaction changes at a specific point, while integration does the opposite, and extracts information about the whole range of possible interactions.<br/><br/>Differentiation is quite simple, and taught in schools. Integration is usually quite challenging, and is left until university. It’s amazing how people simply jump to conclusions and assume that differentiation was invented first. The truth is that integration came first. Several thousand years first, actually. It’s a bit of a surprise to most, but quite obvious if you think about it.<br/><br/>Thinking in the simplest terms, with the two properties that interact giving the length and breadth of the walls of a room, then integration will give you the area, whereas differentiation will tell you how skew the one wall is. Now if you imagine extending this to a field. Integration will tell you how many seeds to buy to plant in the field, whereas differentiation will tell you, well, pretty much nothing. And the integration for a rectangular field is really simple, because it all just turns out to be length times breadth – a calculation any eight year old can do. The derivative is also simple. The derivative is also really simple. It's zero, as long as the fence is straight.<br/><br/></div>", "published": "2009-11-29T13:36:00.004000+02:00", "updated": "2013-09-12T12:11:29.611000+02:00", "draft": false, "categories": ["time", "history", "mathematics"]}