{"id": "minecraft-boeing-747-part-2", "title": "On the construction of a Boeing 747 in Minecraft - Part II", "content": "So, I did mention when this blog was still young that I <a href=\"http://www.alphasheep.co.za/2009/09/on-unfinished-work.html\">very rarely finish things</a>. But I did promise in my <a href=\"http://www.alphasheep.co.za/2012/04/on-construction-of-boeing-747-in.html\">introductory post for my Minecraft Boeing 747 project</a> that I would make the effort to finish it. And now I have. At least, I have finished the exterior.<div class=\"readmore\"><br/><br/>I started building it around the end of March on the <a href=\"http://esminecraft.co.za/\">EnderSouls Minecraft server</a>, so it's taken about 6 and a half months to get this far (admittedly with several breaks, at least one of which lasted several months). It's twice the size of the real thing, and mostly to scale, with a little bit of artistic license here and there (mainly around the windows and the writing on the side). <br/><br/>All of the building and material gathering was done in survival mode, although I did cheat a little by paying other players to gather a lot of the snow for me (the build took a staggering 160 stacks of snow blocks - which means over 40 000 snowballs needed to be harvested).<br/><br/>Anyway here are some screen shots.<br/><br/><img src=\"data/images/EqJEOdcvLj8.png\"/><br/><img src=\"data/images/WTkSxIS7kB4.png\"/><br/><img src=\"data/images/RtEXA9kCACs.png\"/><br/><img src=\"data/images/YqqY469Y2p8.png\"/><br/><br/>Because I had a few people asking me how I did it, I guess I'll give a rough breakdown of my approach to the build. I started by getting a few <a href=\"https://www.google.co.za/search?q=boeing+747+saa&amp;um=1&amp;tbm=isch\">reference photos</a>, together with what engineers call a \"<a href=\"https://www.google.co.za/search?q=boeing+747-400+3+view&amp;tbm=isch\">3 view</a>\" - which is just a scale drawing of the top, front and side views of the aircraft. You'll also need to know a couple of dimensions of the real aircraft, and the obvious place to get those is <a href=\"http://en.wikipedia.org/wiki/Boeing_747#Specifications\">Wikipedia</a>. It's important to note that no matter how good you think the photos are, you must be careful taking direct measurements off them, because perspective distorts distances. Stick to the drawings for measurements, and use the photos more for minor adjustments to get appearances right. <br/><br/>You'll almost certainly need to resize the 3 view. It's best to get a lower resolution image and enlarge it, because thicker blurry lines make it easier to fit a blocky curve. You need it pretty big, and you're not concerned about how it looks. The exact size you want is a easy to calculate, but you could find it with trial and error approach. Take the length of the aircraft in pixels in the image, and divide by the real length to get a distance of pixels per metre. I find that you need a minimum of 7 pixels per metre to get a decent representation, so find the factor you need to scale your image by to get 7 (or more) pixels per metre, and scale the image. In my case, I went from a roughly 700x400 image to a 2100x1200 image.<br/><br/>I used <a href=\"http://gimp.org\">Gimp</a> to do most of the measuring, but pretty much any photo editing software that can show a grid over your image and allows resizing and repositioning of the grid will do. Set the grid size to the number of pixels in a metre (in my case, 7). You can then use your discretion to judge the edges of curves. Start by building a frame, and then fill it in later. I found it easiest to mark the blocks roughly in bright colours using the pencil tool. Here's the 3 view I used once I was done with it.<br/><br/><a href=\"data/images/SV36qB4gm70.jpg\"><img alt=\"Click for full size image\" src=\"data/images/SV36qB4gm70.jpg\" target=\"_blank\" width=\"640px\"/></a><br/><br/>The wings and horizontal tail proved the most difficult to design. After a couple of attempts at doing it by eye from the photos and 3 view, I gave up. Instead, I wrote a very simple script in <a href=\"http://python.org\">Python</a> that calculates the positions of the blocks based on a minimal number of parameters (I've made this <a href=\"http://sylvermyst.com/software/#mcwingdesign\">Minecraft wing design script</a> available for download). One of the files output by the script gives a layer-by-layer breakdown of the wing, which is perfect for building in survival mode. You can easily calculate the angles by reading your coordinates in Gimp, and then using trigonometry to get the angles. If you do this, <a href=\"http://en.wikipedia.org/wiki/Atan2\"><i>atan2</i></a> is your friend.<br/><br/>These techniques will work reasonably well for any build. If you want to try something like this yourself, all you need is time, patience, and an eye for detail. Good luck.<br/><br/></div>", "published": "2012-10-18T09:37:00+02:00", "updated": "2012-11-08T07:29:33.308000+02:00", "draft": false, "categories": ["engineering", "Minecraft"]}