{"id": "my-mind-is-quite-prone-to-urges-to-look", "title": "On the Cure for Boredom...", "content": "... Which is quite simply, to do something which would induce boredom in others.<div class=\"readmore\"><br/><br/>My mind is quite prone to urges to look far deeper into things that provide little value to life. A recent <a href=\"http://xkcd.com/832/\">xkcd comic</a> about tic-tac-toe led me to try make my own version. Apart from all the obvious points, such as that there are several strategies which produce the same outcome, a lot of symmetry involved, and that tic-tac-toe is a bloody stupid game to begin with, I was still fascinated enough to try draw up my own optimal move maps. Needless to say, my attention span let me down. However, I was still able to complete a move map for crosses (click on the image below for a larger version), and just over 43.2% of the map for noughts. <br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/Eu8Kx1GOfEs.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"178\" src=\"data/images/Eu8Kx1GOfEs.png\" width=\"200\"/></a></div><br/>(On a side note, the probability of winning tic-tac-toe, assuming you are playing a person of any reasonable skill can be estimated with little difficulty for any possible move you make. Most people would calculate the probably of winning against a flawless player at 0%, but the correct value comes a little above this, since the chances of winning by default in the case of your opponents death (i.e. by cardiac arrest, assassination, aircraft crash, or meteor strike) before completing the game are neglected despite being significant compared to your overall chance of winning.)<br/><br/>Anyway, it got me going on the probability of winning at tic-tac-toe given certain moves, which gradually got me thinking of working out an optimum move map for other games. Which my mind then linked to a distant part of my memory which stores those techniques which are not really cheating, but give me a definite advantage in games. It’s the same part of my mind that vaguely remembers which properties to buy in Monopoly, and which opening moves to make in chess (unfortunately, it never learnt which moves to make after that). It is also that part of my memory that remembers blackjack card counting techniques I learnt years and years ago (If I actually knew how to play blackjack properly, I’d possibly even be able to pull one or two of them off). Which led me into wondering how I can get rich quick (legally and risk free) using a superior understanding of mathematics. However, my brain is so easily overwhelmed (actually, frustrated by its stupid human limitations, just like a computer with far too little memory. It often hangs for several minutes waiting for a result), and not wanting to be put off, I went to the university’s Mathematics library to get some books to read on the matter. Which I guess, if all else fails, will have saved me from boredom in <a href=\"http://alphanumericsheeppig.blogspot.com/2010/01/this-last-week-between-christmas-and.html\">the slowest week of the year</a>.<br/><br/>Mind you, I did successfully write a program which calculates the winning lottery numbers with 75% accuracy (and a confidence of 0.000005%, but since when is that important?). If only the stock market was also based on random luck. Maybe then I’d be able to work it out.<br/><br/></div>", "published": "2010-12-20T15:53:00.003000+02:00", "updated": "2013-01-21T14:22:48.024000+02:00", "draft": false, "categories": ["libraries", "annoying things", "mathematics"]}