{"id": "nanowrimo", "title": "On NaNoWriMo: Part V", "content": "For the third year running, I am taking part in <a href=\"http://nanowrimo.org\">National Novel Writing Month</a>. The object of NaNoWriMo is to write an entire 50 000 word novel in just 30 days. <div class=\"readmore\"> Of course, I'm cheating a little this year by attempting to finish the novel I started last year.<br/><br/>In 2011, I only managed 22 186 words, but I grew rather attached to my characters in the process. I promised at the time that I would eventually finish the novel, and that's what I'm doing now. I'm keeping the content separate though, so the word counts don't interfere with each other.<br/><br/>Here's a bit of a synopsis. If you like the story to be completely new the first time you read it (like I usually do) then you can skip it.<br/><br/><div style=\"margin:0 45px 0 45px;\">\"In Part I, we met Amser - the girl from so far away, the seasons are wrong - with her little box of powders and fuming chemicals. We also met Llyr, formerly Pedran, formerly Elhaearn, the son of Cledwyn Roch, former self-appointed lord of the city of Pyr, notorious pirate and marauder, insidious conman, and once proud owner of a sizeable private army that could successfully invade and occupy most of the country, should he have wished. We also met the Types, or at least two of them. Amser claimed to have built their bodies, mixed their blood and poured the life into them, but naturally, Llyr finds that difficult to believe. He would have paid it a lot more attention if they weren't on the run from the Company, who wanted Llyr dead, supposedly because a handful of corrupt politicians wanted him out the way, but there seems to be something even more sinister behind it.<br/><br/>\"Was that all in Part I? Most of it was, at least. Part II carries on from there, and will hopefully start providing answers. Will we learn why Amser left the Village, what happened to Briallen after the siege? Who is directing the Company, and why? Where is Llyr, and why was he so carefully tracking the Types so far from home, even though he was fully aware of the army of more than a thousand men hot on his heels?  And most importantly, who were the Ancients, and why did they disappear?<br/><br/>\"Will Part II answer these questions? I sure hope so.\"<br/></div><br/>You can follow my progress on the official NaNoWriMo site<a href=\"http://nanowrimo.org/en/participants/alphanumericsheeppig/novels/type-iv-part-ii/stats\">here</a> (notice that I'm always behind?). I update my wordcount there religiously as a form of procrastination, so you can rest assured that it's accurate to within about 10 minutes. <br/><br/>In the mean time you can read the <a href=\"http://www.alphasheep.co.za/2011/12/on-nanowrimo-part-iv-type-iv.html\">prologue</a>, or a <a href=\"http://www.alphasheep.co.za/search/label/fiction\">collection</a> of all (at least, most) of the fiction works I've posted on this blog.</div><br/><br/>Here's my daily progress for a revised goal of 27 817 words (the number needed to take the novel past 50000). Already looking better than last year, isn't it?<br/><br/><div align=\"center\"><img src=\"data/images/FJZGAp-w6ls.png\"/></div><br/>", "published": "2012-11-08T20:59:00.002000+02:00", "updated": "2012-11-08T21:13:21.362000+02:00", "draft": false, "categories": ["NaNoWriMo"]}