{"id": "on-amusing-hat-day-for-incompetence", "title": "On Amusing Hat Day for Incompetence Awareness", "content": "Every year, well over 6 billion people are affected by either their own or someone else's incompetence. It is a serious problem but it can be helped, if only more people would make the effort. For this reason, I propose a day for raising incompetence awareness on the 26th of August 2011. There is a <a href=\"http://www.facebook.com/event.php?eid=189954341040978\">Facebook event here.</a><div class=\"readmore\"> <br/><br/>Think of the last time you were affected by incompetence: a waiter forgetting to bring your drinks at a restaurant; a cashier at a supermarket giving you the wrong change; being given someone else's order at a fast food outlet; being stuck in traffic for hours because some truck driver took a corner too fast and rolled his truck; not being paid your salary because of some admin error; buying a poorly designed vacuum cleaner that has plastic parts where there should have been metal; or even just buying the wrong cable for your TV because the sales person had the wrong information. It is a major problem, and yet, perhaps, unnecessary.<br/><br/>For this reason, I propose that there be a day on which every one of you wears something on their heads that would not normally be considered a hat. If anyone asks why, then tell them that it is to raise awareness for incompetence.<br/><br/>Of course, raising awareness is useless unless something is actually done about the issue. Although I fear that we will be stuck with incompetence forever, I have thought for a long time on how to at least reduce it. The answer is to improve education. It's not that people aren't smart, it's just that they choose not to think. So, if you feel like it (it is completely optional), on the 26th of August, donate a book or two to the library of your local school. Or, you could donate some money to an orphanage or children's home (many of which don't get government subsidies) so that those children can get a better education and grow up to be competent individuals.<br/><br/>If we all work at this, we can make the world a better place. </div>", "published": "2011-03-16T09:51:00.001000+02:00", "updated": "2013-03-13T21:42:19.046000+02:00", "draft": false, "categories": ["incompetence", "libraries", "Amusing Hat Day"]}