{"id": "on-adding-bit-of-challenge-and-close", "title": "On Adding a Bit of Challenge, and a Close Call", "content": "Some people seem to always have good luck, and some always seem to have bad luck. It’s just one of those things (Yes, one of <i>those</i> things, started by one of <i>those</i> people. You know, <i>Them</i>... The ones who always <i>say</i>). Unfortunately, throughout my entire life, I have been cursed with neutral luck.<div class=\"readmore\"> My brother, on the other hand (that’s most likely the left hand, even though I tend to wave the right one when I say that. It’s just a trick to distract you from what’s really going on. Pay no attention to it.) always seems to have good luck. This made playing most board games against him almost impossible. In <i>Snakes &amp; Ladders</i>, for example, he’d take an average of 15 moves to finish, whereas I’d take around 30. Games like <i>Risk</i>, which are supposed to be games of strategy, were pointless because my troops rarely won in combat, since my average roll per die would be 3½, whereas his would be more like 5.<br/><br/>The game that annoyed me most(partly because I quite liked the game) was Monopoly. The main reason was that although my average roll per die remained 3½, my brother’s would vary so that he could magically avoid paying rent or landing in jail. He would draw all the good “Chance” cards, leaving me with the taxes and maintenance costs on my hotels. Eventually, when we were older, I made official changes to the rules by adding realism to the game. Rather than just allowing the money to flow freely, each player was required to record the flow of money using accepted accounting practices. Each transaction needed to be recorded in a journal, which was transferred into a ledger at the end of each round. Every tenth round, a player was required to produce complete financial statements, which were then audited by the other players. It did significantly slow down what is already a lengthy game, but that didn’t bother us. And while accounting is by no means fun, it didn’t really detract from the rest of the game too much (Actually, it did, a little, but it was better than the same person always winning. Honestly, I don’t have difficulty dealing with losing. I just get bored if every game is the same. Why don’t you believe me?).<br/><br/>It was for this reason that I was horrified when, in his final year of school, my brother decided he wanted to be an accountant. I couldn’t help feeling responsible for damning my brother into (no offence to any accountants reading this) what must be the most boring profession in the world. For the whole year, my conscience nagged at me (Not really, but I wanted to say it did. For dramatic effect). I breathed a small sigh of relief (Once again, only figuratively), when my brother decided at the end of the year that he wanted to be an actuary. Fortunately, he is now studying towards a real career in computer science and applied maths.<br/><br/>(On a side note: You’d think my parents would notice my brother’s unusually high luck and use him to win some money in the lottery, and you’d be right. The problem is, with the odds of winning a prize being 1 in 807, and the odds of that prize being the lowest possible prize (with an average earnings ratio of approximately 32.9 to 1 for a win (since he never got more than 4 numbers right)) being around 87.6%, even if my brother was 5 times more likely to win than the average person, it would still result in an average net loss over time of 79.6%. Never forget that lotteries were invented as fund raising schemes.)<br/><br/></div>", "published": "2010-10-08T08:40:00.001000+02:00", "updated": "2013-01-21T14:23:12.805000+02:00", "draft": false, "categories": ["luck", "annoying things", "mathematics"]}