{"id": "on-adhd-and-sprained-ankle", "title": "On ADHD and a Sprained Ankle", "content": "I sprained my ankle the Wednesday before last. Often, a sprained ankle can be too painful to walk on for the first 12 hours. Luckily, the incident that caused the injury took place in the evening, so most of those 12 hours were spent asleep.<div class=\"readmore\"> The next morning, I could move around with a limp, and the only thing that I couldn’t manage was making my way down stairs more than one step at a time. On the Friday, my ankle seemed to be fine. A little tender still, but I seemed to be able to move around it completely without any unbearable pain. In my world, that means that it had fully healed. <br/><br/>I should probably point out how I got the injury before I continue. I was sparring at Taekwondo class against someone considerably faster than me, and a bit more experienced. He left an opening just below his ribs on his right, and I went for it side (a deliberate opening, but it was too late when I realized). I threw a turning kick with my left leg as fast as I could, but he was quicker. He mirrored my kick, but much faster, and tried to dodge at the same time. Knowing his balance was not ideal, he threw out his right arm hard to help stay upright. My leg connected with his elbow right below the ankle, and I suddenly realized why Muay Thai fighters consider the elbow to be the most powerful weapon on the body.<br/><br/>It didn’t hurt at all. That was what confused me the most. I felt the impact, but no pain. It was only when I put my foot down that I realized I couldn’t stand. I was carried off the mats, and spent the last 20 minutes of the class massaging my ankle and trying to work out what was wrong with it. It was only a couple hours later that the pain started.<br/><br/>By Friday, I considered it to be healed. Also on Friday, the university had an open sports day, so that all the sports clubs could demonstrate what they had and attract members. (A bit of a pathetic event, since we were one of three clubs who showed up, ready to show off to a crowd of not even ten people). I had promised to demonstrate, and I thought my ankle was fine, so I did. By the time it was over, I had started the whole healing process again. I could barely walk on Friday evening, and was limping for most of Saturday. On Sunday it seemed OK, and on Monday, it fulfilled my criteria for being healed. On Monday, I went to my Taekwondo class again. I stilled considered myself healed, but by the end of the session, I couldn’t walk again. I hope I haven’t caused any permanent damage, because this time, after six days, it doesn’t seem to be getting any better. <br/><br/>The worst part about the whole thing is not that I brought myself pain. It’s my own fault. If I’d just taken it easy for a couple of days, it would have been long since healed. The problem is that I’ve also got attention-deficit/hyperactivity disorder. Not formally, mind you, but I’m pretty sure that I was misdiagnosed. I’ve only ever been diagnosed with ADD, without the hyperactive bit, but whenever I’m trying to pay attention to something, I get twitchy. I tap patterns on surfaces, or if none is available, on my legs. If my hands are busy (like they are now), my feet take over. It’s automatic, and I have no way of controlling it. This is a real pain. At work, the chair I sit in is quite high. High enough that my legs don’t touch the ground. My hands are busy typing, and so my leg begins to shake, with my foot hanging loose. This immediately sends a burst of unbearable pain through my ankle. I can’t stop it, and it’s driving me crazy.<br/><br/>I’ve tried hooking my leg around the leg of the chair, but that’s really uncomfortable. I need to move. It needs to be free. I don’t know what to do.<br/><br/></div>", "published": "2009-08-02T13:08:00.002000+02:00", "updated": "2013-01-21T15:23:28.682000+02:00", "draft": false, "categories": ["medicine"]}