{"id": "on-abstract-bacon-and-spring-roll", "title": "On Abstract Bacon and a Spring Roll", "content": "And don’t forget the squawking featherless chicken that was tasting them. It truly was a magnificent site. <div class=\"readmore\">  It spanned well over four acres, and had once been surrounded by a twelve foot wall. It was only when a group of people got together, plucked out all of the chicken’s feathers, and began to tickle each of the wall’s twelve feet that the siege was finally ended. But that was years ago, and to this very day, the chicken is upset about having to remain cold throughout the winter.<br/><br/>You might ask why the chicken could not just buy a blanket, and unless you asked the chicken (or an acquaintance of the chicken) directly, you would risk receiving something along the lines of a blank stare, accompanied by some judgement about your mental health. For that reason, it is probably best not to ask the question of anyone (or anything, for that matter), other than the chicken himself. If you were to ask the chicken, the response would possibly include stunned silence, blatant ignoration, one or more isolated squawks, a series of clucks, or an aggressive attack. Whatever the chicken’s response, it is almost certain that it will not actually contain the answer to your question – that the chicken is unable to afford luxuries such as a blanket. Chickens are virtually unemployable, and when they are employed, they are reimbursed by means of shelter, protection from predators and dried grain – none of which are suitable tender for purchasing a blanket.<br/><br/>The chicken did indeed try several means of obtaining a blanket (or something similar), some legal and not, and landed himself in some serious trouble with the law. Fortunately, a good attorney managed to convince the judge that although chickens are not technically flightless, they are only capable of flying short distances at very low altitudes, and therefore do not usually present a flight risk. So, with a suspended sentence hanging over his head, the chicken gave up on his hopes of ever being warm for the winter.<br/><br/>That is, until the bacon and spring roll came along. Both were sizzling hot, and the spring roll was wrapped in a thin but cosy blanket of a flour and water based batter. The chicken was almost certainly jealous, so temporarily forgetting his criminal record, he attacked them both. Inevitably, he began to chew on them (since claws and a beak are the only real weapons an unemployed chicken could have readily available). Naturally, the chicken was not disappointed in the taste, but since both the bacon and the spring roll were inanimate objects and incapable of vocalising their thoughts, the chicken never did find out how they had come to be so warm.<br/><br/>So if you ever come across a featherless chicken chewing on a piece of bacon, be sure to catch him and fry him. </div>", "published": "2011-04-12T14:24:00+02:00", "updated": "2011-04-12T14:24:49.207000+02:00", "draft": false, "categories": ["domesticated animals", "food"]}