{"id": "on-as-yet-unrealised-evolution-of", "title": "On the As Yet Unrealised Evolution of Natural Ultra High Speed Flight.", "content": "A sort of short story that I wrote one day while I was bored at work.<div class=\"readmore\"><br/><br/><div style=\"text-indent: 2em;\"><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif; font-size: x-large;\"><i>S</i></span><i style=\"font-family: Times, 'Times New Roman', serif;\">ARIETH</i><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\"> lifted up one of her silver heads to the howling gale. The snow had stopped, the mist was being pushed out, and the landscape beneath her metal cave on this concrete and steel mountain was slowly being revealed. Stretching all four of her massive metallic membrane wings as best she could in the limited space, she began to claw her way toward the opening. She let out a rusty cry as a ray of moonlight pierced through the mist and hit lit up her three heads. The screech echoed of the landscape, but no cry responded. She launched herself off the platform, and spread her wings wide. The fall seemed to take forever, but eventually there was enough air to fill her wings, and she began to glide. With one powerful downward sweep, she transformed the nose dive into forward flight. Drawing her wings back against her body, she began to clap them together, sending a powerful burst of air downwards and backwards, thrusting her body forward through the air. Steadily, she increased the rhythm of the clap, and pushed her three heads together. The force of the air flowing past her accelerating mass pushed her claws against her body, and pulled her tail out straight behind her.<br/><br/>She pulled up into a steady climb, rising above the clouds into the cool dark air of the midwinter night, still accelerating. She tensed up as she sensed shockwaves beginning to form on the tips of her wings. Her ears automatically sealed to protect them from the deafening bang of the shockwave that formed on the tip of her foremost beak as she broke through the sound barrier.<br/><br/>The air in front of her became like a steel wall, but she forced her wings together, now in a motion far more complicated than a simple clap, and her speed continued to increase steadily. The icy shards that had begun to form along her smooth body began to melt in the incredible heat generated by the air friction. A secondary heart began to pump, gently at first but getting stronger rapidly. It propelled not blood, but a liquid metal alloy, which did not transport oxygen, or any material substance, but rather energy. More specifically, heat. She separated her three heads. The thrusting of her wings was no longer enough to keep her body accelerating, but she had climbed high enough. She stopped her wings, and held them slightly apart; spread only just enough to stop her from spinning out of control. Her trajectory followed the classic parabola followed by all free projectiles, and this brought her into a dive. Trading altitude for speed, she began to drop.<br/><br/>The tips of her three beaks began to glow red with the heat, and the metallic blood which flowed just below the surface began to boil. The second heart pumped harder, and the gas was forced through the swollen veins to the membrane of the front pair of wings. There, the heat gradient between the two pairs of wings caused an electric current. Blue yellow sparks arced from one wing to the other. She crashed her wings together, releasing a massive bolt of lightning, which ripped through the air around her. She slowly brought her wings apart again, and the arcing returned. Again, her wings crashed together, this time sending a bolt of electricity towards her tail. She continued this, each bolt of lightning providing thrust. In between thrusts, the incredible drag, now several times here own weight, was sapping away at a large portion of the extra speed. A slight twitch of her tail brought her path parallel to the ground.<br/><br/>She began clapping her wings faster and faster, the rapid acceleration and deceleration sending a terrible vibration through her body. Any movement other than the flapping of her wings was now impossible. The slightest turn of one of her heads would snap her neck and send her spinning out of control toward the ground.<br/><br/>The shock of each thrust burned through her skeleton. The thick atmosphere, which had provided the energy to reach this speed, was quickly becoming a curse, preventing her from accelerating further. Another imperceptible flick of her tail sent ripples through her entire body which resonated with the thrust of her wings. Further flicks maintained and magnified these waves which bounced between her heads and tail. The vibration forced the air at her sides to move out of the way, and a complex pattern of shockwaves surrounded her. Far to slow to keep up with her body, the air left vacuum pockets, which quickly spread over her entire body. The only air touching her now was a single molecule at the tip of each beak, which provided almost no opposition. Now free from the drag which had limited her before, there was no longer anything to hold her back. However, the source of her energy had also been eliminated.<br/><br/>There was still some heat to be distributed, and the charge in her wings would last another couple of seconds at least. Thunder crashed as her wings crashed together, far faster than ever before, now that there was no air between them to hold them back. The lightning released was far more powerful, stripping the surrounding air into its atomic constituents. Further flaps did the same, and ignited the air. Engulfed in flames, Sarieth continued to accelerate forwards. Light and infrared radiation from the flames now did what the air friction had done before – provided the heat to power her thrust. The whole procedure had set her on a climbing trajectory. The tail no longer provided the necessary disturbance to maintain the vibration, but in the time it took the vibration to damp out, such a distance would have been covered, that it did not matter. The air grew thinner as her altitude increased, until it eventually disappeared. Now gravity was the only force holding her back, but it was in a much diminished form. Even more so now, as her momentum carried her high up, where the sun was merely a big ball of glowing fire, providing only direct light. There was no scattered ambient light as within the atmosphere, and likewise, there was no ambient heat.<br/><br/>Gills located at the base of her neck opened and flexed. Exhaling briefly but rapidly through the right gill caused her to turn gradually left. An identical burst through left gill halted the turn. This completely altered her trajectory one orbiting the sun. Her wings, although no longer flapping, now lay outstretched. The larger front pair cast a shadow which completely obscured the rear wings from the light. Although the front wings had carried the bulk of the heat (and still did), the propulsive exercise had warmed the rear wings considerably. They now glowed slightly in the dark as they radiated excess energy. Their surface temperature began to plummet. The front wings, however, were in direct sunlight, and were barely cooling at all.<br/><br/>As before, the temperature difference induced a voltage between the two pairs of wings, but this time, Sarieth did not clap her wings together, but held them steady, maintaining an electric field between them. It is popular belief that space is empty, but this is in fact far from the truth. Far out it interstellar space, there may be millions of miles between atoms, but here, in the relative proximity of planets, asteroids and comets, dust particles and rogue molecules were scattered so frequently that there was rarely more than a metre between particles. A large number of the dust particles carry some small static charge, and the majority of stray molecules were ionised, having been catapulted from their source with extremely high energy, either in some form of collision, or a nuclear explosion.<br/><br/>Caught in Sarieth’s electric field, the particles began to gather on the front and back wings (depending on the nature of their charge), forming a barely visible film. Slowly, they began to be absorbed into her bloodstream, which transported them to an unusual organ located at the tip of her tail, where they were collected.<br/><br/>At a speed far in excess of the planets, Sarieth could orbit the star in a hundredth of the time of even the fastest planet; however this still took several hours. After several such orbits, the swelling that had formed at the tip of her tail was impossible to detect without extremely sophisticated instruments. Releasing an incredible amount of energy that had been built up for decades, Sarieth detonated a burst of energy at the edge of the sphere that had formed. The blast was directed rearward, forming a nuclear fusion chain reaction amongst the absorbed molecules, forming a single massive atom containing several millions of billions of subatomic particles, which by the theoretical laws of classical atomic physics, should never have been allowed to exist; should have ripped itself apart almost instantaneously. However, due to an anomaly in the quantum nature of time, the time period in which this needed to occur did not exist. In order to conserve the mass-energy balance, a ripple of uncertainty ran through the fabric of the space-time continuum around her body. Local space began to distort around her, expanding to allow the atomic decomposition. When space was finally distorted enough to allow the atomic decomposition to occur, it did, and a fission reaction occurred, only to produce products which were almost as unstable as the original atom. A second fission reaction occurred, and then a third, continuing on in an endless explosion, which ripped apart the last third of Sarieth’s tail. The thrust produced in the distorted reality was inconceivably tremendous, accelerating her to a fair fraction of the speed of light. The only thing that limited her was the fact that her mass was steadily increasing and time around her was slowing. At almost a tenth of the speed of light, the reaction had run out. As it did so, space collapsed back to normality, and her speed, which had been a tenth of the speed of light in distorted space, now exceeded it by several billion times.<br/><br/>Reality had essentially been tricked, which sounds really unusual, but don't worry - It happens all the time...<br/><br/>At this incredible speed, her mass was beyond infinite, collapsing the entire universe instantaneously into a singularity, however, outside her own body, nothing happened. Time no longer flowed in a linear fashion, but rather oscillated and looped back within itself that one could no longer describe in a simple one dimensional coordinate. Even a ten dimensional coordinate would barely be adequate. Space, on the other hand, had been compressed into one dimension.<br/><br/>Outside this anomaly, in normal three dimensional space, with one dimensional time, Sarieth ceased to exist.<br/><br/>Many billions of years earlier, at the far edge of the universe, a small tear appeared in the gravitational fabric that formed the border between existence, and nothingness. Existence began to fade, flowing out into the endless nothingness.<br/><br/>If it could, the nothingness would have had a gently satisfied smile. Sarieth reformed into reality right at the beginning of time, the universe erased from existence. She glided gracefully through the emptiness. No more stupid laws of physics to hold her back from it.<br/><br/></span><br/></div><br/></div>", "published": "2009-01-17T14:38:00.005000+02:00", "updated": "2011-04-07T12:59:57.526000+02:00", "draft": false, "categories": ["fiction"]}