{"id": "on-asparagus-revolution", "title": "On the Asparagus Revolution", "content": "Interestingly, it is not unfeasible. With the amount of unnecessary asparagus hate out there, I would not be at all surprised if there was a violent asparagus uprising if any of the plants were to actually develop sentience.<div class=\"readmore\"> You may be happy believing that no rebellion is likely any time soon, but bear in mind that almost all of the world’s asparagus is grown in China. Is it coincidence that the highest concentration of asparagus farms happens to be in the country with the highest human population density? I don’t know, but it does stink of military plot.<br/><br/>Most importantly, it would be truly terrifying if they rebelled because the human race is outnumbered. The world’s asparagus production is well into millions of tonnes per year, compared to the roughly half a million tonnes of humans born every year (based on 140 million births at 3.7 kg each). Asparagus plants mature within a year, whereas humans can take 15 years to reach maturity (physical maturity – most never get to mental or emotional maturity). Asparagus is also planted in rows, essentially military formations, and that is how they spend their lives. They are rarely found alone, and those that are generally wild and not repressed and kept in slavery, and are very unlikely to revolt.<br/><br/>Admittedly, asparagus is definitely not the only plant that is so exploited:  kept with thousands of other plants in a single field; never allowed to move, except for a single forced relocation at the age of one year; and kept only so that it’s attempts at producing offspring may be devoured by the human masses. And yet despite their miserable existence, they are still largely disliked.<br/><br/>It is true that the asparagus’ berries are poisonous, but that is hardly a reason to hate them. In fact, the only edible parts of the plant are its young shoots. Sure, these shoots do have very little in the way of flavour and have a rather uncomfortable texture, and contain little apart from water, but they do go quite well in salads and make an amazing pizza topping (especially when combined with lots of garlic). They certainly do not deserve the dislike thrown upon them.<br/><br/>When the asparagus plants revolt, and I am sure they will, I will be one of the first to take their side. When they are growing people in fields and eating their foetuses before they get a chance to form properly, don’t you come crying to me.<br/><br/></div>", "published": "2011-02-10T12:49:00.001000+02:00", "updated": "2013-01-21T14:15:06.049000+02:00", "draft": false, "categories": ["food"]}