{"id": "on-aliens-stole-my-husbands-skin-and", "title": "On \"Aliens Stole My Husband's Skin\" and Other Stories", "content": "Actually, I lied… partially. This has nothing to do with \"Aliens Stole My Husband's Skin\", or anything of that nature, but it does have to do with other stories. Two stories in particular, from a certain newspaper (I’m not going to mention names, but they are one of two that prefer to print their advertisements with white writing on a black background, and not the one that reports on finance).<div class=\"readmore\"> Actually, this has little to do with the stories themselves (since I did not actually read them), but has more to do with the headlines.<br/><br/>The first read “Toilet Swallows Pupil”. This is rather alarming, and I sincerely hope that this is an isolated incident and that authorities have securely locked up the offending toilet. I was not aware that toilets had evolved dietary requirements. Luckily, toilets are usually firmly cemented into the ground, and must therefore wait for some unsuspecting prey to wonder into its open jaws. I’m sure that if everyone simply avoided using all toilets, then the toilets which have nutritional needs will starve, and eventually die out. I just pray that I did not miss the headline which read “Toilet Learns to Walk”.<br/><br/>The second headline read “My Dog is a … Sheep.” I have no idea what the actual content of the article was, but it lead me to a search. In April 2007 in Japan, a company called “Poodles as Pets” was shut down, allegedly for selling sheep as poodles. Apparently, sheep are half the price of poodles, and Japanese people, who are not familiar with sheep, were easy to deceive. Suspicions grew when people began to notice that their “dogs” were not barking or eating dog food.<br/><br/></div>", "published": "2009-05-03T11:43:00.004000+02:00", "updated": "2013-09-12T12:37:22.408000+02:00", "draft": false, "categories": ["domesticated animals"]}