{"id": "on-balancing-galloping-chipmunks", "title": "On Balancing Galloping Chipmunks", "content": "I’ve never really seen the ability to balancing a galloping chipmunk in a peanut butter jar on my earlobe as a really useful skill, unless I was stuck in a monsoon in the jungles of Bangladesh, trying to save numerous genetically modified animals which could trigger massively destructive explosions when even slightly wet.<div class=\"readmore\"> In a desperate attempt to save the world, with an animal in plastic bag under each arm, and nothing else to put the chipmunk in, I’d be forced to grab the nearest peanut butter jar, eat it all in seconds and shove the chipmunk in. Anyone who has watched me walk in rain will notice that I tilt my head to the right (or probably not, since its not the sort of thing people look out for, but if they know to look out for it, they will see it). This makes balancing the peanut butter jar on my head impossible. I will be forced to balance it on my left earlobe. The thing that prevents me from learning this skill is that my sense of balance is a bit below average (for the same reasons that I tilt my head in the rain). In the meantime, I have been making every effort to stay out of Bangladesh during the monsoon season, just in case.<br/><br/>The most useful skill I have been able to learn is the ability to operate the bath taps with my feet. This means I have complete control over the water temperature without even having to lift a finger. Having been able to do this for most of my life, I began trying to use my feet for various other things. Not so successful attempts were made at operating the kettle and the stove, however the microwave was mildly successful (Luckily, it’s a digital one). Opening doors is easy, except for the garage door, which is on a step and used to be slightly out of my reach. Especially if there is a car parked next to it, preventing my leg from stretching to its full reach. With practice, I have been able to reach even that door easily in the last couple of years.<br/><br/>(On a side note: Please understand that I don’t do this all the time. It is far more efficient to use my hands to open doors, but if my hands are holding something heavy, it is far easier to use my foot to open the door than to put whatever it is down and pick it up again.)<br/><br/>There are only two doors that force me to use my hands. The first is the bathroom. After a bath, the floor is often wet and slippery, and standing on one leg on a wet floor with a below average sense of balance is definitely not a smart idea. Anyway, I’m hardly ever carrying anything, so using my hands is the safest, simplest and most efficient option. The second type of door is a car door. The designers of most car doors do not think of feet. Barefoot I can usually manage to get the door open, but closing it is a mission. However, when I want to get into a car, I’ll typically be wearing shoes, which really makes it impossible.<br/><br/>If only my toes weren’t so clumsy, I’d also be playing the piano with my feet by now.</div>", "published": "2009-05-31T15:31:00.004000+02:00", "updated": "2011-03-07T15:34:06.410000+02:00", "draft": false, "categories": []}