{"id": "on-blue-monkey", "title": "On Google and the Blue Monkey", "content": "Regular followers of my blog will know that I have a fascination with appearing in Google’s searches. As a person who spends a lot of time searching Google for scientific content, with in depth explanations. More technical than what a high school or first year student would be looking for. And I am almost always disappointed.<div class=\"readmore\"> (My fellow students will understand how useless Google actually is if you aren’t just an average bored person, or twelve year old with a project for school.<br/><br/>When I eventually worked out that there are far better ways to get quality information that is accurate and reliable, I decided that I’d feed those poor unfortunate Google users with the information they want. Please don’t misunderstand this. I am a nice person. I am not aiming to get onto Google searches just to be a pain in the neck. Where ever possible, I’d like to bring those ignorant people the information that they want.<br/><br/>Google includes an extremely useful feature for web site owners, called “Google Webmaster Tools”. It allows users to see what Google searches return my blog in the results, and which of these actually led people to click a link to my blog. It is remarkably interesting how little information is on Google if you see the sorts of searches that will put me near the top of the results.<br/><br/>In particular is a search “blue monkey wikipedia” which returned my blog on the first page. Naturally, I was curious and did some research. The blue monkey (or diademed monkey) is in fact a silver and gray monkey that can be found in Eastern and Central Africa. It’s interesting that the vervet monkey which is very common in South Africa is called a blouapie in Afrikaans (translated literally as “blue monkey”). This is a completely different type of monkey. The truth is that neither monkey is actually blue, which just goes to reaffirm that biologists have no clue about the real world.<br/><br/>Another one that I am particularly proud of is that a search for “flapping flight” returns my blog as number 176 on the list. (I have not verified this.) The reason that I’m proud of it is that it’s a field I’m really interested in. If anyone really is interested in this from a scientific or engineering point of view, I refer you to the work of Ansari et.al. who seems to have the best mathematical model. They approximate the wing by a thin cambered Joukowsky airfoil, and use potential flow theory to model the unsteady flow over the wings. The analysis is extended into three dimensions by considering the vortex and wake interactions as the wings flap. He then uses a momentum based method to extract the forces and moments on the wings, and presents them in two neat little vector integral equations. (<a href=\"http://0-www.sciencedirect.com.innopac.wits.ac.za/science?_ob=ArticleURL&amp;_udi=B6V3V-4KSVFXJ-1&amp;_user=1378557&amp;_origUdi=B6TX5-4PNJ1K2-5&amp;_fmt=high&amp;_coverDate=02%2F28%2F2006&amp;_rdoc=1&amp;_orig=article&amp;_acct=C000052500&amp;_version=1&amp;_urlVersion=0&amp;_userid=1378557&amp;md5=5e249a646673217533531f6c43d1cbab\">Refer to Ansari, SA; Zbikowski, R; Knowles, K: Aerodynamic modelling of insect-like flapping flight for micro air vehicles, Progress in Aerospace Sciences, Volume 42, Issue 2, February 2006</a>.)<br/><br/>The one that concerns me is the number of people looking for a cross between a pig and a sheep. If they are possible, then they are almost certainly sterile and pointless. A half pig half sheep would be stupid idea. I think you should be far more worried about a half sheep half jaguar. They would look like fluffy white (very much) overgrown domestic cats, until you get too close, and they pounce on you.<br/><br/>The other thing that concerns me is that there really is such a thing as a blue potato.</div>", "published": "2009-06-07T16:38:00.008000+02:00", "updated": "2011-04-07T13:16:12.396000+02:00", "draft": false, "categories": ["Google", "domesticated animals"]}