{"id": "on-birthday-shift", "title": "On the Birthday Shift", "content": "<div class=\"readmore\">I don't like birthdays. It's not that I've ever had a bad birthday (in fact, they've all been really great so far). It's just that I find the whole concept desperately stupid. But that is not the subject of this post. <br/><br/></div>Without giving it much thought, people celebrate their birthdays on the same calender date every year, without bothering to account for the fact that leap years are a day longer than other years. This leads to a inconsistency where a person who dies at exactly the same age as another (born in a different year) may actually have lived a day or two longer. <div class=\"readmore\"><br/><br/>I don't like this, so I propose (for those who do insist on celebrating birthdays) the Birthday Shift, which allows the calender date of the birthday to move around in order to account for the fluctuation caused by leap years. This is not dissimilar to the moving dates and times of the solstices and equinoxes.<br/><br/>For those unfamiliar with the way our calender works, I will briefly explain it. Our calender year is not, as commonly stated, related to the length of time it takes the earth to go around the sun. Our calender year is roughly based on what is called the tropical year, which is the average length of time between any two consecutive solstices or equinoxes. This is on average about 365 days, 5 hours and 49 or so minutes, but it varies in length by a couple of minutes from year to year, depending on which solstice or equinox is measured.<br/><br/>We use what is known as a Gregorian calender year, which attempts to follow the tropical year by using a 365 day year, except in leap years. Leap years occur every fourth year, but not at the turn of the century unless the year is also a multiple of 400. This gives years with an average length of 365 days, 5 hours, 49 minutes and 12 seconds - less than half a minute off from the mean tropical year.<br/><br/>(On a side note: The length of time it takes our planet to complete one orbit starting and ending at it's furthest point from the sun is called an anomalistic year, and is about 25 minutes longer than one Gregorian calender year. The time it takes for the Earth to do one complete orbit relative to a more or less fixed reference frame (such as distant stars) is called a sidereal year, and is 20 minutes longer than one Gregorian calender year.)<br/><br/>What I'm getting at is that the 365 and 366 day years that we use are just an approximation to a 365.2425 day year that our calenders are designed to follow over long periods of time. <br/><br/>I was born in the evening. On the same calender date two years later, my parents celebrated me turning two years old. Although I did indeed turn 730 days old that day, I actually turned 2 years (730.485 days) old the following morning.<br/><br/>I propose that a person's birthday be redefined as the calender day on which that person's age passes an integer value. This will at least enable a person to correctly report their age in years on their birthday. It will result in the date shifting a little from year to year, but with the aid of modern computers, it is not at all difficult to calculate. One simply finds the number of leap days between your birth and the year of interest from<br/><br/><div align=\"center\"><app-latex>{ n = \\sum_{y=y_b}^{y_n} l(y)}</app-latex></div><br/>where <app-latex>{y_b}</app-latex> and <app-latex>{y_n}</app-latex> are the year in which you were born and the year before the current year if you were born in January or February, or the year after you were born and the current year if you were born in March or later, and the function <app-latex>{l(y)}</app-latex> is given by<br/><br/><div align=\"center\"><app-latex>{ l(y) = \\left\\{\\begin{matrix} 1&amp;;&amp; \\left(y\\textrm{ mod }4=0 \\textrm{ and }y \\textrm{ mod }100\\neq 0 \\right ) \\textrm{ or } y \\textrm{ mod }400=0\\\\ 0&amp;;&amp; \\textrm{otherwise} \\end{matrix}\\right.}</app-latex></div><br/>The total shift, in hours is then simply given by<br/><br/><div align=\"center\"><app-latex>{ S = 5.82 \\left(y_n-y_b\\right) - 24 n}</app-latex></div><br/>I created a spreadsheet that calculates the deviation of the proposed corrected birthday from the traditional birthday in hours, for any combination of year and birth year between 1600 CE and 2400 CE. The shift runs on a 400 year cycle, and exceeds 24 hours for everyone, although occasionally not in a human life time. If you happened to be born in the 101st year of a cycle (i.e. 1701 or 2101), you would have to live to the age of 367 to see it happen. However, if you were born in the years 1696, 1697, 1698, 1796, 1797, 1798, 1896, 1897 or 1898, the shift would have exceeded 24 hours by your fifth birthday. I'd guess that the earliest any of my readers (i.e. people born between 1960 and 2000) could expect a shift would be at the age of 37 for those born in the year preceding a leap year. These people will also be subjected to a 36 hour shift in the year of their 101st birthday.<br/><br/>Should advances in medicine manage to keep people born in the years 1903, 1907, 1911 alive to the age of 185 (which I seriously doubt), they will experience shifts of over 50 hours. Those born in 1903 will have such a shift in 2088, 2092 and 2096.<br/><br/>Consider a more typical case of a person who happened to be born, for arguments sake, at noon on the 5th of February 1983. The actual day on which they are born makes absolutely no difference, provided it is before the end of February. The graph below shows the gradual shifting of the birthday from year to year.<br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/ltSgGLzhgCQ.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"261\" src=\"data/images/ltSgGLzhgCQ.png\" width=\"400\"/></a></div><br/>The shift is quite significant, and if the person in question were to live to the age of 120, they should celebrate only 22.5% of their birthdays on the 5th, 74.2% on the 4th, and 3.3% on the 3rd.<br/><br/>Interestingly enough, the graph follows roughly the <a href=\"http://en.wikipedia.org/wiki/Gregorian_calendar#Calendar_seasonal_error\">same pattern as the time of the summer solstice</a> (which is not surprising, since they are driven by the same underlying mechanics).<br/><br/>I wonder if astrologers actually bother to account for the difference between date from year to year. In fact, astrology should use the sidereal year (since it's the one that's fixed relative to the stars) rather than a Gregorian calender year. The resulting shift is magnified by an average of 46% over the first 80 years of a person's life in the sidereal calender, and it loses its periodicity. The cut off points for a certain zodiac sign would have to move about by a couple of days from year to year.<br/><br/></div>", "published": "2012-02-22T09:32:00+02:00", "updated": "2012-02-22T09:32:58.157000+02:00", "draft": false, "categories": ["time", "mathematics"]}