{"id": "on-behaviour-of-peacocks-and-people-part-ii", "title": "On the Behaviour of Peacocks and People Part II: Plastic Bags", "content": "Back in March, I wrote a post comparing the similarity of <a href=\"http://alphanumericsheeppig.blogspot.com/2009/03/on-behaviour-of-peacocks-and-people.html\">behaviour of peacocks and people</a>, especially when it comes to crossing the road. At the time, I put the behaviour down to intelligence, but I should have realised that it all has to do with aerodynamics.<div class=\"readmore\"><br/><br/>The reason I bring this up is because I saw a plastic bag trying to cross the road. (That is, I hope it wasn’t actually trying. I hope that there was merely a slight crosswind carrying it. I’d prefer to believe that plastic bags have not developed intelligence.) There was an almost solid stream of traffic, and the plastic bag was unable to cross. However, it still made as if to cross in front of each car, but quickly moved back. When there was finally a small gap in the traffic (due to the fact that I happened to be driving a bit slowly), the bag made a mad dash into the road, but slowed as it saw me approaching. Since I am slightly less concerned about the damage a plastic bag would do to my car (compared to that of, say, a peacock or person), my evasive actions were not particularly drastic. I did not slow down, and moved over only slightly. The plastic bag immediately jumped back onto the pavement out of my way. It’s interesting to note that that’s exactly the way people behave.<br/><br/>(On a side note: Why do we call the paved bit the road, and the unpaved bit the pavement? I believe that some foreigners refer to them the other way round. Where did the language get confused like that?)<br/><br/>(On another side note: Do peacocks hibernate for the winter? I haven’t seen them in a while and I haven’t heard them squealing at night. It’s interesting to note that the peacock’s mating call sounds exactly like I’d imagine a three year old human would if he was dropped in a meat grinder.)</div>", "published": "2009-06-28T16:57:00.005000+02:00", "updated": "2011-04-07T12:59:39.060000+02:00", "draft": false, "categories": ["incompetence"]}