{"id": "on-blue-monkey-stealing-potato", "title": "On the Blue Monkey Stealing Potato", "content": "Or more correctly, the blue-monkey-stealing potato. Not an ape that is in need of extra starch and not prepared to pay for it, but rather a vegetable that has the compulsive urge to slip extremely rare primates under its coat as it walks past. You can normally tell these potatoes from other potatoes, because most potatoes do not wear coats... Or walk past blue monkeys.<div class=\"readmore\"> If you do see a potato walking past blue monkeys, you should definitely be suspicious. However, if one happens to land up fried on your plate, it is probably safe to eat it. There is no evidence of anyone having died from eating a blue-monkey-stealing potato. But people have died from eating normal potatoes.<br/><br/>(I apologise for the boring factual nature of the following paragraph, but it is necessary for me to make my point...) Because, in fact, all potato plants are poisonous. The dark green fruit is the most toxic part of the plant, but it only really contains seeds, so no one would want to eat it anyway. The leaves and stem are also quite poisonous. Even the root (which we eat) is slightly toxic. While not usually deadly, potato poisoning can cause headaches, diarrhoea, cramps, or comas. Luckily, the more toxic the potato, the greener it is, and cooking the potato partially breaks down the toxic chemicals. This is the reason that the potato gets whiter as it cooks.<br/><br/>(On a quite pointless side note: Apparently, Belarus is the highest per capita consumer of potato in the world, with each person eating almost 930 grams of potato a day. Someone should probably sell them some cows so they have something to eat with it. Of course, my source is the good old unverified Wikipedia, so who knows if it's true. Either way, its a lot of potato.)<br/><br/>Who was the one who decided \"This fruit is poisonous, so I'll eat the root instead\"? And even further along the line, someone thought, \"Maybe this will be less poisonous if I chop it up and fry it.\" Did they try it themselves first, or did they get their friends to try it first? Is that really ethically correct? However it happened, I'm grateful for it. I really really like potato.<br/><br/>Of course it might all just be a scam by penguins to bring down the outstanding reputation of the potato. They are always doing things like that. Although the majority of penguins only have good intentions, there are always those that are out to ruin things for everyone else.</div>", "published": "2009-03-22T14:41:00.014000+02:00", "updated": "2011-04-07T13:18:14.669000+02:00", "draft": false, "categories": ["those damn penguins", "food"]}