{"id": "on-balancing-cheeseburgers", "title": "On Balancing Cheeseburgers", "content": "This seems easy at first - Cheeseburgers are contained in buns, which initially appear round, but anyone with experience with cheeseburgers (or anything in buns) will be able to point out that they have flattened bases. Balancing is a naturally stable position for them. The problem is balancing cheeseburgers... plural.<div class=\"readmore\"> The simple approach to this is to place the burgers next to each other on a flat horizontal surface. Since a single cheeseburger is a stable system, two independent cheese burgers will also be two independent stable systems. Given sufficient space, balancing any number of cheeseburgers is a trivial problem.<br/><br/>The problem only becomes non-trivial if one imposes constraints, either by limiting the space, or by limiting the type of surface to one that is either not flat, or not horizontal. Or both. For example, if the problem were to be restated as \"Balance sixteen cheeseburgers on someone's head,\" this would transform a completely trivial problem into one that requires significant thought and skill to solve.<br/><br/>The obvious solution is to devise some support for the cheeseburgers. However, in doing so, one must bear in mind the stability of the base. For example, one could drive a rigid steel support through all the cheese burgers and a sufficient depth into the base to ensure stability. However, driving a steel support to far into the base (which is someone's head) would increase the probability of the base falling over. One could take the idea one step further, and drive the steel support further down, into whatever the person is standing on, however this would require a great increase in the length of the support.<br/><br/>As with all long supports, buckling now becomes an issue. One could increase the diameter of the support, but the diameter should not be so large that it affects the ability of the cheeseburgers to stay together. The support would thus need to have a steadily varying diameter, to ensure that it does not buckle in the lower portion of its length, and that it does not cause excessive damage to the cheeseburgers along the upper portion of its length.<br/><br/>Some sort of grip will need to be designed so that the base does not slip off, and a mechanism would need to be attached to the top of the support to apply a constant pressure to the cheese burgers. This is necessary to ensure that contact is maintained between the cheeseburgers and the base (which is not explicitly stated, but is certainly implied by the problem statement).<br/><br/>This brings one to the question of whether using a support really is balancing, however, this question is irrelevant. It is true that the problem did specifically state that the cheeseburgers must balance, but surely this is imposing an unnecessary constraint on the solutions. The problem needs to be restated so that this constraint is removed. The new problem, structured to suit the devised solution is \"Get sixteen cheeseburgers to stay on someone's head.\" If there really was a reason that the cheeseburgers had to balance (taking the word literally), then the easiest solution would be to fit each cheeseburger with electric fans and an intelligent control system to maintain stability. But what is the difference between using the air for support and using a steel rod?<br/><br/>You may be asking at this point what the point to all this is. I think that's a stupid question. If you wanted to ask an intelligent question, you need to start with \"Why?\"</div>", "published": "2009-02-22T12:26:00.005000+02:00", "updated": "2011-04-07T13:03:22.221000+02:00", "draft": false, "categories": ["engineering", "food"]}