{"id": "on-better-dates-for-south-african", "title": "On Better Dates for South African Public Holidays", "content": "Public holidays that fall on a Tuesday or Thursday (like earlier this week) tend to trigger that thought of \"Hey, it's one day short of a long weekend, so why don't I just take an extra day off?\". This leads to a drop in productivity for that week. Wednesday holidays tend to spark similar reasoning for some people.<div class=\"readmore\">If you exclude the two Easter holidays, the two Christmas holidays and New Year's Day, you are left with seven public holidays. Each of these seven holidays will fall on a different day of the week, so that each day from Monday to Sunday has a corresponding public holiday. This year, it just so happens that these roles are filled by Heritage Day, Workers' Day, Human Rights Day, Women's Day, Freedom Day, Youth Day, and the Day of Reconciliation respectively, but this varies from year to year.<br/><br/>In theory, this even distribution should mean that there will be the same number of those \"extra days off\" every year (exactly two). Likewise, there will be exactly one public holiday missed each year due to it falling on a Saturday (at least for those of us in Monday to Friday jobs). So, from year to year, the overall number of unproductive days should be identical. However, there is little consistency in the distribution of these. Also, an additional \"extra day off\" comes in if either Human Rights Day or Freedom Day falls on a Wednesday in the same week as one of the Easter public holidays (as happened in 2011). <br/><br/>So, to deal with all of this, I propose that those seven public holidays be assigned dates that move from year to year. This is not dissimilar to the way that federal holidays are observed in the United States. <br/><br/>I have done all of the necessary calculations to minimise the distance that each holiday moves in the years 2000 to 2100, inclusive. The table below gives my proposed public holiday dates, as well as the average deviation from the current date for that holiday throughout the 21st century. Where there was no difference between having the holiday on a Monday or Friday, I favoured a Friday holiday, but a Monday holiday would be equally valid (although I suspect that a week with a Friday holiday would be more productive than a week with a Monday holiday). Holidays for which this was the case are marked with an asterisk.<br/><br/><div style=\"text-align: center;\"><b>Table 1</b>: Proposed New Public Holiday Dates.<br/></div><table border=\"1\" cellpadding=\"5\" width=\"100%\"><tr> <td style=\"text-align: center;\" width=\"30%\"> <b><i> Public Holiday </i></b> </td> <td style=\"text-align: center;\"> <b><i> Current Date </i></b> </td> <td style=\"text-align: center;\"> <b><i> Proposed Date </i></b> </td> <td style=\"text-align: center;\"> <b><i> Deviation </i></b> </td> </tr><tr> <td> Human Rights Day      </td> <td> 21 March     </td> <td> 3rd Monday of March      </td> <td> 3.03 days </td> </tr><tr> <td> Freedom Day           </td> <td> 27 April     </td> <td> Last Friday of April    </td> <td> 1.71 days </td> </tr><tr> <td> Workers' Day          </td> <td> 1 May        </td> <td> 1st Monday of May        </td> <td> 3.97 days </td> </tr><tr> <td> Youth Day             </td> <td> 16 June      </td> <td> 3rd Friday* of June      </td> <td> 2.29 days </td> </tr><tr> <td> Women's Day           </td> <td> 9 August     </td> <td> 2nd Friday* of August    </td> <td> 2.28 days </td> </tr><tr> <td> Heritage Day          </td> <td> 24 September </td> <td> Last Friday of September </td> <td> 2.97 days </td> </tr><tr> <td> Day of Reconciliation </td> <td> 16 December  </td> <td> 3rd Monday of December   </td> <td> 2.28 days </td> </tr></table><br/>Of course, many people do attach some significance to a particular calender date, but I have discussed why this is completely unfounded in <a href=\"http://www.alphasheep.co.za/2012/02/on-birthday-shift.html\">a previous post</a>.<br/><br/>Although having Freedom Day on a Monday produces the same net deviation as a Friday, this introduces a possibility for a clash with Family Day in the distant future (as happened last year, and will happen in 2038). Likewise for holding Human Rights Day on a Friday (which would have caused a clash in 2008, and will cause a clash again in 2160). For all other public holidays, the day may easily be switched from Monday to Friday with no significant effect on the deviation from the current date. In the cases of Workers' Day, Heritage Day and the Day of Reconciliation, the day that came out on top only did so because my sample (of 101 years) happened to cover one or two more of one day than the other.<br/><br/></div>", "published": "2012-05-03T09:38:00+02:00", "updated": "2012-05-03T09:44:45.367000+02:00", "draft": false, "categories": ["mathematics"]}