{"id": "on-being-smart-and-and-having", "title": "On Being Smart and and Having Intelligence", "content": "The difference is really obvious once you see it, but a lot of people never do. I’m lucky enough to have a bit of both (trying not to sound arrogant). I think you have to be smart to spot the difference. Intelligence plays no part at all. <div class=\"readmore\"><br/><br/>As a final year student, certain “duties” get dumped on us. One such “duty” is the marking of a test written by the second years. Marking the test, I came across one student who had obviously studied quite hard, and had plenty of intelligence. Unfortunately, he was not very smart. In one part of the paper, he had made one small mistake which cascaded through and lost him most of the marks for that question. For the rest of the paper, he managed to get 90% of the marks.<br/><br/>In the question he got wrong, the paper had asked him to calculate the gravitational force exerted by the Earth on a 100 kilogram body - a rather simple question which he got correct. (The correct answer, for those who have forgotten their high school physic, is 981 N). The trick was that they had to do it from first principles, using Newton’s law of gravitation. The trick was that the Earth’s radius was given in kilometers. It’s amazing how many people accept that you can get a force of several hundred thousand tons on a 100 g body. That’s not smart.<br/><br/>But this particular student was not one of those. He made it to the second part of the question intact. The second part asked for the uncertainty in the answer of the first part, and was worth four times as many marks. This is a simple calculation, but unfortunately one that most don’t understand until they reach third year. The student in question applied the formula correctly, but made one small logic error which led to an answer of about seven billion newtons. He was intelligent, since he could obviously apply the formula, but not smart. If he was smart, he would have realised that this meant the he had no idea what the answer was, even though the number he calculated was no where near to what he should have known was the correct answer.<br/><br/>You can train a chimpanzee to do maths, but it doesn’t help. Numbers are meaningless. It is only the human thought, the human understanding that lies behind it all, that counts.<br/><br/>Look at me. I’m such a hypocrite. When I was in second year, I failed that test.<br/><br/></div>", "published": "2009-08-02T17:32:00.005000+02:00", "updated": "2013-01-21T15:23:23.294000+02:00", "draft": false, "categories": ["incompetence"]}