{"id": "on-behaviour-of-peacocks-and-people", "title": "On the Behaviour of Peacocks and People", "content": "One of my neighbours decided, for some unknown reason, that it would be a good idea to have some peacocks. Peacocks are strange creatures. In their natural (domestic) environment, they have only one natural predator - the cat. But the peacock is a big bird, with a sharp beak and a long neck, and a cat will think twice before taking it on.<div class=\"readmore\"> They have two threats, that I would not classify as predators. A dog will not really actively hunt a peacock, but if a dog were to encounter one, it may try chase it, either for the fun of the chase, or to chew on it. However, dogs generally don't climb walls like cats and cannot reach the peacocks. The second threat is the road.<br/><br/>When a peacock comes to a road and needs to cross, it just walks. It does not check to see if a car is coming (or even listen). It walks, and it takes its time about it. The interesting thing is if a car arrives, the peacock stops walking and stares. As I was leaving home one morning I encountered the peacocks. There used to be three, but they have apparently had chicks (if that's what you call baby peacocks) because there seem to be hundreds of them now. Three were waiting at the side of the road, and as I approached (at about 40 km/h, because they often do this) one decided to cross in front of me. I stopped, and so did it. It stood there staring. Eventually, it decided to continue again. As soon as it started walking, one of the others started to drift across. After both had finished crossing, I checked where the third one was. It was facing away from the road and showed absolutely no intention of crossing the road. As soon as I began to pull of, it turned and dashed in front of the car. I stopped and waited as it crossed.<br/><br/>The reason I explained the whole event in detail is because, about fifteen minutes later, exactly the same thing happened, only this time they weren't peacocks - they were people. And their behaviour and reaction to the car was identical to the peacocks. I've always considered peacocks to be very stupid, even as far as birds go, and even stupid people to be far smarter than the smartest of peacocks. Obviously, I was wrong...</div>", "published": "2009-03-11T16:11:00.007000+02:00", "updated": "2011-04-07T13:17:53.275000+02:00", "draft": false, "categories": ["incompetence", "tuna", "stereotypes", "domesticated animals"]}