{"id": "on-banks-absolute-stupidity-of-it-all", "title": "On Banks - The Absolute Stupidity of it All.", "content": "Because, the way they are currently run in South Africa, they just don't make sense. I have never understood just what it is that banks are trying to achieve. Well, the taking your money part is obvious, but why do they have to be so confusing and inconsistent about it.<div class=\"readmore\"><br/><br/>I have a student account. The nice thing about this account is that, provided I budget carefully and plan each transaction, I can get away with paying absolutely no bank charges. Unfortunately, I am rapidly approaching that magic age where they decide that I must be employed by now, so they shove on a rather heavy \"account management fee\". Naturally, being the stingy person I am, I immediately looked for cheaper options. <br/><br/>I am not afraid of research, and (as my regular readers will be aware) I am not afraid of doing <i>all</i> of the calculations in order to see exactly which account is the best. Because I've been carefully budgeting and managing my transactions for the last six years, I know exactly how many transactions I usually have, and I know exactly what my balance will do throughout the next year. Because of my investment account where I keep my savings, I am constrained to a particular bank, but this does not matter. I have looked at all of the major banks in South Africa, and all of them suffer from the same problems. <br/><br/>These problems are pretty easy to identify. They are<br/><ol><li>\"Packaged Solutions\" are a really dumb idea.</li><li>Inconsistent pricing models only make sense the <i>other</i> way round.</li><li>It really is cheaper to put your money under your mattress.</li><li>The things that screwed up the world's economy? They're still there.</li></ol>I will explain what I mean by each of these.<br/><br/><br/>    <span style=\"font-size: large;\"><b>1. \"Packaged Solutions\" are a really dumb idea.</b></span> <br/><br/>Doing the calculations I immediately identified three accounts that would be ideal for me, and two more that would be ideal if I were prepared to slightly alter my financial habits. Why was there not only one? In fact, the first three accounts were practically identical in everything but name.<br/><br/>Banks have far too many types of accounts, which would be far better off merged into a single account with options regarding details like overdraft facilities and the like. Banks try this, but you land up with ten accounts that can do the same thing for different prices. These so called \"packaged solutions\" are not a good idea. Banks really should take a leaf from the book of computer hardware and learn some modular design. It is far easier to have independent modules so that a consultant can piece together to perfectly suit the customer's needs.<br/><br/>With one account, with just one pricing structure, the next problem would automatically go away.<br/><br/><br/>    <span style=\"font-size: large;\"><b>2. Inconsistent pricing models only make sense the <i>other</i> way round.</b></span> <br/><br/>The ideal account for my needs would be a current account with a cheque card. A current account is pretty cheap, actually. In fact, there are accounts which can have absolutely no bank charges if you keep a minimum balance for the entire month. That sort of account is perfect for me, and so I automatically homed in on those accounts. The catch is that they all require a minimum monthly income from full time employment. Being a full time student, I naturally am not employed full time. While I do get plenty of money from a grant, and do part-time work at the university which comes to far, far more than the bank's required minimum income, the bank will only open the account if I am employed full time.<br/><br/>Instead, they insist that I open one of their so-called \"savings\" accounts. These accounts are incredibly expensive (at least when compared to the current account), but they do not require full time employment.<br/><br/>The pricing between the current accounts and various savings accounts are quite inconsistent, often for no apparent reason than that it was different people drawing up each account. While inconsistent pricing models are quite common, they usually work the other way round. Take cars, for example. The options on a more expensive cars cost more, naturally. Adding a sun roof or extra cup holders in an expensive car tends to cost more than adding them in a cheaper, less exclusive model of car. Tax is another example of where inconsistent charges work well. You get the rich to pay more, and give the poor a break.<br/><br/>Banks do it back to front, at least for the accounts in the low to mid income ranges. The current account targeting those who are fully employed are cheaper (free, if you're smart) than those savings accounts that are targeted at very low income earners and the unemployed. Charge the poor so that you can give the (slightly) richer a break.<br/><br/>This whole pricing issue brings me to the next problem.<br/><br/><br/>    <span style=\"font-size: large;\"><b>3. It really is cheaper to put your money under your mattress.</b></span> <br/><br/>This is true, despite what your bank will tell you. Of course, it is far, far safer to keep your money in the bank. Sure, your money can earn interest if you keep it in a savings account, but the charges are far more. Lets compare the current account I discussed earlier (where keeping a minimum balance will allow you to bank for free) with a typical savings account. The typical savings account will earn interest of a fraction of a percent. If you have that minimum balance in a current account (and provided that your monthly income approximately equals your monthly expenditure), your balance stays roughly constant. If you have the same balance on a savings account, then the interest you earn will be typically a tenth of your monthly bank charges. That's right. A tenth. And after just a couple of years, you will have lost a tenth of your money. In fact, if you account for inflation, your money will only be worth 80% of what you originally invested (compared to about 90% if you had just put the money under your mattress).<br/><br/>Speaking of inflation that's the next problem.<br/><br/><br/>    <span style=\"font-size: large;\"><b>4. The things that screwed up the world's economy? They're still there.</b></span> <br/><br/>No one would disagree that the primary reasons for the global economic crash of three or so years ago was caused by people spending money they don't have. These are hard times. The economy is struggling. Growth is struggling, inflation is up, and what is the country's solution? Well, in order to encourage economic recovery, they want to encourage spending. How do they do that? They make it cheaper to borrow money. What was it that caused the whole crash again? Oh yes.<br/><br/>It just doesn't make sense, when the average life expectancy is shooting up faster than ever before, to discourage saving. The interest rates keep dropping, and saving prospects keep going down. I know this isn't the bank's fault (it's entirely the fault of government), but it is still a problem that affects the banks.<br/><br/><br/><br/>I think I've made my point, and hopefully it's clear enough. It's just unfortunate that all of my ideas would be very expensive to implement. It would be nice if someone high up in one of the banks read this and decided to implement some major changes to the way bank accounts work, but I really don't see that happening.<br/><br/></div>", "published": "2012-02-13T09:31:00+02:00", "updated": "2012-02-13T09:43:05.634000+02:00", "draft": false, "categories": []}