{"id": "on-communicating-with-aliens", "title": "On Communicating with Aliens", "content": "Popular belief has it that whatever intelligent life from outside of our solar system that we encounter will be so far removed from us that we will be unable to communicate with them. It is often said that we will need to demonstrate our intelligence to them by showing knowledge of mathematics.<div class=\"readmore\"> Most specifically, by using universal constants such as the value of <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>π </span></i>. This bugs me a lot, firstly because mathematics is not a universal language (It’s principals may be universal, but to assume that the way in which they apply is universal is completely ignorant. If you disagree, go try to find the similarities between Mandarin and Icelandic), and secondly, because we assume that this intelligent life will also make use of 3.1415... as their magical constant to map circular geometries into linear ones.<br/><br/>Speaking of mathematics, I did <a href=\"http://alphanumericsheeppig.blogspot.com/2009/11/i-was-watching-mythbusters-on-discovery.html\">promise many months ago</a> that I’d have a warning when I went off about that sort of thing, but then I never made use of it. So, as promised:<br/><br/><div style=\"text-align: center;\"><span style=\"font-size: large;\"><span style='font-family: \"Courier New\", Courier, monospace;'><span style='color: red; font-family: Times, \"Times New Roman\", serif;'><strong>WARNING: HIGH MATHEMATICAL CONTENT.</strong></span> </span></span></div><div style=\"text-align: center;\"><span style=\"color: red;\">If you wish to remain socially functional, do not pay</span></div><div style=\"text-align: center;\"><span style=\"color: red;\">to much attention to the technical details.</span></div><br/>More importantly, the number <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>π </span></i>, the so called “universal constant” is starting to become extremely popular amongst the sort of people that like to think of themselves as part of the “geek” or “nerd” stereotypes. As a person who is often considered to fall into these stereotypes, I am ashamed that this number is held in such high esteem when I see π as an embarrassment.<br/><br/><i><span style='font-family: Georgia, \"Times New Roman\", serif;'>π </span></i> is essentially defined as the ratio of a circles diameter to its circumference, which is all very well. But what mathematical significance does the diameter of a circle have anyway? Well, the sad truth is, very little. I mean, a diameter makes perfect sense when you are talking about a circle, but when you get to more complicated, non-symmetric shapes, how would you define the diameter? A meaningful radius can be defined, even if it varies around the shape, but a meaningful diameter does not exist.<br/><br/>A far more meaningful constant to use would be 6.2831853... i.e. the ratio of the radius to the arc length of the circle. I’ll refer to this as <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>Π </span></i>. Then you’d be able to write a single equation which contains every single mathematical constant:<br/><br/><div align=\"center\"><img src=\"data/images/mmbRG0U0c9E.jpg\"/></div><br/>Which, in all honesty, makes -1 a far cooler number than <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>π </span></i>could ever be...<br/><br/>But I do admit... I have absolutely no dislike for pie.</div>", "published": "2010-04-18T17:12:00.005000+02:00", "updated": "2011-03-16T09:34:31.116000+02:00", "draft": false, "categories": ["incompetence", "mathematics", "stereotypes"]}