{"id": "on-calculators", "title": "On Calculators", "content": "And yes, I am talking about the little battery operated pocket calculator. The one I have used maybe twice in the two years since my final exams at University. In fact, I am not even sure if it still works.<div class=\"readmore\">  (Note: I just checked. It does work. It just needs a whack against the desk to get the display to turn on.)<br/><br/>The thing with calculators is that people tend to take them for granted. I have learnt the hard way that they are vastly overrated. During test and exams, both at school and university, students were required to take out the stationery that they would need, and leave their bags at the back of the venue. Since I've always had a tendency to take the more mathematical subjects, The majority of exams I have written have required a calculator.<br/><br/>The first time I remember forgetting to take my calculator out was during an accounting exam in high school. As soon as I realised that I had forgotten, I thought of raising my hand and asking if I could go fetch it, but something inside me saw it more as a personal challenge, and that raising my hand would be giving up. Instead, I wrote the exam without my calculator, doing all the adding in my head and doing the more complicated depreciation and interest calculations in the margins. Somehow, I managed an A for that exam, and I felt immensely more proud of myself than I would have if my calculator had done half the work.<br/><br/>A couple of years later, sitting done for my mid-year physics exam at university, I realised that I had not taken a calculator out of my bag. (The irony was that I had by that time started carrying a spare calculator to exams, just in case one stopped working.) Once again, I considered raising my hand, but something in me was excited about the challenge. This time however, the calculations were somewhat more challenging than mere addition and subtraction. Many of them involved trigonometric functions and square roots - the sorts of calculation I cannot easily work out on a piece of paper without considerable time. Needless to say, I failed the exam completely.<br/><br/>The moral of the story, I guess, is that I should not listen to the little voices in my head that get excited whenever something challenging comes up. The only problem is that I don't think I can.<br/><br/></div>", "published": "2011-08-29T08:54:00.001000+02:00", "updated": "2011-08-29T08:54:23.341000+02:00", "draft": false, "categories": ["technology"]}