{"id": "on-cheese-encrusted-bacon-and-loaf-of", "title": "On Cheese Encrusted Bacon and a Loaf of Shoe", "content": "Well, not really. But it could have been. It’s actually not really about anything, really. Really... <a href=\"http://alphanumericsheeppig.blogspot.com/2009/01/on-flying-monkeys-and-cheese-flavoured.html\">But you’ve heard that before</a>.<div class=\"readmore\"> But <i>Cheese Encrusted Bacon and a Loaf of Shoe</i> doesn’t really tell you anything. What use is a title that doesn’t tell you what to expect? It’s a title without spoilers, that’s what it is. Think about it. A title like <i>Alice in Wonderland</i> is a bad title because it contains spoilers. The title already gives away pretty much all of the story. It focuses on a girl called Alice, who lands up in Wonderland. Then as soon as the first young girl is introduced in the story, you start to wonder “Is this Alice?” until her name is revealed, instead of just enjoying the story. And then after Alice falls through the rabbit hole and has no clue where she is, all the suspense that could have been built up is wasted, all because the title tells you she is in Wonderland. It really does spoil the story. The purpose of a title is not to tell you what it’s all about – it’s to get you to read it, and if you thought this post had a bad title, well, you’re reading it aren’t you?<br/><br/>But that’s all completely irrelevant. What is relevant is the title – in this case, picked completely arbitrarily (although not really randomly) to be <i>On Cheese Encrusted Bacon and a Loaf of Shoe</i>. Although cheese encrusted bacon certainly does sound good (although I’ll probably pass on the loaf of shoe (only probably, because, after all, I’m the sort of person who uses nested parentheses (sometimes even double nested parentheses) in his text, and it just might be edible), since it sounds like it may be chewy (and did you notice how parentheses distract your train of thought?)), it tells you absolutely nothing about what you are about to read. What it does reveal, however, is the weird way my brain always falls back onto one of two subjects – namely food or animals. I have no idea why it seems to do this so often, but it just does.<br/><br/>In fact, I’ve gone back and tracked how often these two topics come up in my blog, and plotted a graph of how the fraction of the blog covering these two topics varies with time. At least it seems to be on a downward trend...<br/><br/><div style=\"text-align: center;\"><img src=\"data/images/mMHzoM8TScQ.jpg\" width=\"360\"/></div><br/>And then, even though it highlights the declining regularity of my posts, I was in a graph plotting mood, and wanted a second colour, so here are is a graph showing the total posts, and the animal and food related posts for each month.<br/><br/><div style=\"text-align: center;\"><img src=\"data/images/biN4acyXFPA.jpg\" width=\"360\"/></div></div>", "published": "2010-06-23T15:04:00.001000+02:00", "updated": "2011-04-07T13:15:03.411000+02:00", "draft": false, "categories": ["domesticated animals", "food"]}