{"id": "on-common-language-part-iii", "title": "On Common Language Part III: The Alphantoesicrifersii", "content": "Actually, that’s ‘alphanumericsheeppig’. As in the address to this blog. It’s not that difficult to get. I understand when a person accidentally calls it ‘alphanumericsheepdog’, and that’s OK. Even I occasionally throw a goat in.<div class=\"readmore\"> (Not literally, mind you. Goats, like <a href=\"http://alphanumericsheeppig.blogspot.com/2009/03/on-tossing-sheep.html\">sheep</a>, are rather difficult to throw. Rabbits are much easier to throw, but I don’t tend to throw them in that often.)<br/><br/>What I cannot understand is ‘alphantoesicrifersii’. It’s not even a word. Google currently returns zero results for it. It does not exist in the public space on the internet, and, as far as I’m concerned, that means it does not exist. I suspect that by tomorrow, Google will have found it, but that’s what Google is. Google is the collective mind of the human race, so if one man makes something up, then so does Google.<br/><br/>‘Alphantoesicrifersii’ is what my cellphone’s predictive text setting offers me when I type ‘alphanumericsheeppig’. I’ve always wondered what made the programmer put that in. Is it unique to my cellphone? And what does it mean? Does it even have a meaning? If not, then does that mean that I am allowed to give a meaning to it? Surely if my meaning gets generally accepted, then the word will be included in a dictionary, and I will have made a contribution to the English language. It’s unlikely, but it would be nice. All I need is for everyone I know to use the word regularly in casual conversation. <br/><br/>The new definition is:<br/>Alphantoesicrifersii: <span style='font-family: \"Helvetica Neue\", Arial, Helvetica, sans-serif; font-size: x-small;'>/‘æl.f æn.tuː.zɪk . /hɜː. rɪf. ər. siː/</span> (v.) (1) the inclusion of an absolutely pointless entry in a list, just for the sake of having fun, or (2) the inclusion of said word for no particular reason, or (3) being in the state of boredom that could lead one to want to include said word in said list.<br/><br/></div>", "published": "2009-09-27T13:38:00.004000+02:00", "updated": "2013-01-21T15:07:58.562000+02:00", "draft": false, "categories": ["Google", "language"]}