{"id": "on-construction-of-boeing-747-in", "title": "On the construction of a Boeing 747 in Minecraft - Part I", "content": "Over a year ago, I began playing Minecraft. One of the first things I started building was a scale model of a Boeing 747. <div class=\"readmore\"> One thing led to another, and after a couple of weeks of working on it, I moved on and dropped the project. </div> A couple of months ago, I started playing Minecraft on a multiplayer server, and from the start, I wanted to start the project over, doing it properly this time. And so I did. <div class=\"readmore\"> With slightly less time to spend on it than I'd like (I hate that I enjoy sleep too much to give it up), it is going to take me a while to finish, but I am determined to finish it this time. So, my next big Minecraft project is a scale model of a South African Airways <a href=\"http://en.wikipedia.org/wiki/Boeing_747-400\">Boeing 747-400</a> (as shown below) that is roughly twice the size of the real thing. <br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/jET-wzSRZAo.jpg\" imageanchor=\"1\" style=\"margin-left:1em; margin-right:1em\"><img border=\"0\" height=\"293\" src=\"data/images/jET-wzSRZAo.jpg\" width=\"400\"/></a></div><br/>Because of the discrete nature of distance measurement in Minecraft, I have taken some artistic license and added or removed a block or two in order to get it to match the look of the actual aircraft. For example, while the actual aircraft is 70.6 m long, I have made my model 143 blocks long in order to balance the distances between features more easily. Likewise, the fuselage is one block too narrow in order to keep the symmetry of the landing gear.<br/><br/>I tried something new here. I got myself a headset a while ago and decided to put it to use. I spent about two days working out how to record video with voice commentary in Linux (Fraps is the easy solution, but it only works in Windows). Eventually, I got it working, and so here is the first video I have recorded. I apologise in advance for the sloppy editing, recording, and encoding. Any suggestions are not only welcomed, but are probably necessary. <br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><div class=\"readmore\"><object class=\"BLOGGER-youtube-video\" classid=\"clsid:D27CDB6E-AE6D-11cf-96B8-444553540000\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\" data-thumbnail-src=\"http://i.ytimg.com/vi/2NuYI_ilzLE/0.jpg\" height=\"266\" width=\"320\"><param name=\"movie\" value=\"http://www.youtube.com/v/2NuYI_ilzLE?version=3&amp;f=user_uploads&amp;c=google-webdrive-0&amp;app=youtube_gdata\"/><param name=\"bgcolor\" value=\"#FFFFFF\"/><embed height=\"266\" src=\"http://www.youtube.com/v/2NuYI_ilzLE?version=3&amp;f=user_uploads&amp;c=google-webdrive-0&amp;app=youtube_gdata\" type=\"application/x-shockwave-flash\" width=\"320\"/></object></div></div><br/>(On a side note: In the opening and closing sections of the video, my voice sounds particularly nasal. This is because of the smell emanating from the ceiling from what was apparently the rotting corpse of a dead rat (We never did find the body). The middle portion of the video was re-recorded later due to technical difficulties, and my voice is unusually hoarse due to the air freshener sprayed to mask the stink of the rat. Anyway, the presence of rats in the roof is one of the clearest indicators that autumn is here.)<br/><br/></div>", "published": "2012-04-04T12:44:00.001000+02:00", "updated": "2012-04-04T12:44:36.729000+02:00", "draft": false, "categories": ["Minecraft"]}