{"id": "on-cheese-in-simple-english", "title": "On Cheese in Simple English", "content": "I didn't realise how many big words Wikipedia used until I discovered that there is a language called 'Simple English' on Wikipedia. <div class=\"readmore\"><br/><br/>Normal English Wikipedia says that \"<i>Cheese is a food consisting of proteins and fat from milk, usually the milk of cows, buffalo, goats, or sheep. It is produced by coagulation of the milk protein casein. Typically, the milk is acidified and addition of the rennet causes coagulation. The solids are then separated and pressed into final form.[1] Some cheeses also contain molds, either on the outer rind or throughout.<br/><br/>Hundreds of types of cheese are produced. Their different styles, textures and flavors depend on the origin of the milk (including the animal's diet), whether it has been pasteurized, butterfat content, the species of bacteria and mold, and the processing including the length of aging. Herbs, spices, or wood smoke may be used as flavoring agents. The yellow to red color of many cheeses is a result of adding annatto. Cheeses are eaten both on their own and cooked in various dishes; most cheeses melt when heated.<br/><br/>For a few cheeses, the milk is curdled by adding acids such as vinegar or lemon juice. Most cheeses are acidified to a lesser degree by bacteria, which turn milk sugars into lactic acid, then the addition of rennet completes the curdling. Vegetarian alternatives to rennet are available; most are produced by fermentation of the fungus Mucor miehei, but others have been extracted from various species of the Cynara thistle family.<br/><br/>Cheese has served as a hedge against famine[citation needed] and is a good travel food. It is valuable for its portability, long life, and high content of fat, protein, calcium, and phosphorus. Cheese is more compact and has a longer shelf life than the milk from which it is made. Cheesemakers near a dairy region may benefit from fresher, lower-priced milk, and lower shipping costs. The long storage life of cheese allows selling it when markets are more favorable.</i>\"<br/>- from <a href=\"http://en.wikipedia.org/wiki/Cheese\">Cheese - Wikipedia (English)</a><br/><br/>If that was a bit to complicated, the entire thing may be translated into simple english: \"<i>Cheese is a solid food made from milk. It can be soft or firm. It is made by removing water from milk. People may store cheese in a refrigerator, to make sure it does not go bad. Its color varies, most commonly pictured as yellow.<br/><br/>Cheese is rich in proteins and fats. It also contains vitamin A , calcium and phosphorus.</i>\"<br/>- from <a href=\"http://simple.wikipedia.org/wiki/Cheese\">Cheese - Wikipedia (Simple English)</a></div>", "published": "2009-05-20T15:06:00.006000+02:00", "updated": "2011-04-07T13:03:22.219000+02:00", "draft": false, "categories": ["language"]}