{"id": "on-depth-perception-problems-and-meal", "title": "On Depth Perception Problems and Meal Times", "content": "I’ve never really been able to judge how far away an object is. It’s just one of those things... I’ve never really been able to tell the difference between a small object close up and a big object far away.<div class=\"readmore\"> I never saw the fascination of those stereoscopic binoculars that were popular back in the early ‘90s (those ones with the two little cardboard wheels with frames of Spiderman or something printed on rectangles of transparent plastic arranged around the rim). And those 3D images where you squint and see a 3D image jump out of the page. Those never worked for me. And this new fascination with 3D films, I just don’t get. To me, it looks the same, and I just get a headache. It’s a minor disability, and I just couldn’t care less... usually...<br/><br/>The only thing that does bother me about it is that I cannot judge the size of a plate. This is not a problem for foods that are a pretty standard size, like sandwiches, but for other foods it becomes a major problem. If the plate is slightly smaller than usual, I land up dishing up less food than I’d like. That’s not so bad, provided I can go back for a second helping. The problem is when the plate is big (or square – I have great difficulty judging the size of a square plate, and I almost always get it wrong). With a big plate, I always land up with more food than I want. I don’t like this, because having a plate that isn’t completely empty being taken away from me is something that really bugs me... Even a couple of crumbs get on my nerves.<br/><br/>Just thought I’d say it... Don’t worry. Just try not to think of me having a normal driver’s license and driving on the same roads as everyone else...<br/><br/></div>", "published": "2010-06-22T08:26:00.001000+02:00", "updated": "2013-01-21T14:37:27.575000+02:00", "draft": false, "categories": ["food"]}