{"id": "on-division-by-zero", "title": "On Division by Zero", "content": "Following on from my post <a href=\"”http://alphanumericsheeppig.blogspot.com/2010/04/on-communicating-with-aliens.html”\">on <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>π </span></i> last week</a>, another thing that is becoming rather popular within the geek culture is this notion that you cannot divide by zero. This annoys me because I can, and it’s really not that difficult.<div class=\"readmore\"> Just because your calculator can't do it doesn't mean it's impossible.<br/><br/>You may be expecting a warning about here about high mathematical content, but you’re not going to get one. The reason I decided to leave it out is because I don’t regard this as high level maths at all. In fact, it’s pretty fundamental. The average child will have zero covered in maths at school at around the age of seven, and should learn the basics of division at the age of nine. Therefore, I expect the average nine year old to be able to divide by zero.<br/><br/>All you need to get your head around is the fact that there are different types of zero. For example, even though 2 times zero is still zero, it’s a different zero. In fact, it’s twice the first zero, even though it is given the same zero, but this only becomes relevant in a couple of special cases...<br/><br/>In general, a positive number divided by zero gives infinity. A negative number can be made positive by taking out the negative. Zero divided by zero depends on the origin of the zero, so if you take the first zero in the previous paragraph and divide it by the second zero, you’d get a half. Since it’s not usually as simple as that, you’d simply apply L’Hopital’s Rule, which does require some elementary differential calculus, but it’s really not that hard. <br/><br/>Hopefully the world's so-called “geeks” and “nerds” will read this and stop making such a big thing out of zero...</div>", "published": "2010-04-25T15:18:00.004000+02:00", "updated": "2011-05-03T15:02:47.721000+02:00", "draft": false, "categories": ["incompetence", "annoying things", "mathematics"]}