{"id": "on-dreams-part-ii", "title": "On Dreams: Part II", "content": "My memory, especially my short term memory, is pathetic. I read somewhere (I can't remember where) that forcing yourself to remember dreams is a good way to train your short term memory to dig things out of your subconscious. I have no idea whether it's true or not, but it sounded worth a try. <div class=\"readmore\"><br/><br/>I have never really been able to remember my dreams. If I even recalled having dreamed more than once every two months, it was a lot. To be honest though, I've never really made a concious effort to remember them. So, I have read up on how to train your brain to remember dreams, and it really is as simple as remembering to make the effort every morning before your brain starts writing over those parts of your memory.<br/><br/>The method for doing that seemed to be recommended the most was using a dream journal. I don't like the idea of having to write out by hand in the early hours of the morning (I'm too much of a perfectionist to deal with the sloppy handwriting and constant self-editing when my brain is basically half asleep), so I bought myself a small battery-powered LED reading light, and installed a simple note taking applet in my Kindle (which is always next to my bed anyway).<br/><br/>I've been recording my dreams the moment I wake up for one week now, and have recorded twelve dreams in total already (not counting the one that I was too lazy to write down at 3am on Sunday morning). I have remembered dreaming every time I have woken up in the last week, which is possibly more than I recalled from the rest of the last year combined.<br/><br/>(On a probably unrelated side note, I have gone from drinking coffee maybe once every two to three months to around three or four times a week, starting from just under two weeks ago. Probably unimportant, but changes in environmental conditions are always worth noting.)<br/><br/>I can say that I think I've identified the reason that I remember so few of my dreams. The reason is most likely that they are completely and utterly mundane. For example, I had a dream that I was sitting in the back seat of a car with my brother next to me, staring out the window as the car drove along the same route I drive every day to work. Or sitting impatiently waiting for an invoice for books that I had ordered. Or sitting quietly in a movie with my girlfriend while watching the credits scrolling up the screen forever, thinking nothing but that having such long credits before the movie starts just puts the audience to sleep. They are so utterly mundane that there is no wonder I have so rarely remembered them.<br/><br/>It was all very disappointing, considering what my subconscious mind throws at me while I'm awake.<br/><br/></div>", "published": "2012-06-26T10:10:00.001000+02:00", "updated": "2012-06-26T14:36:20.416000+02:00", "draft": false, "categories": ["more or less nothing"]}