{"id": "on-door-walkers-and-stupid-children", "title": "On Door-Walkers and Stupid Children", "content": "Working in a small shop, one notices how stupid some people can be. When I was a child, psychiatrists used to give you a box with different shapes cut in the lid. Along with that they would give you the wooden blocks that would fit into the holes. Each block only fits through one of the holes. The test was simple... if you could get each of the blocks in the box with just one try, you had developed intelligence.<div class=\"readmore\"> If any child needs more than one attempt, they are either blind, or stupid. In a one year old, stupidity is expected. In a three year old, it is slightly worrying. In a five year old, the psychiatrist will give the parents a list of \"special\" schools for \"special\" children. It is not good news for the parents when this happens. The child doesn't mind... He doesn't understand what it means.<br/><br/>Anyway, there is a box in the shop, which contains eight smaller boxes. A child, aged possibly between eight and ten (it may have been a slightly tall 7 year old) picked up one of the boxes, leaving a rectangular shaped gap. When he was finished looking at it, he put it back, but in the process he had turned it through an angle of ninety degrees. A child of reasonable intelligence would see the shape of the hole, see the shape of the box, and make the connection in their brains. This child, however, tried to force the box in sidewards. Upon seeing that it wouldn't fit, a slightly stupid child would then wonder why, and eventually work out that the box needs to be rotated through an angle of positive or negative ninety degrees. Unfortunately, this child was worse than just slightly stupid. He bent the cardboard so that the box would fit. He needs to eat more tuna. It helps the brain make those sorts of connections. I would have recommended this to his parents if they had been there.<br/><br/>A similar situation happens with another box next to it. This box contains twenty smaller boxes which are slightly off square. It is amazing how many people, even adults put them back in sideways. Special schools are definitely under utilised nowadays.<br/><br/>This leads on to the situation with the stairs. Upstairs contains just empty boxes. There is nothing to see there, so it is closed off from the customers by lining the stairs with stock and placing a large advertising poster at the top of the stairs, thereby completely blocking it off. Two girls, aged maybe three and five? enter the store. The younger one begins to climb the stairs, but the older one immediately shouts \"No! You can't go up. It's closed off.\" At some different point in time, a boy (aged maybe seventeen) walks in (Admittedly, he was slouched over, dressed completely in black, with his hair dyed black and hanging over his eyes. Wanting to look different, but ending up looking like every other emo on the planet...) and goes straight up the stairs and pushes aside the poster - just to see the empty boxes. Yes, the stupid eight year old might need just a school, but the parents of the seventeen year old need to start thinking of special homes. Keep him out of public and save him from all the embarasment his stupidity might cause him. If a five year old can work it out, then why can't he?<br/><br/>A related problem I find is the inability to grasp basic concepts. At closing time, just before I cash up, I close and lock the door (for security reasons), which I used to believe would imply that the store was closed. It is amazing how many people knock on the door and ask \"Are you closed?\" However, these people must be given some credit, since the possibility that the store might just be closed has actually crossed their minds. Even more amazing is the number of people who don't ask, and just walk into the door. Upon finding that it is not open, they take the handle and shake it. Few of them look inside to see me shaking my head. Such behaviour is extremely worrying. Did their parents force them to live such sheltered lives that this is their first encounter with a locked door? Or are they so stupid that they did not make any connection with previos encounters with locked doors. One wonders how they manage with other everyday tasks.<br/><br/>Tuna, people... Tuna. Try it... It really works.</div>", "published": "2009-01-17T18:55:00.004000+02:00", "updated": "2011-03-16T09:36:35.469000+02:00", "draft": false, "categories": ["incompetence", "tuna", "stereotypes"]}