{"id": "on-dealing-with-giant-turtle-biting", "title": "On Dealing with a Giant Turtle Biting Your Arm", "content": "Like any engineering problem, the first thing you need to consider is the relationships between everything involved. The first relationship is that between the turtle and the arm. These two are connected through the act of biting. The second relationship is that between yourself and the arm. This is in the form of ownership. A second relationship may or may not exist between you and the arm, depend on whether it is still attached to you or not.<div class=\"readmore\"><br/><br/>If your arm has become detached, there is no need to deal with the turtle. Your problem is solved, and the best course of action is to leave before the turtle gets bored and decides it needs something else to chew. It’s best not to scream either, or do anything to attract attention to yourself. Just leave quietly, and then seek medical attention from someone with the appropriate qualifications (i.e. not me), and start learning to tie your shoe laces with one hand.<br/><br/>If your arm is still attached, but you are in enough pain/shock/panic to consider allowing it to become detached, then you may remove your arm by your preferred means (or allow the turtle to do it for you). The problem is now reverts to the first case. <br/><br/>If your arm is still attached, and you would prefer it to stay that way, then the problem is somewhat less trivial. The solution mostly depends on how big the turtle is. I am talking about a giant turtle here, so if you are dealing with an ordinary turtle, my recommendation is to try Google (or Yahoo, or Bing, if you so prefer) for some other solution, because the solutions given here have not been tested with conventionally sized turtles, and cannot be guaranteed. (They actually haven’t been tested with any turtles, but that’s not the point.)<br/><br/>If the turtle is massive (i.e. with a significant gravitational pull when compared to, say, a typical planet), it’s your own fault. You should have seen it coming and moved your arm out of the way. Your arm is gone, and there’s not much you can do. It’s not too serious though, because it’s unlikely that the turtle can see you, so you should just get out of the way of its next bite. Dodge its head, and its own gravitational pull should send you into orbit. It’ll be a few hours at least before you come round to its head again. If you are smart, you will set your trajectory to land on its tail. Don’t attempt to land anywhere else, unless you have a parachute, or some other means to control your decent. (The turtle must have its own atmosphere in order to protect itself from cosmic radiation, so a parachute should more or less work.) <br/><br/>If the turtle is simply big (i.e. in the order of tens to hundreds of kilometers in diameter), there is no need to deal with the turtle. It will be killed by cosmic radiation in a matter of minutes. (Even if its on a planet, it will stick out too much to benefit from the atmosphere, and it’s just too small to hold an atmosphere of its own.) You just need to worry about the fall back to the ground. There is not much you can do if the turtle does not let go of your arm as it dies.<br/><br/>If the turtle is big enough that the width of its head exceeds the length of your arm, there is still not much you can do about your arm. Punching the turtle may not have much effect, depending on the size of the turtle. It is still worth a try. You may have to remove your arm as in the second case above, and then maintain the maximum possible distance between the turtle and yourself.<br/><br/>If the turtle weighs more than, say, 40 kg, it will be unwise to anger it. It is best not to try hitting it, since it is likely to bite harder. The best way to deal with it is to coax it off with something else. It’s more likely to be attracted by something strong smelling. The choice in substance is largely determined by what is readily available, but it may be a good idea to choose something that will wash off easily. The turtle may seem like a serious problem at the time, but a hand that smells of rotten fish for the rest off your life may be slightly less desirable in the long term.<br/><br/>If the turtle is light enough that you can lift it, the temptation is to smash its head against a rock (there, I’ve now used that word). It is important to fight this urge, and not do it. The turtle will let go just before the impact, and you will look like an idiot when you smash your arm against the rock. It may also hurt. The best course of action is the strong smelling substance as above.<br/><br/>And if the turtle has been trained in ninjutsu by a similarly giant sewer-dwelling rat, can you please get me an autograph while its there.</div>", "published": "2009-08-16T12:13:00.006000+02:00", "updated": "2011-04-07T12:57:47.450000+02:00", "draft": false, "categories": []}