{"id": "on-efficiency-of-nether-wart-harvest", "title": "On the Efficiency of Nether Wart Harvest Spacings in Minecraft", "content": "<div class=\"readmore\">[Editors Note: For those who do not play Minecraft, you should. You can play it in your browser <a href=\"http://www.minecraft.net/play.jsp\">here</a>, but I strongly recommend downloading the client from <a href=\"http://www.minecraft.net/download.jsp\">here</a>.] <br/><br/></div>Once again, my mathematical mind found itself thinking about the efficiency of Minecraft. Obviously, the warning for high mathematical content which I developed and then never bothered to actually use, could be applied here.<div class=\"readmore\"><br/><br/><br/>      <span style=\"font-size: large;\"><b>Abstract</b></span> <br/><br/>The expected yield per hour of a Nether Wart plant that is left for a given time period before being harvested and replanted can be calculated using statistics. The expected yield for several interval lengths is calculated and an optimum interval of between 25 and 50 minutes is found to be sufficient to allow the majority of the plants to grow, without leaving fully grown plants too long to waste update cycles.<br/><br/>      <span style=\"font-size: large;\"><b>1. Introduction</b></span> <br/><br/>The game of Minecraft is an open sandbox construction game created by Markus \"Notch\" Persson. The basic gamplay involves the player manipulating blocks in an effectively infinite 3D environment. The player controls an avatar that is capable of placing and removing blocks to create various structures, artworks or creations[1]. A significant part of the gameplay for the advanced player is farming for resources. <br/><br/>Nether Wart was added to the game in the 1.9 pre-release, and is a plant which only grows in the Nether on Soul Sand [2]. Due to the importance of Nether Wart in potion brewing, and since it can only be grown in the Nether, optimum farming methods become necessary. After being planted, Nether Warts need to undergo two stages of growth in order to be fully grown.<br/><br/>      <span style=\"font-size: large;\"><b>2. Methodology</b></span> <br/><br/>The aim of this investigation is to determine the time for which Nether Wart should be left in order to maximise the number of seeds obtained in a given time period. It is useful to define our target variable as the net yield per plant, <app-latex>{ Y }</app-latex>, measured in seeds per hour. Freshly planted and half grown plants will yield a single seed, while fully grown plants will yield two to five seeds [2]. The distribution of the number of seeds dropped by a fully grown plant appears to be uniform, for an average of 3.5 seeds per plant. Thus the yield per plant per hour is given by the formula<br/><br/><div style=\"text-align: center;\"><app-latex>{ Y = \\frac{(p_0 +p_1+3.5p_2 - 1)}{t}}</app-latex><br/></div>where <app-latex>{ p_k }</app-latex> represents the probability that the  plant has undergone <app-latex>{ k }</app-latex> growth cycles, and <app-latex>{ t }</app-latex> is the actual time in hours since the seed was first planted.<br/><br/>The algorithm the game applies when checking for growth is as follows [3]. The game runs through an update cycle (I avoid the word tick, due to confusion with redstone ticks) every twentieth of a second. Each cycle, the game checks twenty random blocks in each loaded chunk for updates. A chunk is a 16 x 16 square with the full 128 block height of the world, and consists of 32 768 blocks. Thus the probability of a certain block being checked for updates is 20 in 32 768, or 0.061%. If a Nether Wart that is not fully grown is chosen to be checked for updates, then the probability of it growing to the next stage is one in 15.<br/><br/>After <app-latex>{ n }</app-latex> update cycles, the probabilities of the plant being at each stage of growth is given by<br/><br/><div style=\"text-align: center;\"><app-latex>{ p_0 = \\left ( 1-x \\right )^n }</app-latex><br/><app-latex>{ p_1 = n \\left ( 1-x \\right )^{n-1} }</app-latex><br/><app-latex>{ p_2 = 1-\\left(p_0 + p_1 \\right ) }</app-latex></div>where <app-latex>{ x }</app-latex> is the probability of a plant growing in any given update cycle, which is given by<br/><br/><div style=\"text-align: center;\"><app-latex>{ x = \\frac{1}{32768 \\times 15} }</app-latex></div><br/><br/>After a certain time <app-latex>{ t }</app-latex> in hours, the number of update cycles that have been applied are <br/><br/><div style=\"text-align: center;\"><app-latex>{ n = t \\times 20 \\times 3600 }</app-latex></div><br/>From this, it is possible to calculate the expected yield per hour per plant for a farm that is harvested an replanted at regular specified intervals.<br/><br/>      <span style=\"font-size: large;\"><b>3. Results</b></span> <br/><br/>The yield per hour per plant was calculated for various time intervals. Exact agreement was found for the probabilities of various stages of growths with the work of Pernsteiner [3]. The probabilities of a plant being at each stage of growth and the resulting yield per hour per plant is shown in Table 1.<br/><br/><div style=\"text-align: center;\"><b>Table 1</b>: Yield per hour per plant at various times after planting.<br/><table border=\"1\" cellpadding=\"5\" width=\"100%\"><tr> <td style=\"text-align: center;\"> <b><i> Time </i></b> </td> <td style=\"text-align: center;\"> <b><i> Fresh Plant </i></b> </td> <td style=\"text-align: center;\"> <b><i> Half Grown </i></b> </td> <td style=\"text-align: center;\"> <b><i> Fully Grown </i></b> </td> <td style=\"text-align: center;\"> <b><i> Net Yield </i></b> </td></tr><tr> <td> 1 s   </td> <td> 99.92%  </td> <td>  0.08%   </td> <td>  0.00%  </td> <td> 0.00   </td> </tr><tr> <td> 30 s   </td> <td> 97.58%  </td> <td>  2.38%   </td> <td>  0.03%  </td> <td> 0.08   </td> </tr><tr> <td> 1 min  </td> <td> 95.23%  </td> <td>  4.65%   </td> <td>  0.12%  </td> <td> 0.17   </td> </tr><tr> <td> 5 min  </td> <td> 78.33%  </td> <td> 19.12%   </td> <td>  2.54%  </td> <td> 0.76   </td> </tr><tr> <td> 10 min  </td> <td> 61.37%  </td> <td> 29.97%   </td> <td>  8.67%  </td> <td> 1.30   </td> </tr><tr> <td> 20 min  </td> <td> 37.67%  </td> <td> 36.78%   </td> <td> 25.56%  </td> <td> 1.92   </td> </tr><tr> <td> 30 min  </td> <td> 23.11%  </td> <td> 33.86%   </td> <td> 43.03%  </td> <td> 2.15   </td> </tr><tr> <td> 35 min  </td> <td> 18.10%  </td> <td> 30.94%   </td> <td> 50.95%  </td> <td> 2.19   </td> </tr><tr> <td> 40 min  </td> <td> 14.18%  </td> <td> 27.70%   </td> <td> 58.12%  </td> <td> 2.18   </td> </tr><tr> <td> 50 min  </td> <td>  8.70%  </td> <td> 21.25%   </td> <td> 70.05%  </td> <td> 2.10   </td> </tr><tr> <td> 1 hour  </td> <td>  5.34%  </td> <td> 15.65%   </td> <td> 79.01%  </td> <td> 1.97   </td> </tr><tr> <td> 2 hours  </td> <td>  0.28%  </td> <td>  1.67%   </td> <td> 98.04%  </td> <td> 1.22   </td> </tr><tr> <td> 4 hours </td> <td>  0.00%  </td> <td>  0.01%   </td> <td> 99.99%  </td> <td> 0.62   </td> </tr></table></div><br/><br/>The results are plotted in Figure 1 below.<br/><br/><div style=\"text-align: center;\"><a href=\"data/images/bp-8SKMPzAc.png\" imageanchor=\"1\" style=\"margin-left:1em; margin-right:1em\"><img border=\"0\" height=\"332\" src=\"data/images/bp-8SKMPzAc.png\" width=\"400\"/></a><br/><b>Figure 1:</b> Plot of net yield per hour against time</div><br/>      <span style=\"font-size: large;\"><b>4. Discussion</b></span> <br/><br/>Figure 1 shows a maximum yield at 36 minutes and 43.6 seconds. However, the relatively flat gradient between 25 and 50 minutes would suggest that any time within this range would provide a reasonable yield. <br/><br/>The method with the highest yield would obviously be to monitor the farm constantly and manually harvest and replant those plants that are fully grown, but leave those that have not yet started to grow. However, the method of harvesting all plants at once lends itself to large or automated farms.<br/><br/>The above analysis does not account for the fact that a farm would take a finite amount of time to plant. Assuming a planting rate of about two plants per second, a 16 x 16 farm would take just over two minutes to plant. Because of this, the first plants two be planted would have had roughly two minutes longer to grow than the last plants to be planted. This should be accounted for when harvesting.<br/><br/>It is tempting to spread the farm over several chunks. This has absolutely no effect on the growth rate, as each block still has the same 0.061% chance of being selected for update, regardless of which chunk it is in.<br/><br/>      <span style=\"font-size: large;\"><b>5. Conclusions</b></span> <br/><br/>The expected outcome for the net yield of a Nether plant after a certain time period is easily calculated using statistics. A formula to calculate the probability of a Nether Wart having reached its first and second stages of growth respectively was developed and was then used to calculate the length of time that an Nether Wart farm should be allowed to grow to maximise the yield in a certain time period. The optimum time between harvests was found to be 36 minutes and 43.6 seconds, but any time period between 25 and 50 was found to be reasonable.<br/><br/>      <span style=\"font-size: large;\"><b>6. References</b></span> <br/><br/>[1]. <a href=\"http://www.minecraftwiki.net/wiki/Minecraft_Wiki\">Curse, Inc.; <i>Minecraft Wiki - The ultimate resource for all things Minecraft</i>; September 2011.</a><br/>[2]. <a href=\"http://www.minecraftwiki.net/wiki/Nether_Wart\">Curse, Inc.; <i>Nether Wart - Minecraft Wiki</i>; October 2011.</a><br/>[3]. <a href=\"http://pernsteiner.org/minecraft/cropgrowth.html\">Pernsteiner, S.; <i>Minecraft Crop Growth Algorithm</i>; October 2011.</a><br/><br/></div>", "published": "2011-10-27T16:29:00+02:00", "updated": "2013-03-01T11:13:39.311000+02:00", "draft": false, "categories": ["video game mechanics", "Minecraft", "mathematics"]}