{"id": "on-even-more-nonsensical-gibberish-than", "title": "On Even More Nonsensical Gibberish than Usual", "content": "Which is all it is these days, really, and I promise to bring you more of it. I’m not talking about this in particular – I’m talking about absolutely everything everyone says (not only celebrities, politicians and news readers, because they only started the trend).<div class=\"readmore\"> Actually, that’s an unfair statement, considering that none of it is really nonsensical (at least on some superficial surface level) and that very little of it is actually gibberish (except for some of the jargon some people tend to use because they think it makes them seem smarter, but it only results in vacant expressions and the occasional yawn). It’s just that it might as well be, with the things that go through people’s heads.<br/><br/>I’ve heard people refer to humans as an “advanced species” so many times, it’s now annoying. They cite our technological and scientific achievements as evidence for this: things like cloning, space travel, the internet, our global transport network and the like. The truth is that human’s are actually pretty pathetic. I’ve touched before on why I believe it was a <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/04/on-invention-and-discovery-of-bread.html”\">four year old boy who discovered bread</a>, and how it was a <a href=\"”http://alphanumericsheeppig.blogspot.com/2010/01/on-history-and-single-strength-of-human.html”\">retarded kid who discovered fire</a>. This is pretty much just more of the same ranting and whining on pretty much the same topic, but from a much more modern perspective, so you can probably just stop reading now if you didn’t like the last two whines on this topic.<br/><br/>Seriously though, can any of those major scientific advancements be attributed to the human race? Surely the credit is only due to a small group of individuals. For example, how many people do you know who can build a relatively simple device like a microwave, or something as fundamental to our age as an internal combustion engine. If I took a sample of, say, twenty “average” humans of good mental and physical health and working age, from a variety of backgrounds, put them in an isolated room with unlimited access to basic raw materials, and asked them to build a basic television set, or a rocket capable of deploying a satellite in orbit (which is far simpler than the television set, in my opinion), would they be able to do it?<br/><br/>And that is pretty much all I had to say, except for the even more nonsensical gibberish that I promised you. Because garbleshlarve in wiglabashaver isen dashrioclabber esquoobleo nas flabbergeelo ons kuelliamp ondaes shlay.<br/><br/></div>", "published": "2010-07-13T14:17:00.001000+02:00", "updated": "2013-01-21T14:37:19.259000+02:00", "draft": false, "categories": ["technology", "incompetence", "annoying things"]}