{"id": "on-efficiency-of-natural-night-time", "title": "On the Efficiency of Natural Night-time Heating", "content": "The other night, unable to sleep because I was too warm (despite winter beginning to set in properly), I began to solve the puzzle of my body's heating efficiency versus the insulation provided by my heavy down duvet. My body produces heat at a more or less constant rate, coupled with some spikes every now and then which vary with the frequency of flatulence (I can't help it when I'm sleeping, OK?). <div class=\"readmore\"><br/><br/>I am very very far from an insomniac. I can (and have) managed to fall asleep in some of the most absurd places. However, I am occasionally (i.e. about 6 to 8 times a year) kept up by complex problems (surprisingly, these are only rarely work related). On this particular night, I could not fall asleep because I was too hot with my thick down duvet on, but too cold if I replaced it with my blanket. The compromise was to use the duvet, but with strategic holes left open to optimise cooling. But I'll get back to that.<br/><br/>The primary issue here is the human base metabolic rate, which is the energy that the human body generates whilst in a rest state. For an average human, it is between 50 and 75 W. It doesn't seem like much if you consider that the heater in my office is 1500 W, but in that tiny space, wrapped up by my super effective duvet, it is a lot.<br/><br/>Now consider the insulation provided by my duvet - an approximately 30 year-old 5 cm thick duvet stuffed with the down feathers of some unidentified (probably semi-aquatic) bird. It probably has a thermal conductivity of  (and I'm taking a completely well-educated stab in the dark here) somewhere around 0.03 W/(m.°C). Although the area of the duvet is 1.7 m², I estimate that only 1.2 m² actually has a person underneath, and isn't just resting on the sheets. Assuming the air around my body has all reached somewhere around my body temperature (37°C), and is at steady state (although it is not, it is adequate for these simple head calculations), and that the air outside is a freezing cold 10°C (which I could have checked, if I'd thought of it at the time, since I keep two thermometers next to my bed, and then one in the study across the passageway (although I can't remember the last time I looked at any of them)), then the net rate of heat leaking through the duvet is just 20 W, meaning that somewhere from a half to a third of the body heat I generate is trapped in my duvet, and goes to making me uncomfortable.<br/><br/>Do the same calculation on the 8 mm  thick synthetic and cotton blanket, and you get a heat leakage rate of 120 W. The perfect solution would be a duvet or blanket that lay somewhere between the two, but since that was not available, I had to work out the optimum size and location of a cooling vent. Here, the calculations proved to be not as simple, as the effectiveness of the cooling vents requires knowledge of the air flow in the room. Even though this is technically supposed to be my area of expertise, I am completely unaware of the frequency and strength of my night-time flatulence, so this was impossible for me to calculate. Instead, after setting up vents of various sizes and various locations and leaving them open for 5 or so minutes at a time, with little success (they resulted mostly in one part of my body being too cold, while the rest remained too hot), I decided that it would not work.<br/><br/>In the end, I managed to squeeze in a pathetic 6 hours of sleep by pressing my knees (which seem to be rather resilient to temperature changes) against the wall, and using that as a heat sink to dump the extra thirty something watts of heat I was generating. </div>", "published": "2011-06-06T16:52:00+02:00", "updated": "2011-06-06T16:52:37.387000+02:00", "draft": false, "categories": ["engineering"]}