{"id": "on-enchantment-level-bookshelf", "title": "On the Enchantment Level - Bookshelf Dependency in Minecraft", "content": "<div class=\"readmore\">[Editors Note: For those who do not play Minecraft, you should. You can play it in your browser <a href=\"http://www.minecraft.net/play.jsp\">here</a>, but I strongly recommend downloading the client from <a href=\"http://www.minecraft.net/download.jsp\">here</a>.] <br/><br/>[Another Editors Note: This post is outdated. Updated versions are available for the enchanting systems introduced in <a href=\"http://www.alphasheep.co.za/2012/01/on-minecraft-bookshelf-dependency-part.html\">version 1.1</a> and <a href=\"http://www.alphasheep.co.za/2012/07/enchantment-level-vs-bookshelf-part-iii.html\">version 1.3</a>]<br/><br/></div>After watching <a href=\"http://www.youtube.com/watch?v=9BEnxMnJTxA\">episode 125</a> of <a href=\"http://www.youtube.com/user/EthosLab\">Etho's</a> Minecraft series, and listening to him complaining about how long higher level enchantments take to find, I decided to work out exactly what the distributions of the various enchantment levels are, and find the optimum number of bookshelves to use when looking for a specific enchantment level.<div class=\"readmore\"> <br/><br/>Because there is an increasing scale for the amount of experience required to obtain each level, a lot of experience is wasted if you spend your levels on more than one enchantment at a time. For example, if you start at level 0, and gain 10 levels and spend them on a level 10 enchantment, and then gain another 10 levels and spend them on another level 10 enchantment, you will have had to kill roughly 154 hostile mobs to obtain those two level 10 enchantments. But, if you gained 20 levels, and then spent all of them on two level 10 enchantments, you would have had to kill around 294 mobs for the same net result.<br/><br/>As a result of this, it is necessary to find an enchantment that will use up all (or almost all) of your levels in order to minimise the amount of experience wasted.<br/><br/>When enchanting an item, the player is offered three possible enchantments of random levels. The levels of the enchantments that are offered depend on two non-random and three random variables. The non-random variables are the slot in which the enchantment is offered and the number of bookshelves surrounding the enchantment table, and the random variables are integers uniformly distributed between zero and the number of bookshelves, zero and half the number of bookshelves (rounded up), and one and five. The three random variables are added together, and multiplied by a factor of 0.5, 0.66 or 1.0, depending on whether the enchantment is being offered in the top, middle or bottom slot.<br/><br/>This means that with 30 bookshelves around the enchantment table, the maximum level that can be offered in each slot is 25, 33 and 50 respectively. In other words, an enchantment of level 34 or above can only appear in the bottom slot. However, it is possible for a level 1 enchantment to be offered in any of the three slots.<br/><br/>Because of this, the distribution of the enchantment levels offered is skewed significantly toward the lower levels, with the first, second, third, and fourth groups of 10 levels appearing on average 8.0, 18.2, 9.3, and 3.4 times more often than the fifth group of 10 levels for 30 bookshelves.<br/><br/>The resulting probability distributions for the bottom slot are shown in Figure 1 below. For clarity, the numbers of bookshelves for which the graph is plotted match the combinations available using Etho's piston mechanism for the variable bookshelf enchanting room (built in episode <a href=\"http://www.youtube.com/watch?v=PcVABZIQCLA\">episode 112</a> of his series.<br/><br/><div style=\"text-align: center;\"><a href=\"data/images/2sGy3XJsOiU.png\" imageanchor=\"1\" style=\"margin-left:1em; margin-right:1em\"><img border=\"0\" src=\"data/images/2sGy3XJsOiU.png\"/></a><br/><b>Figure 1</b>: Distribution of enchantment levels appearing in the bottom slot</div><br/>The likelihood of being offered a level 50 enchantment is 0.04%, which means that the expected value for the number of attempts required to obtain this is 2 480. At two attempts per second, this means that it would take on average, over 20 minutes of clicking to get a level 50 enchantment. However, with some considerable luck (and faster clicking) this time could be much shorter.<br/><br/>Since the enchantment levels offered in the middle and top slots favour the same distribution, albeit squashed on the horizontal axis, it is apparent that lower level enchantments are much more likely to show up. For example, with 30 book shelves, a level 17 enchantment is the easiest to obtain. Obtaining an enchantment of exactly level 17 is likely to be quicker than obtaining an enchantment of any level from 38 to 50 (requiring on average 6.4 attempts, as opposed to 7.4 attempts).<br/><br/>This sort of behaviour will be familiar to all players who make use of higher enchantments. What is more useful is to use the distributions to calculate the optimum number of bookshelves to maximise the probability of being offered an enchantment of a specific level. This is quite easy to do, and the results are shown in Table 1. Oscillations in the distributions of the top and middle slots are caused by the rounding error after multiplying by the slot factor, and these play a small but important role in the calculation (for an example, level 14 is most easily obtained with 22 bookshelves, while level 15 requires just 21).<br/><br/><br/><div style=\"text-align: center;\"><b>Table 1</b>: Optimum number of bookshelves for specific enchantment levels.<br/><br/></div><div style=\"text-align: center; margin:0 auto; width:60%;\"><table border=\"1\" cellpadding=\"2\" width=\"100%\"><tr> <td style=\"text-align: center; width:60%;\"> <b><i> Level </i></b> </td> <td style=\"text-align: center; width:40%;\"> <b><i> Bookshelves</i></b> </td> </tr><tr><td>   2 and below </td><td>  0  </td></tr><tr><td>   3  </td><td>  1  </td></tr><tr><td>   4  </td><td>  3  </td></tr><tr><td>   5  </td><td>  5  </td></tr><tr><td>   6  </td><td>  7  </td></tr><tr><td>   7  </td><td>  9  </td></tr><tr><td>   8  </td><td>  11  </td></tr><tr><td>   9  </td><td>  12  </td></tr><tr><td>  10  </td><td>  14  </td></tr><tr><td>  11  </td><td>  15  </td></tr><tr><td>  12  </td><td>  18  </td></tr><tr><td>  13  </td><td>  19  </td></tr><tr><td>  14  </td><td>  22  </td></tr><tr><td>  15  </td><td>  21  </td></tr><tr><td>  16  </td><td>  26  </td></tr><tr><td>  17  </td><td>  25  </td></tr><tr><td>  18  </td><td>  27  </td></tr><tr><td>  19 and up </td><td>  30  </td></tr></table></div><br/>This phenomenon is not present when using Etho's variable bookshelf design. In this case, the optimum number of bookshelves to use is 2 for levels 4 and below, 9 for levels 5 to 8, 16 for levels 9 to 12, 23 for levels 13 to 17, and 30 for levels 18 and above.<br/><br/></div>", "published": "2011-12-20T15:07:00+02:00", "updated": "2013-03-01T11:13:39.314000+02:00", "draft": false, "categories": ["video game mechanics", "Minecraft", "mathematics"]}