{"id": "on-end-of-world", "title": "On the End of the World...", "content": "... which, as I’m sure you’ve heard by now, will be happening on the 25th of August 2011, and not the end of 2012 as so many people are starting to believe. It is going to be a fascinating, but humbling experience to see the gigantic continent destroying robots that the penguins have been secretly assembling from the scrap that has washed up on the shores of Antarctica over the last few millennia.<div class=\"readmore\"> It’s our own fault really. We should have been more careful. We should not have let them get hold of so much raw material. We trusted the penguins too much. In fact, we trusted every creature on the planet too much, but only the penguins have the backing and the determination to carry out a plan of such a monstrous scale. <br/><br/>Being one of two animals that is native to Antarctica (the other being seals, who simply sleep all the time), they had plenty of opportunities to construct their massive secret underground lairs. The terrain is constantly changing as blizzards and shifting snow reshape mountains and snow dunes, as glaciers carve out valleys, and as ice caves collapse in. It requires almost no effort from the penguins to keep the entrances to their factories hidden. The penguins have planned it so well, and have managed to keep it all hidden for a very long time.<br/><br/>In fact, the only clue to their plans is film footage of penguins during a blizzard. There is quite a lot of footage of penguins in blizzards, and that in itself is what made me suspicious in the first place. Consider yourself walking through a town as a blizzard is starting to pick up. Your first instinct is to seek some form of shelter. This instinct is not just limited to humans – no animal enjoys being exposed to gale force wind and biting cold, solid, sharp snow. Imagine you ignored this instinct, and carried on through the blizzard. If, during the worst part of the storm, you were to encounter large group of men, wearing black suits, with their arms by their sides, standing dead still, trying desperately to appear as if they have no where better to be, then you’d quickly conclude that the only reason they could be out in that sort of weather would involve organized crime, and you would go out of your way to avoid them. <br/><br/>Consider now almost all the footage of penguins captured during raging blizzards. The behavior of the penguins is identical to that of an organized crime unit trying to appear unsuspicious. I have no doubt that as soon as a camera is detected within a certain radius, all the penguins immediately drop whatever tools they have, cover it with a bit of snow, and then stand around nonchalantly as if they enjoy that sort of weather. I am sure that the penguins make full use of blizzards to cover their covert operations.<br/><br/>Why else would they have chosen to live on a practically uninhabited continent that is plagued by horrible weather and ridiculously long nights for half the year.</div>", "published": "2010-02-14T13:50:00.001000+02:00", "updated": "2011-04-07T13:10:52.783000+02:00", "draft": false, "categories": ["those damn penguins", "weather"]}