{"id": "on-eating-in-order", "title": "On Eating in Order", "content": "I had a special request to explain my eating habits. It’s a complicated process developed over the last twenty years of my life, and I have no idea how it started. It’s probably OCD, but I can’t guarantee that. It might be related to whatever it is that makes me arrange my books in descending height order on my shelves, and use a ruler to make sure they line up with the spines the same distance from the front of the shelf. It might also have to do with the fact that I keep a spirit level in my room to make sure the pictures are straight on the wall.<div class=\"readmore\"> It’s not that I’m a neat freak – a single glance at anything I own will instantly disprove that – but it’s just some inexplicable urge inside that makes me want to do things a certain way.<br/><br/>These are not rules, you must understand. I am not bound by them. When it comes to eating, I actually break them all the time. I really just eat things in the order I prefer. It's actually a coincidence that the order is so technical. In fact, it’s actually a simple case of “save the best for last”, combined with the fact that I don’t like mixed flavours. <br/><br/>When I eat, I always start with the vegetables. If there are a variety of vegetables on the plate, it really depends on which vegetables I prefer. It’s purely coincidence that I normally eat vegetables in descending order of the wavelength of their reflected light. The order is slightly mixed up. I start on green, and then work my way down the wavelengths to purple. I then take a jump up in wavelength, and then work my way down through red and orange and finally finish off on yellow. I then work in ascending order of luminosity. Darker vegetables are eaten first, while lighter vegetables are eaten afterward. Inevitably, this leads me to eating the starch last. One exception to the above rule is if the vegetable are those that are contained within something else, such as a sauce, or vegetables on a roll, or in a pie. The loose vegetables are dealt with first, and then I move on to the rest. Another exception is made with vegetables that are essentially the same as another vegetable of a different colour. In these cases, both types are grouped into one of the vegetables. For example, red and yellow peppers are classified as dark green, because they are basically the same as green peppers. Likewise, broccoli is classified as almost white, since it’s not really that different to cauliflower (and I just happen to really like broccoli). <br/><br/>Once the vegetables are out of the way, I get to the real food. The principle here is simple. Vegetables go in the same order as described above, then meat, and cheese always comes last. For example, a typical burger will be eaten in the following order: lettuce; tomato; onion; bun; patty (although this may be shortened by eating the bun with one or more of the garnish ingredients in, to save time. The patty is only included in the case of takeaways, in which case taking a burger apart is awkward).<br/><br/>There are a few exceptions: pasta comes after meat, but before cheese; pickles come after meat but before pasta; and guacamole or avocado comes before meat and after starch.<br/><br/>As I eat each stage, I make sure that no food is wasted. I get as many crumbs off the plate as possible without putting in much effort.<br/><br/>If you think I’m crazy, I agree. I’ll accept any donations towards psychiatrist fees.<br/><br/></div>", "published": "2009-09-27T17:27:00.003000+02:00", "updated": "2013-01-21T14:59:24.973000+02:00", "draft": false, "categories": ["restaurants", "food"]}