{"id": "on-electrocution", "title": "On Electrocution", "content": "I have been electrocuted a number of times. I blame the cartoons and TV shows I grew up with (not Dexter’s Lab, believe it or not, although I would be blaming it if I had watched it at that stage of my life). So many shows implied that a reasonably smart kid (or person, for that matter...) could, with very few resources available, build almost any gadget or device (Damn you MacGyver!).<div class=\"readmore\"> Being what I considered a reasonably smart kid, and having plenty of resources available (My grandfather was a third generation scientist, and I guess he wanted my father to follow in his footsteps. As a result, my father collected dozens of scientific toys, electric kits, radio kits and chemistry sets. He didn’t make much use of them, so I got them in almost new condition (albeit most of them around 30 years old.)), I liked to make little simple devices, such as connecting a visual alarm to my door so that I would know when someone started to open it (It did not actually occur to me that if the someone started opening the door, I would see the door begin to open.), and an electric xylophone, a transistor radio, and a crystal radio... you know, all the simple stuff that all kids make. <br/><br/>It didn’t take me long to work out that those kids (of which Dexter would have been a perfect example, had I known about him at the time) were not in fact incredibly smart, but rather incredibly spoilt. My measly little pocket money budget couldn’t even afford a single steel panel, never mind the materials I needed to build a killer robot like I wanted to.<br/><br/>Hell, I couldn’t even afford batteries, at the rate I got through them. Fortunately, my parents had enough faith in my intelligence (or perhaps just wanted me to stop nagging) to let me use a (cheap) variable transformer attached to the mains supply to power my inventions. This may not have been the best idea, especially since they were well aware of my poor hand eye coordination and my absent minded personality which had (and still has) the attention span of a mosquito on ecstasy. Thanks to this, I was no stranger to electrocution (although fortunately, none of them resulted in any damage apart from a couple of minor burns).<br/><br/>However, the three worst cases of electrocution I have experienced had nothing to do with those days spent trying to get some pointless circuit to work under my bed in my dark bedroom. The worst (probably because it involved my face) happened only a couple of years ago. Late one night, I woke up thirsty and needed a drink of water. There was a vicious thunderstorm raging outside (but that’s not what woke me – I can sleep through anything). Being too lazy to pick up a glass (and that would need the light to be turned on too!) I just drank from the tap, when lightning struck the water pipes. Fortunately, I pulled my face out, but not without getting numb lips for several minutes, and a very stiff, bruised feeling arm. The second worst involved adjusting the speed and timing of our electric gate. I unscrewed the case over the motor, and then, because there was no plug – the power was fed directly into the circuit board – I began to unscrew the power cables (because I strongly believe in safety first). If you have ever shoved a metal object into one of the bottom two holes of a three point plug socket, then you know what that feels like. <br/><br/>The third case (which happened to be the first, chronologically) was when I was about 9 or 10 years old. I had an NES (Nintendo Entertainment System, for those of you who grew up in the dark ages) which I used to play after waking up on weekend mornings before my parents. The console itself was extremely durable (in fact, it still works perfectly), however, the controllers and especially the power adapter were not. (I am certain that this is because the power adapter (a heavy block with three spikes on the end of a long cord) resembled a medieval flail – a fact that was regularly taken advantage of by both me and my younger brother.) The adapter’s plastic casing had a bit of a crack on the one side (and by a bit of a crack, I mean large gaping hole). I was well aware of the dangers of having exposed copper wire touching my skin as I plugged it in, and I suppose I could have just held the adapter differently, but I distinctly remember thinking “Hey, I’ll be quick. The plug won’t have time to zap me.”<br/><br/>On the bright side, despite regular attempts, I never did manage to break the lock on that substation down the road.<br/><br/></div>", "published": "2010-12-09T16:55:00.001000+02:00", "updated": "2013-01-21T14:22:57.268000+02:00", "draft": false, "categories": ["technology", "incompetence"]}