{"id": "on-everything-it-is-just-so-damn", "title": "On Everything. It is Just So Damn Amazing.", "content": "It's hard not to live life in complete and utter amazement. The shear fact that I am alive in such an incredibly improbable world is unbelievably overwhelming. This is the sort of thing that can only be explained with incredibly long sentences, so I suggest that you brace yourself.<div class=\"readmore\"> Even more improbable is the fact that I happen to be a human, capable not only of thinking these thoughts, glimpsing the tiny clues as to where our universe came from, but sharing them with others who are equally (and in many cases much more) capable of appreciating and expanding them. I could easily have been born a bacteria, running off nothing more than simple chemical impulses, with no concious awareness of my surroundings, no room to make decisions and manipulate my environment to suit me.<br/><br/>Of course, my concious awareness and ability to manipulate my environment may just be due to chemical impulses as well, but is independent chemical impulses separately directing trillions of cells to interact for mutual benefit, driving such a vastly complex mechanism that the illusions of awareness, conciousness and free will inexplicably emerge from the chaotic interaction at a lower level. And when it comes right down to it, all those chemical interactions are just unimaginably small particles floating through emptiness, pushing each other around according to a simple set of quantitative rules.<br/><br/>And we can look at the universe, and realise that things can be counted, and that everything we see follows simple quantitative rules. If you have two apples, and find another apple, then you have three apples. It is unfathomably simple, and never fails. And everything we see can be counted like this. And when we break it down into smaller parts, there are different rules, but they can still be quantified with the same mathematics. We need more advanced tools to deal with the scale of the mathematics, but on a fundamental level, they are all just extensions of the same counting techniques we use to keep track of how many pieces of fruit we have. We can keep going, on and on, and as we get deeper and deeper, our set of rules keeps on going, and all of it can be quantified by logical extensions of this simple system that we came up with to make sure our neighbour wasn't stealing our cattle. And its not like these applying these rules gives just an estimate of our universe. We demand that they work <i>every single time</i>. If they do, we mark them as just maybe. And if they don't, even if it's just once, we mark them as definitely wrong, but even so, we have rules that can quantify exactly how wrong they are, and those same rules can tell us how much confidence we can have in our \"maybes\" as well.<br/><br/>And in the end, we're left with this massively complex set of simple, elegant, quantifiable rules. But there are so many rules that no one really knows them all, and no one is even capable of understanding a fraction of them, never mind applying them. But in just a few hundred years, the millions of human minds who have considered them have collectively put together a sufficiently powerful rule set that we can now <i>consider</i> the possibility that our entire universe is just a momentary interaction caused by a chance collision of two multi-dimensional curtains flapping in an an extra-universal emptiness. Not only consider, but actually have at least a superficial understanding of the quantifiable rules that are theoretically capable of explaining and predicting absolutely everything that will possibly happen in our universe, in a quantifiable manner. <br/><br/>Of course, while the rules themselves are so ridiculously simple, the shear number of ways in which they can interact makes them so incredibly complex. The overwhelming majority of them are just special cases of interactions between even simpler rules, which themselves arise out of an even simpler set. And at the bottom, there is a tiny set of ridiculously simple, self-containing rules, whose interactions are so complex that the only way of solving them is to watch an entire meta-universe play out.<br/><br/>And then within that meta-universe, out of who-knows-how-many possible universes, there is this one. And in it, out of who-knows-how-many galactic clusters, we have this one, and in it, this galaxy. And out of the hundreds of billions of stars, we have our sun, and it's eight little major planets, as many as a couple hundred dwarf planets, and several hundred thousand minor planets orbiting around it. And out of all those, our planet happens to exist. And over the last four and a half billion years, has warped and cooled, to a relatively stable, water-covered ball. And the water has been kept at one of an endless number of combinations of temperatures and pressures that allow it to stay liquid, but repeatedly heated and cooled just enough to cause the convection currents required to mix chemicals formed in long dead stars in just the right ways that they could bond together and make crude but functional copies of themselves using the fragments of similar chemicals floating around them. Our simple set of rules allow this, but it is so endlessly unlikely that it possibly took half a billion years of the right conditions for it to happen. We don't know how - we weren't there to see, and know one has yet had the half a billion years spare time it would take to run an experiment to see it.<br/><br/>But these crude chemical copy machines gradually began ripping each other up to make more rough copies of themselves, and those that were ineffective at copying were ripped up, unless some series of fortunate mistakes happened to make it beneficial for those chemicals to be copied by those that could copy. Think about how the world would work under just these simple rules. A protective membrane, for example, would make it much harder for a copier to be ripped up, and so mistakes that caused it to copy the membrane along with itself would be a huge advantage. Simple rules, simple copying, with a couple mistakes along the way. But those mistakes lead to the vast complexity from the simple rules. A mistake that prevents a copier from copying will never spread, whereas a mistake that makes a copier more effective at copying will spread rapidly. For example, a mistake that forces a copier to avoid the copiers with membranes and go after the easy free chemicals (which we can arbitrarily call food) will make copying that much easier, and so these copiers will multiply far quicker than the others. But this means that having a membrane will be a huge advantage, saving those with membranes from being eaten, regardless of their own dietary preference. Soon, most copiers will have membranes, which are easier to break in groups, and so mistakes in the copying that lead to the copiers working with those of the same kind will give an advantage. This leads to multicellular organisms, and by the same simple copying rules, with the same sorts of advantageous and disadvantageous mistakes by these little copying machines, you get the trillions of cells that make up my own body, firing off the electrical, chemical and physical impulses that drive my body, and allow me to have thoughts like this. That's evolution. It's completely logical, undeniable on a fundamental level, and absolutely, incredibly amazing.<br/><br/>Sure, it's random chance, but its a selective chance. It seems improbable for all the random coincidences to line up, but its far more likely than you'd think. I once heard an explanation using an analogy of rolling 20 dice and trying to get 20 sixes at once. If you roll all 20 dice once every second, you'd need to keep rolling them each second for an average of a hundred and fifteen million years before getting 20 sixes by pure random chance. It could quite possibly even take far longer than that. But we're not talking pure random chance with evolution. We're talking about selective chance. Imagine you're rolling 20 dice, but with each roll, you're allowed to keep the best roll that that dice has given you. So you roll the 20 dice, and you'd expect around three or so to land on six. So you keep those sixes, and roll the others. There's a 99.9% chance that you'll have the 20 sixes in under sixty throws, and the chances of not having 20 sixes after 100 throws are about one in two million. Throwing some form of selection into the mix makes a phenomenal difference to those random mistakes - the difference between a hundred million years and a couple of minutes...<br/><br/>Did you see what I just did. I pulled out a tiny set of my limited quantifiable rules, and applied them to a simple scenario, and not only predicted the future, but also quantified how likely my predictions are to be correct. I can test these with experiments, and predict in advance how often I'll be right. The very fact that I can do this blows my mind.<br/><br/>But, as amazing as that is, and as astounding as the collective understanding of the universe that science has pulled together over the last few hundred years is, there are still some people - far too many people - who think that a single book can explain it all, and that what the book doesn't say is beyond our understanding.<br/><br/>Screw it. I want to understand. Reality is far too incredible to sit back and be satisfied and just accept things we don't know. All we have is clues, some subtle, some not, that lead us deeper and deeper into a labyrinth of rules. We don't know if we're on a dead end or not. We're feeling around in the dark, not knowing where we are, where we've been, or where we're going. All we know is that we're here, and dammit, I want to know what's at the end.<br/><br/>What I'm trying to say is fuck religion. No one knows the truth. We all need to stop being so gullible, believing in a made-up fairy tales and obvious bullshit. Reality is far too exciting to just ignore.<br/><br/></div>", "published": "2012-07-10T09:35:00.001000+02:00", "updated": "2012-07-10T09:35:53.776000+02:00", "draft": false, "categories": ["philosophy", "mathematics", "religion"]}