{"id": "on-few-words-of-wisdom", "title": "On a Few Words of Wisdom", "content": "For several months now, I have been getting obscure comments on my posts. Those who leave comments (and maybe one or two of you who don’t) may have noticed the introduction of a word verification step (which I must admit, I hate), and then later on, manual comment moderation.<div class=\"readmore\"> No comment appears until I have read it personally. For those wondering why this is necessary, I have been getting comments consisting of some line in Chinese (which sounds as if they are taken directly from fortune cookies), such as “所有的資產， 在不被諒解時， 都成了負債.” Although they are occasionally surprisingly relevant to the post, and almost always give interesting words of wisdom when translated, I never publish them because they are followed by a string of full stops, each one linking to a site with strategically placed words like “chat”, “girl” and “live sex” in the URLs. If only they would leave off the links, I’d publish their comments.<br/><br/>I’m sure this is some sort of plot by the Chinese government to control your minds though, so consider my comment moderation as me protecting you from becoming brainwashed zombies... But, thinking about it, maybe you’re already zombies, so here is a sample of some of the wisdom I have gained. It can’t do too much damage.<br/><ul><li>All of the assets, not being understanding, have become liabilities.</li><li>Survival but continued fighting in the heart and soul; writing is sitting the trial itself.</li><li>It is easier to get than to keep it.</li><li>Do not look for lessons from the failure of people, success is far away.</li><li>Happiness is not the key, only the ladder.</li><li>Tired? A cup of coffee, a rest!</li><li>Only endless teacher learning, teaching can be serious, only burn themselves to other people's lights lit.</li><li>Maturity is the ability to adapt to life in the vague.</li><li>Quality is better than quantity.</li><li>As a man sows, so he shall reap.</li><li>Hammer and nails to the same as always work toward fixed.</li><li>Enrichment within the letter of the most important! Beauty is but skin-deep.</li></ul><br/></div>", "published": "2010-08-10T17:28:00.001000+02:00", "updated": "2013-01-21T14:35:36.764000+02:00", "draft": false, "categories": []}