{"id": "on-fifth-arbitrarily-defined-solar-cycle", "title": "On... a fifth arbitrarily defined solar cycle? ", "content": "It's hard to believe that the Earth has completed almost five trips around the sun (at least, it will have by 19:44 this evening) since I started this blog, one boring Saturday afternoon in 2009. <div class=\"readmore\"> Although I have been considerably less active over the past year, I still managed to find time for 18 posts. I had just under five thousand visits this year (although Blogger is reporting forty thousand for some reason), mostly from the US, South Africa, Canada and the UK. It's difficult to tell what Google searches bought people here, because Google no gives out that information for users who are signed in. It's mildly disappointing, but I'm actually glad that the world is taking privacy a little more seriously these days.<br/><br/>The most popular posts for the year were, well, from previous years actually. My post about <a href=\"http://www.alphasheep.co.za/2013/03/petrol-price.html\">petrol price hikes</a> made it into sixth place, after four <a href=\"http://www.alphasheep.co.za/search/label/Minecraft\">posts about Minecraft</a>, and the post from 2011 about our <a href=\"http://www.alphasheep.co.za/2011/12/on-imminent-loss-of-ultimate-kitchen.html\">Tullen Shears</a> (which, incidentally, are still going). Other popular posts for the year include <a href=\"http://www.alphasheep.co.za/2013/03/amusing-hat-day.html\">Amusing Hat Day</a> (which was a bit of a flop - even I forgot my hat), and the posts about <a href=\"http://www.alphasheep.co.za/2013/02/favourite-classical-music.html\">classical music</a> (lots of links to a couple hours worth of music, so go listen if you haven't already), the <a href=\"http://www.alphasheep.co.za/2013/05/why-the-stars-are-not-long-dead.html\">age of star light</a>, and the <a href=\"http://www.alphasheep.co.za/2013/01/theory-of-relativity.html\">theory of relativity</a>. I was disappointed that my <a href=\"http://www.alphasheep.co.za/2013/08/pagerip.html\">first video game</a> was not quite as successful (go download it and try it if you haven't. It's actually more fun than it sounds).<br/><br/>Outside of blogging, 2013 was a very eventful year. On the academic side, I actually made some serious progress toward my PhD (despite both a hard drive and a laptop deciding to retire, removing 700GB of simulations between them), and may actually finish it soon, and I was flown to the other side of the world (the USA) to present a paper at my third academic conference. I bought my first car (instead of just driving a car which technically belonged to my parents), and took out my first insurance policy. I think, somewhere during 2013, I turned into an adult. I'm still not exactly sure what that means, and I don't feel any different, but I'm sure I'll figure it out.<br/><br/>Anyway, hopefully I'll still be able to find some time to post for some years to come.<br/><br/></div>", "published": "2014-01-17T09:52:00.002000+02:00", "updated": "2014-01-17T09:52:39.604000+02:00", "draft": false, "categories": ["land marks"]}