{"id": "on-flying-monkeys-and-cheese-flavoured", "title": "On Flying Monkeys and Cheese Flavoured Goats", "content": "Well, not really. But it could have been. Its actually not really about anything, really. There's no such thing as cheese flavoured goats. Unless you cut a piece of cheese into a goat shape. Or a goat shaped cheese flavoured cracker. Either way, it's not a cheese flavoured goat, because it's not technically a goat - it's just a goat-shaped object. If you wanted a cheese flavoured goat, you'd have to kidnap a baby goat and inject it with cheese flavoured chemicals (like the ones on Nik Naks) for it's entire life.<div class=\"readmore\"> (Are those chemicals poisonous to goats? Maybe you need to run some tests first.) Even then, I can't guarantee that the goats would be cheese flavoured. I have no idea how often the chemical would need to be administered, or what dosage to use. Several tests and experiments would need to be performed first. You may need to enlist the help of an expert. I have no experience in this field. Why would you want a cheese flavoured goat anyway? (On a side note: Goat's milk does make nice cheese.)<br/><br/>This isn't about flying monkeys either. I don't know what made you think it was. Monkeys don't fly, unless they've been genetically mutated. I suppose you could train chimpanzees to fly aeroplanes (chimpanzees are more intelligent than humans), but I'd like to point out that chimpanzees are technically not monkeys (due to the absence of a tail). You could also just put a monkey on an aeroplane (which has happened many times in the past), but is this really a flying monkey, or is it just a monkey being flown? You have to understand that there is a major difference.<br/><br/>I was going to buy six thousand monkeys, and train them to throw pumpkins with their feet. Where could I get them? Where do circuses and mad scientists buy their monkeys from? Could I get them for free? I wouldn't be able to afford them. I'm always looking for a free way to find what I want. I hate having to pay for anything. Even if I got hold of these monkeys, would they be able to hold pumpkins in their feet. Monkey feet are quite small, and pumpkins are big and heavy. This makes them pretty effective weapons. I thought of using carrots instead, but carrots don't really have much weight behind them. Pumpkins are a far more powerful. In order to make full use of them, I'm going to have to breed special monkeys, with bigger feet and stronger legs. And maybe breed smaller pumpkins, but I really think this takes away from the whole point in using pumpkins in the first place.<br/><br/>Why would anyone want six thousand monkeys? My plan is to dress them in silk pajamas and woolen hats, and send them to Indonesia to start a religious war. What do I have against Indonesia? Nothing, actually. I'm just hoping the monkeys have something to fight for, because no one likes a pointless war, except the people involved. I'm sending six thousand, because I somehow doubt five thousand nine hundred and ninety nine would be enough. Better safe than sorry.<br/><br/>I could skip the whole thing and just balance a cheeseburger on my head, but that would look slightly retarded, don't you think?</div>", "published": "2009-01-18T12:58:00.007000+02:00", "updated": "2011-04-07T13:15:03.443000+02:00", "draft": false, "categories": ["engineering", "domesticated animals", "food"]}