{"id": "on-fictional-nature-of-isolated", "title": "On the Fictional Nature of Isolated Thinking", "content": "I have always had the perception that other people think better when they sit still and concentrate on just thinking, but I've never had much luck thinking with nothing to keep the rest of me busy...<div class=\"readmore\"> I guess my misconception came from actors trying to mimic thought on TV, and popular phrases like \"sit and think\". The only times I ever realised that the popular perception could be wrong was when my dad quoted \"sometimes I sits and thinks, and sometimes I just sits\". Most of the time, I just sit. If I need to think, I have to find something to keep the rest of me occupied.<br/><br/>One of the easiest solutions, I found, was walking. I remember my brother and I having debates and discussions about a number of things before supper, and I would march in a circle around the dining room table, being careful to step in the centre of tiles in a precise pattern, because that was the only way I could get my mind to cooperate with me.<br/><br/>For most of my life, I have done a lot of my best thinking while walking. Even though my most productive serious problem solving time is in the bath, it is only because I tend to walk on the spot while lying down in the bath. I also used to read a lot, and as I lay in bed reading, my legs would walk against the wall. My bedroom wall had two dark lines across it where my feet had scraped out my footsteps. For the brief time that my bed lay under a window, I put a leg through the glass on two separate occasions. One of the things which annoys my father more than anything else is the way I wander aimlessly around the house while brushing my teeth or combing my hair whenever I have anything worth thinking about (which is most of the time).<br/><br/>When I was 16 or so, I worked out how to solve a Rubik's cube - a huge step forward in my thinking ability. The solution is just an algorithm, and after solving three or four different permutations, I could do it subconciously. It works far better than walking. When I needed to concentrate for a while, I pick up and repeatedly shuffle and solve my Rubik's cube.<br/><br/>Now that I think of it, right now, my hands are occupied with constant typing, I'm rocking in my chair, and tapping my feet together... </div>", "published": "2011-04-05T14:35:00.002000+02:00", "updated": "2013-01-21T14:12:07.211000+02:00", "draft": false, "categories": ["exercise"]}