{"id": "on-fourth-arbitrarily-defined-solar", "title": "On... a Fourth Arbitrarily Defined Solar Cycle?", "content": "For those who were wondering, the arbitrarily defined cycle this year happens to be a day longer than I've used before. This fortunately significantly reduces the <a href=\"http://www.alphasheep.co.za/2012/02/on-birthday-shift.html\">birthday shift</a> down to just over 47 minutes earlier than the 14:38 at which the first ever Alphanumeric Sheep Pig post appeared. <div class=\"readmore\"> This time, I'm not going to repeat the embarrassing mistake that I made last year, when the shift of 18 hours and 54 minutes (that I had not at the time calculated) meant that my post landed up going out a day late.<br/><br/>This last year marked a big step for me. Apart from finally being officially enrolled at university for my PhD, I more or less succeeded at my first attempt at lecturing part of a course. Was I lecturing something related to my thesis topic? No. Maybe the stuff I spent 4 years studying to get a Bachelor's degree? The stuff I studied for two years before that before dropping out? Not even that. On the stuff I taught myself in a week one summer holiday 5 years ago and haven't really used since? Um... Yes... That.<br/><br/>But what about the blog? Yes, the frequency of posts have been getting slower these days (I blame Minecraft - the game that sucked me in almost two years ago, and hasn't let me go since), but my readership is higher than ever. According to Blogger's official count, I've had over 90 000 hits! Google Analytics says there were 31 265 unique visitors in the last year, from 123 different countries (amongst which South Africa has slipped to fourth place). Wait. I think this needs a map...<br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/sD2uyuJju4E.png\" imageanchor=\"1\" style=\"margin-left:1em; margin-right:1em\"><img border=\"0\" height=\"226\" src=\"data/images/sD2uyuJju4E.png\" width=\"400\"/></a></div><br/>For the record, countries are coloured by the percentage of new visits, so South Africa appears slightly darker than the rest since those tend to be the people who know me personally (Thanks all of you loyal people, and the rest of you too).<br/><br/>Unfortunately, amusing Google searches have more or less disappeared off the radar. They are far overshadowed by searches for \"minecraft bookshelf\" (You're looking for <a href=\"http://www.alphasheep.co.za/2012/07/enchantment-level-vs-bookshelf-part-iii.html\">this</a>), \"boeing 747 dimensions\" (maybe <a href=\"http://www.alphasheep.co.za/2012/10/minecraft-boeing-747-part-2.html\">this</a>?), or \"minecraft mining techniques\" (obviously <a href=\"http://www.alphasheep.co.za/2011/09/on-analysis-of-minecraft-mining.html\">this</a>, which may be quite old, but it's still valid), although searches for my <a href=\"http://www.alphasheep.co.za/2010/11/on-ring-around-sun.html\">explanation of the halos around the sun</a> still feature quite prominently. I have to say that I'm disappointed at the poor performance at my first infographic attempt (<a href=\"http://www.alphasheep.co.za/2012/06/on-using-moon-to-guess-time.html\">using the moon to tell the time</a>).<br/><br/>I will do my best to keep posting for another year, and hopefully after that. If you haven't already, encircle, like or follow using the links in the sidebar on the left. Speaking of which, are you aware of the mobile and tablet friendly version of the site I launched a couple of years ago? Top of the sidebar on your left, or type the address in your device's browser: <a href=\"http://bloggertouch.appspot.com/alphasheep\">bloggertouch.appspot.com/alphasheep</a>. If you regularly read this blog on a phone or tablet, bookmarking that may be a good idea.<br/><br/></div>", "published": "2013-01-17T10:09:00.001000+02:00", "updated": "2013-01-17T10:09:53.876000+02:00", "draft": false, "categories": ["land marks"]}