{"id": "on-fruits-and-vegetables", "title": "On Fruits and Vegetables", "content": "Consider for a minute or two the consequences of building a house out of carefully treated and prepared fruits and vegetables. How would the house look? How would it smell? How durable would it be? Would it be a feasible idea in the long term? I mean very long term, as in would it be comparable to more conventional materials, such as wood, bricks, steel, concrete and the like...<div class=\"readmore\"> Think about that for a minute or two, and see what you come up with.<br/><br/>Then imagine a pea. A single green roughly spherical seed from a legume, approximately 7 millimetres in diameter, containing carbohydrates held together in a tightly packed unit by glycosidic bonds and held together with a soft protein shell, to feed a single microscopic cluster of rapidly multiplying and mutating cells that serve absolutely no other purpose except to consume their surroundings, eventually spread out into a complex network of intelligently controlled cells, eventually produce more peas before being discarded completely, to rot and decay and disintegrate and eventually dissipate. Only a tiny fraction of the peas will ever serve this purpose. Most will be eaten by some other cluster of rapidly multiplying and mutating cells, some of these clusters being consisting of tens or hundreds of trillions of cells. All these clusters serve that single purpose: consume, spread and multiply. These are all attached to another single roughly spherical object which is two billion times bigger than the original pea, containing liquid metal silicates held together by a mutual gravitational compression, with a brittle magnesium silicate and aluminum silicate shell which serves no purpose, and only exists because it is stuck in a never-ending plummet towards (although eternally missing) yet another roughly spherical object one hundred times bigger than itself. This sphere itself only exists as the result of an uncontrolled self-sustaining nuclear fusion explosion that was detonated by a collapsing gas cloud formed in another unbelievably massive, yet microscopic explosion billions of years previously. The collapse of the gas cloud has been temporarily stopped by the nuclear reaction, but will inevitably resume as soon as the gaseous fuel has been used up, until it is a hundred thousandth of its current size. This is in turn drifting in its own slow never-ending plummet towards a single point of oblivion along with several billion similar collapsing gas clouds, and this point of oblivion is drifting away from several billion other similar points, but gradually slowing down, until the mutual pull of all the billions of points in the universe cause a collapse into a single point, which is only a figment of the mathematics’ imagination, and doesn’t truly exist in the real world, and this temporary quantum fluctuation can no longer be considered to truly exist. Peas really are fascinating.<br/><br/>Did you forget about the house? Think of it now. And now think of it tomorrow, and in the next week, in the next year, in the next decade, in the next century, in the next age... Is it still a house? Did you think of it as a hollowed pile of untreated decaying vegetable matter, or did you consider the carefully treated and prepared fruits and vegetables that formed a single carbon supercrystal that will last undamaged for millions of years.<br/><br/></div>", "published": "2010-04-11T15:25:00.001000+02:00", "updated": "2013-01-21T14:36:23.328000+02:00", "draft": false, "categories": ["time", "history", "philosophy", "food"]}