{"id": "on-going-forward-in-simple-english", "title": "On Going Forward in Simple English", "content": "Have you been listening to business reports on the radio recently? Ten years ago, people would have said “taking a long-term view”, but over the last few months, people have started saying “looking at things going forward”. It’s strange watching language evolve right in front of your eyes.<div class=\"readmore\"> I understand that it is the popular way to put it at the moment, and that it’s trying to sound modern, but it really does sound like they’re adapting their speech for a <a href=\"http://simple.wikipedia.org/wiki/Fish\">Wikipedia Simple English</a> article.<br/><br/>I’ve always wondered how these things started out. I can see one person in an office who wants to sound modern and different. (Probably the guy who’s away every second week on a “effective management” course, and not embarrassed to wear a bright yellow shirt to a meeting. He doesn’t wear ties, but if he did, it would probably be neon purple. In other words, the attention seeker.) He’s sick of hearing everyone using the same words, so he comes up with a new way of saying something, just to sound different. Because its so funny, everyone starts mimicking it, and before they know it, they start using his words unintentionally. At first it is “Bob in the corner office” who has the weird way of talking. Then suddenly it’s “those guys in marketing”, then “those guys on the seventh floor”. For a brief time, it becomes “those guys at head office”, and then suddenly, no one notices any more since it’s the accepted way. Suddenly, the previous term sounds old fashioned.<br/><br/>(On a side note: This whole idea of a large group picking up a mannerism from some one else happens all the time. In third year, we had a lecturer who ended every sentence with a ‘with’ or ‘of’. He had very good technical English, and would give a clear and well structured sentence and end off with an ‘of’. “The controller sends a 24V signal which triggers the contactor, and this switches off the motor of.” I can’t say that it wasn’t funny, and in time, some of my classmates (me included) found ourselves doing it occasionally. It took a couple of months to lose the habit.)</div>", "published": "2009-09-20T12:48:00.002000+02:00", "updated": "2011-03-07T14:21:26.321000+02:00", "draft": false, "categories": ["language", "stereotypes"]}