{"id": "on-google-part-ix-and-some-other-search", "title": "On Google, Part IX... And Some Other Search Engines Too", "content": "I haven’t written a Google post in months, which is unfortunate, since it was sort of a tradition with this blog. There's a lot to catch up on, so this post is quite long...<div class=\"readmore\"> Of course, I use the term Google loosely to refer to what should be correctly called a “search engine”, because ask.com and Yahoo users are just as bad as the Google users. (But I don’t refer to Bing... I ignore Bing, and Bing ignores me. I do not like Microsoft.)<br/><br/>The Google saga somehow turned into some sort of ongoing series, which was not the intention when I started the first post, but it’s already making its 11th appearance. I think it’s time for a recap. <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/03/on-google-searches.html”\">Episode I</a> started as a sort of consolation for those who came across my blog searching for information in the hopes that there might be something useful here. I was a little upset that my visitors were leaving disappointed, so I made an effort to answer some of the most common questions (which seemed to involve far too many ants). <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/04/on-google-searches-part-ii.html”\">Episode II</a> came about, because the internet really does have all the answers, but most people don’t know where to look. <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/05/on-google-part-iii.html”\">Episode III</a>  was there because some of the questions were starting to get downright silly. <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/05/on-google-part-iv-not-on-google.html”\">Episode IV</a>  was simply about Google and the number 23. <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/05/on-google-part-v-yet-again.html”\">Episode V</a>  was a bit of filler episode (which needs no comments, please), but <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/07/on-google-part-vi.html”\">episode VI</a>  returned to the original story line, bringing in, not just searches returning this blog, but searches in general. <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/09/on-google-part-vii-on-google-part-vii.html”\">Episode VII</a>  is not relevant to this recap, because if you’d followed my instructions, you would not be reading this, <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/09/on-google-part-viii-pencils-kinetic.html”\">Episode VIII</a>  returned to my original mission of answering questions that came up in search engines (which inspired a <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/10/on-pencils-kinetic-energy-part-ii.html”\">side story</a>). There was also a <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/06/on-blue-monkey.html”\">special episode</a>, which was rather tedious, and certainly not worth rereading. <br/><br/>Back on track, and since episode VIII was similar to episode I, and it’s side story had a similar tone to episode II, I believe that it’s only fitting that episode IX follow the format of episode III... A somewhat more comprehensive version of that episode. OK. After that little diversion, it’s time for the show... <br/><br/><b>how destructive are sheep</b> - It depends. Are you talking about destructive to lawns, or destructive to cities... A herd of sheep can annialate a lawn in a matter of hours, but sheep don’t do that much damage to buildings... They are fairly weak for their size.<br/><br/><b>\"her three heads\" -Hecate -Hekate</b> - Yes, all three of them.<br/><br/><b>giant rabbits and chickens</b> - It’s an acceptable combination, since chickens are rather harmless animals, and the giant rabbits, being herbivores, tend to ignore the chickens.<br/><br/><b>pig with sheep hair</b> - No. Woolly pigs do not exist.<br/><br/><b>\"toilet swallows pupil\"</b> - I wish I knew... I honestly wish I did.<br/><br/><b>sheep poison potatos</b> - No they don’t. There is absolutely no recorded incident of even an attempted potato poisoning carried out by a sheep.<br/><br/><b>draw a sheep pig</b> - No. I could, and I have before, but I don’t just draw on demand. And neither does Google.<br/><br/><b>alpha-numeric thinking problems at 24 hours in a day </b> - If you’re having problems thinking all day, you should probably go see a doctor. It might be a tumour or something serious, and it would be seriously unethical for me to help you here.<br/><br/><b>two sheep pig</b> - Nope. Just one. The alphanumeric one.<br/><br/><b>laminated plastic</b> - Yes, laminated plastic. A nice cheap alternative material for a variety of household uses.<br/><br/><b>how to draw rabbits eating</b> - Draw a rabbit. Make its head tilt down. Draw some lettuce around it. Or maybe it’s head not tilted down, but a piece of lettuce sticking out of it’s mouth.<br/><br/><b>rabbits eating chicken </b> - Very unusual. Perhaps you are mistaken. Rabbits are the little things with long ears and fluffy ball-like tails. The animal with the pointy ears, and a long tail is actually your neighbour’s cat.<br/><br/><b>how to store cheese in the fridge fungus</b> - Wrap it up and place it on a shelf. The temperature should be between 4 and 7 degrees Celsius.<br/><br/><b>very aggressive giant rabbits </b> - Giant rabbits are less aggressive than their conventionally sized counterparts. Perhaps it has rabies?<br/><br/><b>pig mating sheep</b> - Dude... That’s disgusting. Can we drop this subject? Right now? Please...<br/><br/><b>squirrel eggs</b> - No. I understand that you saw a squirrel in the tree, and a nest in the tree, and that there were eggs in the tree. This does not mean that the eggs were laid by the squirrel.  Remember that squirrels are notorious home invaders. The eggs must have been laid by dinosaurs.<br/><br/><b>skunk stolen</b> - It wasn’t me. I swear.<br/><br/><b>can rabbits eat salad</b> - Tuna salad? No. Chicken salad? I guess they can pick out the chicken and eat the rest. Green salad? Certainly.<br/><br/><b>alphanumeric over v neck</b> - I’m not sure. I’m clueless when it comes to fashion/<br/><br/><b>sheep don't eat potato plants</b> - No they don’t. They eat grass.<br/><br/><b>numbering, type, alphanumeric, sort out</b> - Gees... That’s pretty rude. And until you ask politely, I’m not going to sort it out. I think using the roman numerals to number repeated posts is perfectly acceptable, and I’m not going to change it.<br/><br/><b>skunk pig</b> - Are you trying to insult me? Saying I smell or something?<br/><br/><b>utensils blogspot </b> -All you need to know is that they are <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/08/on-danger-of-eating-utensils.html””\">dangerous</a>.  Plotting to kill you. It’s the penguins, I’m sure.<br/><br/><b>sheep as smart as pigs </b> - Nowhere near. Sheep are seriously stupid.<br/><br/><b>pig eating utensils </b> - They don’t exist. Pigs don’t use utensils because their trotters don’t allow them to grip tools. They use only their mouths. <br/><br/><b>WORDING FOR DOOR SIGNS CLOSED DUE TO WEATHER </b> - Please read <a href=\"http://alphanumericsheeppig.blogspot.com/2009/07/on-closed-doors.html\">this</a> and then <a href=\"http://alphanumericsheeppig.blogspot.com/2009/08/on-closed-doors-part-ii.html\">this</a>.<br/><br/><b>my house is infested with ants </b> - That’s unfortunate. Perhaps it’s time to move out?<br/><br/><b>pig intelligence </b> - Pretty high. Higher than a sheep’s anyway, and certainly higher than 90% of internet users.<br/><br/><b>famous alphanumeric laws </b> - Most laws are alphanumeric. Mainly because alphanumeric characters are the standard means of expressing the English language in a written form these days.<br/><br/><b>potato toxic sheep </b> - Yes. Potatoes are toxic to all animals when green. Cook it until it the inside goes white and it’s safe to feed it to your sheep. Although, it’s probably healthier to feed your sheep grass.<br/><br/><b>\"my foot\" sprain blogurl:.blogspot.com/ </b> - No, my foot. Not yours. You sadistic bastard. It’s better now, so I’m going to come kick your butt.<br/><br/><b>kinetic energy of a pencil landed on the carpet </b> - This was answered in <a href=\"”http://alphanumericsheeppig.blogspot.com/2009/09/on-google-part-viii-pencils-kinetic.html”\">Episode VIII</a>.<br/><br/><b>Alphanumeric Respect T-Shirt</b> - Like I said before, fashion is not my field.<br/><br/><b>what do you know by looking at the front cover of the sheep pig </b> - The title, the author, and possibly the publisher, depending on which edition you have.<br/><br/><b>black dot on potato poison</b> - Like I said, if it’s green, it’s bad. Cook it until it goes white and it’ll be fine. The black dots on the skin are not poisonous at all. It’s the green in the flesh of the potato that’s the culprit. <br/><br/><b>when turning tap off in the house it makes a groaning noise</b> - Yes, it does. As you close the tap, it blocks the water. The water needs to slow down and stop, and this forms a series of compression waves. These travel back up the pipe at the waters sonic velocity. The net result is a moving pressure gradient along the walls of the pipe, which results in a very slight deformation in the pipes shape, depending on how it is held in place or mounted inside the walls. This changing in shape can cause either groaning or rattling noises as the pipes pull at their mounts, especially in older buildings.<br/><br/><b>are potato plants toxic to pigs</b> - Again, yes. Raw fresh potatoes have a faint green tint. This is caused by a class of chemicals known as glycoalkaloids (particularly solanine), which are toxins which attack the nervous system. Cook the root until it goes white, and it’s safe to eat, even for pigs. The rest of the plant is never safe for any mammal to eat.<br/><br/><b>died from eating potato</b> - There are none that I know of (excluding choking, of course). Concentrations of toxins in potatoes are kept low enough that they are not deadly. Quoted from Wikipedia, “symptoms include nausea, diarrhea, vomiting, stomach cramps, burning of the throat, cardiac dysrhythmia, headache and dizziness. Hallucinations, loss of sensation, paralysis, fever, jaundice, dilated pupils and hypothermia have been reported in more severe cases.”<br/><br/><b>spelling pig noise</b> - Pigs have a range of noises, including “oink”, “squeal”, “hiss”, and “woof”. I’m serious about this. Pigs bark like dogs almost as much as they oink.<br/><br/><b>why is pig not very useful</b> - They are fat and lazy. How many fat and lazy people do you know who are useful? <br/><br/><b>sheep intelligence</b> - I have never seen any evidence that this exists.<br/><br/><b>trick with radius and sheep</b> - I’d really like to learn it whatever it is. Especially if it’s involves making sheep fly...<br/><br/><b>are potatoes poisonous to sheep</b> - I’ve answered this already, but for the record, sheep eat grass, not potato.<br/><br/><b>Being body smart and not having ADHD</b> - I’m not sure what you mean here?<br/><br/><b>pig door handle</b> - As opposed to a conventional metal or brass one? Or do you mean one that oinks or squeals when you turn it? Or a metal door handle in a pig shape?<br/><br/><b>what do blue monkey eat</b> - Absolutely anything, as long as it can be chewed and resembles food.<br/><br/><b>HAVING INTELLAGENCE</b> - I’m sorry, but Google can’t help you there, and neither can I. Some of us were born with it. Unfortunately, you weren’t.<br/><br/><b>pig pokemon</b> - Swinub, an ice and ground type Pokémon (a rather pathetic one at that), which can evolve into Piloswine, and then into Mamoswine (using the Ancient Power).<br/><br/><b>sheep breading tehnology</b> - If you mean technology that will grind up a sheep into a fine powder, which can then be combined with water and yeast to form a dough, which can be baked to form a solid loaf, then I’m sorry, but I don’t know of any.<br/><br/><b>alpha numeric pig shaped</b> - You’re probably better off making your own. They’re not easy to find.<br/><br/><b>animan jaw wat louk as a pig</b> - I’m not sure what an animan is. (Is it really that surprising that this came from South Africa?)<br/><br/><b>squeak ants2</b> - Ants are silent. They don’t squeak.<br/><br/><b>ideas for sheep pig art</b> - A big part of art is creativity. Observe sheep pigs and use your imagination.<br/><br/><b>the sheep pig story extract</b> - Go to a library. Read the book. It’s a short children’s book. You can finish it in an hour. Stop being so lazy.<br/><br/><b>misconception in maths integral</b> - Which one? There are millions of them. They have been the downfall of many first and second year university students.<br/><br/><b>house settling causing crashing noise</b> - A crash is more unusual, but possible. Rattling and groaning are far more common.<br/><br/><b>how to make alphanumeric monkey</b> - Take one male and one female alphanumeric monkey. Encourage [censored action] and wait.<br/><br/><b>alphanumeric piggy drawings</b> - The best way is to get a normal drawing, and then make it alphanumeric.<br/><br/><b>alphanumeric pig </b> - See above.<br/><br/><b>draw a thin sheep looking at the sleeping pig</b> - You’re not going to get lessons for something so specific. Picture it in your mind, imagine the lines on the paper, and draw.<br/><br/><b>can ants dig thru cement</b> - Yes.<br/><br/><b>are sheep smarter than pigs</b> - No.<br/><br/><b>pig mating dog</b> - Dude, seriously... That’s really, really disgusting. I thought I told you to drop this subject? Please... Right now.</div>", "published": "2010-03-07T18:33:00.004000+02:00", "updated": "2011-04-07T13:18:14.662000+02:00", "draft": false, "categories": ["incompetence", "those damn penguins", "fashion", "Google", "food", "pencil", "technology", "doors", "medicine", "houses", "mathematics", "domesticated animals"]}