{"id": "on-games-of-logic", "title": "On Games of Logic", "content": "Very early on in my school career, I showed practically no mathematical ability (possibly due to a boring teacher, combined with a bit of ADD, my annoyingly slow brain with very little capacity when it comes to short term memory).<div class=\"readmore\"> At the age of around 8 or 9, I began to show an aptitude for maths that was somewhat higher than most kids of my age (probably around the time when maths became about working things out rather than memorising multiplication tables). As a result, my teacher recommended that I join the schools chess team.<br/><br/>There is a remarkably common misconception that people who are good at mathematics are good at chess. This is not true at all - to be good at chess requires two abilities: pattern recognition, and enough memory to hold a decision tree consisting of all possibilities for at least the next three of your turns . My pattern recognition is only average, and my memory has difficulty in holding even the moves available in the current turn. No surprises then that I landed up at the bottom of the team. I still cannot understand how people associate chess with a mathematical ability. It is merely a combinatorial game, and it's difficulty arises due to the shear number of posible locations for all of the pieces on the board. Also, chess requires very little in terms of reading your opponent, because it almost always safe to assume that your opponent will choose from a limited set of \"good\" moves that will lead to either an improvement in position or an advantage within three to five moves.<br/><br/>That aside, in high school, mathematics was a prerequisite for computer programming. This is something else I could not understand. Programming requires only one skill: the ability to break a problem down into a set of smaller problems - something which helps, but is not essential, for mathematics. There are many people I've met who are exceptional programmers who struggle with maths, and there are many people who have no problem at university level maths who struggle with programming.<br/><br/>All this shows is that no one actually knows what it takes to be good at mathematics.<br/> <br/></div>", "published": "2011-06-27T13:47:00+02:00", "updated": "2013-01-21T14:06:00.302000+02:00", "draft": false, "categories": ["mathematics"]}