{"id": "on-google-searches-part-ii", "title": "On Google Searches: Part II", "content": "Bad grammar really annoys me sometimes. Recently, someone Googled \"what does giant rabbits eat\", which for some reason, returned this blog as number two on the list. The worst thing is that he was from the United Kingdom - the supposed home of the English language.<div class=\"readmore\"><br/><br/>It is quite interesting that he focuses on giant rabbits, since this actually seems to be quite a popular search topic. One in particular simply asked Google \"do giant rabbits actually exist\"? The fact that this blog was Google's best answer just goes to show that the internet does not have the answer to every question. Or perhaps it does, but so many people think of Google as some person who knows everything, who sits in front of a computer all the time and lists out web sites containing the answers to any question you might care to ask. The truth is that Google only knows what I tell it (or what people like me tell it), and if I lie to Google, then Google will lie to the world.<br/><br/>To answer the questions people might have about giant rabbits, they do exist. And they eat exactly what any other rabbits eat - grass, leaves and rabbit pellets - just in larger quantities than a conventional rabbit.<br/><br/>Breeds of giant rabbit recognised by the American Rabbit Breeders Association (ARBA) include the Checkered Giant, the Giant Chinchilla, the Flemish Giant, and German Grey Rabbits. There is also a British Giant, however ARBA does not accept this as a genuine rabbit breed because it is uncommon in the US. And of course, anything that is uncommon in America is uncommon full stop.<br/><br/>Another search was \"sheep and pig can be together\" written all in capitals. A rather bold statement, and I don't think its true. I don't think that sheep are aggressive towards pigs, however sheep evolved on rocky mountains and open fields - while pigs evolved in dense forests. The two would never encounter each other in the wild, and would therefore have no need to be together in captivity. Anyway, sheep need lots of space with soft ground with lots of lush grass, while pigs prefer close surroundings and ground from which dust can easily be kicked up. There is no problem with keeping them together, but one of them would definitely not be happy. Why would you want to keep them together anyway?</div>", "published": "2009-04-15T14:58:00.006000+02:00", "updated": "2011-05-03T15:03:05.226000+02:00", "draft": false, "categories": ["Google", "annoying things"]}