{"id": "on-grandparents", "title": "On Grandparents", "content": "Earlier this week, my grandfather passed away. Looking at the way I've turned out, it's amazing how I landed up as the culmination of the collective influences of all four of my grandparents. <div class=\"readmore\"> Naturally, my parents did play a significant role, but a lot of what they passed on to me came from their parents. There is no doubt that I'm extremely grateful that I had the grandparents I did.<br/><ul><li>Douglas (1918-1988): My father and aunt often told me the story about how he was once asked \"What do you want to do when you finish school?\" He smiled, because by then, he already had a Master's degree in analytical chemistry. Although the only memory I have of him is one of sitting on the floor next to him in his armchair, he still played a fairly significant role in my life. Apart from the fact that I look remarkably similar to him when he was my age, the chemistry and electric kits that I grew up messing around with (which played a big role in how I turned out) came from him.</li> <li>Barbara (1923-1997): We did not have many TV channels when I was younger, and if it weren't for my grandmother carefully recording shows like <a href=\"http://en.wikipedia.org/wiki/Teenage_Mutant_Ninja_Turtles\">TMNT</a>, <a href=\"http://en.wikipedia.org/wiki/Dinosaucers\">Dinosaucers</a>,  <a href=\"http://en.wikipedia.org/wiki/Saber_Rider_and_the_Star_Sheriffs\">Saber Rider</a>, and  most importantly, <a href=\"http://en.wikipedia.org/wiki/Wallace_and_Grommit\">Wallace and Grommit</a>, I would have missed out on the shows that more or less defined my early childhood imagination. I have no idea how she knew what to tape, but she somehow managed to get the right shows every time.</li> <li>Ethne (1932-1999): There's no doubt that my the large majority of my tastes came from my grandmother - from food, to art, to furniture, to music. There are so many piano pieces that make me feel nostalgic because I can remember hearing my grandmother playing them, or even because they have something in common with something she used to play. Even though it's not a piece she played, I cannot listen to <a href=\"http://www.youtube.com/watch?v=ef-4Bv5Ng0w\">Chopin's Prelude in E-minor</a> without thinking of her and crying.</li> <li>Alan (1928-2012): I remember when he taught me and my brother how coordinates worked (I must have been about 11 or 12 at the time). We sat with graph paper and carefully worked out the coordinates of vertices so that we could get the computer to plot a Tyrannosaurus. At the time, I thought it was a game, not realising that I'd be using the same concepts at university more than a decade later. It never ceased to amaze me how he could remember maths he'd studied at university 60 years earlier, when I could barely remember stuff I learned in the last couple weeks. My fascination with engineering and large machinery definitely comes from him. One morning in 1995, we followed one of the last steam pulled journeys of the <a href=\"http://en.wikipedia.org/wiki/Blue_Train_(South_Africa)\">Blue Train</a>. There is still a framed picture from a calender of that very train on my wall. On one occassion, I got to drive a steam engine by myself (under supervision, of course), taking it up to 70km/h, which is an experience no 9-year-old could ever forget.  </li></ul><br/></div>", "published": "2012-10-25T14:50:00+02:00", "updated": "2012-10-25T14:52:04.968000+02:00", "draft": false, "categories": ["people", "history"]}