{"id": "on-giant-rabbits-eating-salad", "title": "On Giant Rabbits Eating Salad", "content": "Which, when you think about it, is not that unusual. Giant rabbits aren't exactly something you'd see every day (unless you are the owner of an abnormally large rabbit), but they certainly do exist. And if you saw a rabbit busy eating, you would not really be too surprised to find that it is in fact eating a salad. But, if you found that it was eating a chicken salad, you'd be mildly surprised.<div class=\"readmore\"> However, the logically conclusion you'd have to come to is that someone else had prepared the salad, and that the rabbit (being a rodent, and therefore prepared to eat anything) would eat it without giving it a thought.<br/><br/>(On a side note: Rabbits have been known on occasion to eat through the type of steel fences that are commonly used to create their cages. Chickens don't, which is why fences of that sort of design are called \"chicken wire\" fences - not because they are used to enclose chickens, but because they keep chickens enclosed. They are often used to enclose rabbits, but, of course, rabbits eat chicken wire, so calling it rabbit wire would be a bit misleading. Contrary to popular belief, chicken wire is not made from chickens.)<br/><br/>However, If you were to see an abnormally large penguin eating a chicken salad, you would be very surprised. Especially if it was in your own kitchen. You have to rule out the fact that someone else would prepare a chicken salad for a penguin, as this would make no sense. A tuna salad would make sense, or a smoked salmon salad. A loving penguin owner may feel that a bucket full of raw fish is not enough, but preparing a chicken salad would be taking this a bit far. The only logical conclusion you can draw is that the penguin prepared its own salad, which is very likely to have involved a sharp knife.<br/><br/>If the fact that the penguin could wield a knife isn't scary enough, you'd have to bear in mind that it was wielding a knife in you own home. And also bear in mind that this is a giant penguin, which is probably considerably stronger than your conventionally sized penguin. Penguins are not usually aggressive, but you don't know how this penguin was raised, or who it associates itself with. It could easily have been abandoned by its parents, bullied excessively by its peers, found and raised by the Mafia and trained to be a vicious killer. It may seem unlikely, but apart from what you've seen on TV, how much do you really know about the childhood of penguins.<br/><br/>The truth is, it is probably not going to share. You're best option is to go get your own chicken salad. Or sandwich, or something... You could probably go steal from the rabbits if you really want.<br/><br/>Don't get me wrong. I really like penguins, but you have to draw the line somewhere. If I was attacked by a knife-wielding penguin, I'd be willing to change my stance.</div>", "published": "2009-03-01T12:26:00.007000+02:00", "updated": "2011-04-07T13:15:03.440000+02:00", "draft": false, "categories": ["engineering", "those damn penguins", "domesticated animals", "food"]}