{"id": "on-google-part-vi", "title": "On Google, part VI", "content": "Google is an ingenious tool. It learns from the people who use it, and adapts to what they want. And most of the world’s internet users use Google. That makes Google the perfect tool for the average internet user to find information.<div class=\"readmore\"> Google is designed specifically to make it as simple as possible for the average internet user to find information they want. It is a brilliant idea.<br/><br/>The thing Google did not take into account was that the internet is playing a bigger and bigger role in the lives of humans. The internet is now accessible, and average internet users are no longer smart geeks like 20 years ago. Now, the average internet user is just a normal human. This is unfortunate, because the global average for intelligence is pretty low. This means that Google makes information easy to find for idiots, and the minority who are serious and actually need useful information are left to dig through the mud for it. This, I suppose, is fair. The serious information seekers are more capable of digging than the average idiot.<br/><br/>A feature Google used to include was a drop down list of previous searches. Which was stupid, because I either found what I was looking for and don’t need to search again; or I did not find anything, and need to try a different search. Google obviously realised this and replaced this feature. This new feature tries to guess what you are typing based on most the popular searches starting with the same letters. This is just a mirror into the mass stupidity of the human race.<br/><br/>My attention was drawn to this by a random picture I found listing the most popular searches starting with “I like to t…” The results are obviously hilarious: In the list, there were two that really caught my attention.<br/><ul><li>“I like to think of Jesus as a mysterious badger”</li><li>“I like to tape my thumbs to my hands to see what it would be like to be a dinosaur”</li></ul>Even more ridiculous are the searches starting with “why is there…” The results from Google South Africa are not that unusual, but if you go to Google.com, they get interesting. This time, I’ll give them all:<br/><ul><li>\"Why is there fuzz on a tennis ball\"</li><li>\"Why is there no j street in dc\"</li><li>\"Why is there a worm in tequila\"</li><li>\"Why is there daylight savings time\"</li><li>\"Why is there an apple on the cover of twilight\"</li><li>\"Why is there a leap year\"</li><li>\"Why is there a dead Pakistani on my couch\"</li><li>\"Why is there something rather than nothing\"</li><li>\"Why is there air\"</li><li>\"Why is there salt in the ocean\"</li></ul>Bear in mind that these are the most popular searches. The world really is a messed up place. </div>", "published": "2009-07-12T16:19:00.007000+02:00", "updated": "2011-03-16T09:36:35.426000+02:00", "draft": false, "categories": ["incompetence", "Google"]}