{"id": "on-google-searches", "title": "On Google Searches", "content": "Some interesting Google (and other search engine) searches have directed users to this blog. It just goes to show that the internet is no longer a worthwhile source of information, because there is so much crap out there... like this, which provides absolutely no answers.<div class=\"readmore\"> I would like to send my apologies to the people who made the following Google searches and found this blog, which was probably not what they were looking for<br/><br/>\"are wood ants destructive\" x2<br/>\"how many ants are destructive\"<br/>\"crossing a pig and a donkey\"<br/>\"rabbit not eating salad\"<br/>\"which bird tends to sheep\"<br/><br/>I really hope you found the answers you are looking for. I don't know everything, but I do try. Anyway, here are the answers in case you couldn't find them.<br/><br/>What you call wood ants could be termites (if they are white with 2 body segments). In this case, they are most definitely destructive. They could also be carpenter ants (3 body segments) which usually don't target healthy structures. In both cases, if they have nested in the walls of your house, they will be small holes in the walls with sawdust lying around. Termites also leave a bit of mud around the holes. If there are winged insects crawling out of the holes, this is a sure sign of a mature infestation - it's time to look for a new house.<br/><br/>All ants are destructive to a certain degree. It depends on whether you are looking at it from a leaf or a mountain perspective. I assume you are worried about your home? I have no idea if ants have ever destroyed a brick house, but wooden houses have been destroyed by ants before. You should probably be more worried about a termite problem. Read what I discussed previously. If you really don't know, you should call in a pest control expert.<br/><br/>A cross between a pig and a donkey would be sterile, stupid and pointless. I also don't see the point in it. All the good characteristics of both will be lost. It would be too fat and have stubby legs, so it wouldn't be able to pull a cart, and its meat would go all stringy and tough. Can you imagine donkey flavoured bacon? Is this pig wearing a funny hat?<br/><br/>If your rabbit is not eating salad then there are three possibilities. Perhaps the rabbit is not satisfied with the way you prepare the salad, or the rabbit is bored of salad and wants something else. Or the rabbit is sick. Either way, this is your rabbit we are talking about, not a broken toy. It is a living creature, and you should take it to the vet, not just Google it.<br/><br/>I've never heard of a bird that tends to sheep, however, there is a South American bird called the Southern Screamer that is trained to guard farms (because it screams really loud). It is also known as a Crested Screamer or Shepherd Bird.</div>", "published": "2009-03-27T14:34:00.009000+02:00", "updated": "2011-04-07T13:15:03.427000+02:00", "draft": false, "categories": ["Google", "houses", "domesticated animals"]}