{"id": "on-how-to-fix-world", "title": "On How to Fix the World: Part I", "content": "Without a doubt the world is broken. Fortunately, it just happens to be quite simple to fix. All it takes is a few concepts: equality, respect for opinions, caring for our own, recognising our own success, religion, and most importantly, taking ownership of our own ideas. The way we can fix the world is quite simply to take all of these concepts, and throw them away forever.<div class=\"readmore\"> I will explain exactly what I mean in another post very soon, but there are a lot of details to get out of the way first.<br/><br/>I may be young, inexperienced, prone to mistakes, pathologically hypocritical, and largely ignorant about far too much that's going on out there, but I have lived long enough, and naturally tend to think things through (albeit often in a very superficial manner). The problems with the world are countless, and the majority of them are so complex and subtle that it is impossible to put them into words. However, a few of the more serious of these problems that can be put into words. I have made some attempt at this. This is not the ramblings of a bunch of stupid, university-aged, middle-class children in some sort of \"occupy\" something movement, who know there are problems but can't put them into words apart from some \"one percent\" gibberish. This is the ramblings of someone who actually has a solution, and is ready to share it. Anyway, to start things off, here are the some of the biggest problems (that I can put into words) with the world as it is right now. (On a side note, I admit openly that I am guilty to some degree for all of these problems.)<br/><br/>    <span style=\"font-size: large;\"><b>1. A bunch of idiots have gone and screwed up our economic and financial systems.</b></span><br/><br/>And no. That bunch of idiots does not refer to any government. It doesn't refer to the big corporations either. It is quite simply you idiots. Every single one of us is partially responsible for messing up our economic systems. You convince yourselves that you need something that you really have absolutely no use for. You can try to deny it, but if you have ever bought a car when there is a smaller model in the same range, bought a smart phone or tablet (convincing yourself that you \"need\" it), or even if you are reading this while using the Windows operating system when there are so many free options out there, then you are guilty of making irrational economic decisions at some point. But, it's not just in finances and economics that we make irrational decisions. This brings me to the next problem.<br/><br/>    <span style=\"font-size: large;\"><b>2. Humans do not usually make rational decisions.</b></span><br/><br/>By a rational decision, I mean a decision that is made by weighing up all of the options, carefully considering them, making rough calculations (often using intuition rather than mathematics) based on estimated probabilities, and then selecting the option with the greatest overall benefit. Of course, we all think we do this, but we really don't. If you want a good example, look at decisions that have to be made under pressure. Driving is a good example. When people drive, they have to make all sorts of decisions, and irrational choices come up everywhere. Choices like not stopping at an orange or red traffic light, exceeding the speed limit, poor lane choices, waiting for the last second to overtake, and so on. But it's not just limited to driving. There are plenty of other examples in other aspects of life. Our decisions are almost always biased. Why? One of the reasons is obvious.<br/><br/>    <span style=\"font-size: large;\"><b>3. We are in it only for ourselves.</b></span><br/><br/>This one is straight forward. We are selfish. Even in major cases of charity and generosity, there is often some sort of personal motivation. I certainly don't want to detract from what they do (I firmly believe that it doesn't matter why something is done, as long as it is done), but even those that do give everything they have tend to do so for a selfish reason. A person that devotes their entire life to campaigning for cancer awareness might do so because they lost a loved one to cancer. Someone may say that we must save the rhinos, otherwise their children will never get to see those majestic animals (rather than save the rhinos for the rhinos' sakes). I'm not saying that people shouldn't try to save the rhinos, or that we shouldn't be raising awareness for cancer (although I believe that donating to actual cancer research would be a better cause). I'm just talking about motivations. It's definitely not a bad thing when people do good for selfish reasons, but what stops these people from doing bad? And of course, despite the fact that I used terms like \"often\", \"tend to\", \"might\" and \"some may\" in my explanation, some people will still try to argue against my point here by presenting counter-examples. Which is the next problem.<br/><br/>    <span style=\"font-size: large;\"><b>4. People generalise arguments.</b></span><br/><br/>I had an argument with my dad recently (and it's an argument that I've had with him before) about marriage. He believes that a marriage is a commitment to sort out problems, and believes strongly that a married couple needs to work as hard as they can to honour that commitment and do their best to stay together. I disagreed, stating that this can lead to a lot of unnecessary misery that could be avoided very easily if the couple were to simply divorce (or not bow down to social pressure to get married in the first place). He immediately argued that not all marriages lead to misery, and could not see why that had no bearing on my argument. Another example is the whole Xbox 360 reliability thing that went on a few years ago. I can't recall the exact statistics, but something like one in three Xboxes eventually crashed, giving the infamous red ring of death (RROD). Scores of people piped up to say that it was all rubbish, because they'd had their Xbox for three years and it was still fine. It's like saying that a coin having a 50% chance of landing on heads is wrong because you flipped a coin once and got tails. Mostly, people have no grasp of basic logic.<br/><br/><br/></div>", "published": "2012-03-20T14:30:00+02:00", "updated": "2012-03-27T13:59:40.705000+02:00", "draft": false, "categories": ["people", "fixing the world", "incompetence"]}