{"id": "on-how-to-fix-world-part-ii", "title": "On How to Fix the World: Part II", "content": "Last week, I wrote about some of the <a href=\"http://www.alphasheep.co.za/2012/03/on-how-to-fix-world.html\">problems with the world</a> as it is right now. I also claimed that I had a solution, which I still believe I do. It is quite simple, really. We just need to get rid of our concepts of equality, respect for opinions, caring for our own, recognising our own success, religion, and taking ownership of our own ideas. <div class=\"readmore\"> In this post, I will explain why we need to get rid of these. In a future post, I will hopefully explain how we can achieve this.<br/><br/>(On a side note: I am a pathological hypocrite. If you think this weakens the following arguments, then please read my <a href=\"http://www.alphasheep.co.za/2011/05/on-hypocrisy.html\">post on hypocrisy</a>.)<br/><br/>    <span style=\"font-size: large;\"><b>1. Equality.</b></span><br/><br/>Equality is a difficult one. People don't like being told that someone else is better than them. In truth, people are far too complex to be summed up and quantified, never mind equated. But, that's not the only reason we need to drop our concept of equality. The concept of equality misleads people. I will never run in the Olympic games, and spending my life trying to get there would be a wasted life. But it goes deeper than that. Each and every one of us has had different life experiences, has accumulated different knowledge, and processes that knowledge in a slightly different way. Some people are impulsive, some prone to errors, some are lazy, and some just don't know as much as others might. It is very important for each of us to realise that we are completely different and completely inferior to the ideal person. We each need to identify our own unique flaws and make sure that they are as little an inconvenience to others as possible.<br/><br/>    <span style=\"font-size: large;\"><b>2. Respecting Opinions.</b></span><br/><br/>Respecting the opinions of others is a very selfish and hurtful act. I have often heard it said that people have the right to their own opinions, but I couldn't disagree more. Sure, if an a person holds a belief that is well formed and justified by all available evidence, then the person has the right to believe that, but I do not consider that an opinion. That is a conclusion, arrived at by applying logical arguments to the available information, and is usually liable to change if more information becomes available. Letting someone's incorrect opinion go unchallenged could lead them to make poor decisions about how they want to spend their money, or more importantly, their time. We all have a social responsibility to make sure that no one's life is ever wasted for the sake of an uninformed opinion.<br/><br/>    <span style=\"font-size: large;\"><b>3. Looking after our own.</b></span><br/><br/>It is our natural instinct to want to look after our own children. Is that really the best thing for the entire human race though? Naturally, we all want the best for our children, but shouldn't we want the best for all children? People send their children to private schools when they don't like the public school systems, but shouldn't they rather be trying to improve the public schools? Most importantly, people naturally leave their inheritance to their own children, but why do the children of rich parents deserve money. There is absolutely no guarantee that they will land up intelligent enough, financially smart enough, or business-minded enough to deserve those riches. In fact, the number of \"rags-to-riches\" stories out there just goes to show that impoverished people are just as capable of producing geniuses as the wealthy. How many more of those stories would there be if every child was given the same opportunity to let their individuality make it for them rather than circumstances of birth.<br/><br/>    <span style=\"font-size: large;\"><b>4. Judging Our Success.</b></span><br/><br/>What we mean by \"making it\" is often based on meaningless criteria. In my opinion, you can only tell if a person was successful or not many years after their death. Success has nothing to do with wealth, and everything to do with what your contributions did for later generations (of all life in the universe in general). It's really sad how many wealthy people are considered successful, and consider themselves successful, yet live their lives in misery and stress. Don't ever think of yourself as successful. Leave that for future generations to decide.<br/><br/>    <span style=\"font-size: large;\"><b>5. Religion.</b></span><br/><br/>Religion is the one people tend to take a lot of offence to, although I really can't see why. Whether the teachings of various religions are right or wrong is not the point here (although they are all almost certainly wrong). The point is that teaching our children to take things on faith, rather than weighing up available evidence and drawing logical conclusions, is extremely damaging and irresponsible. It opens them up to manipulation later on in life. Horrors like suicide bombings are only possible if a person has been brainwashed to accept ideas based on faith alone, rather than compelling logical arguments.<br/><br/>    <span style=\"font-size: large;\"><b>6. Ownership of Ideas.</b></span><br/><br/>The final concept that we need to get rid of is the one that's already starting to go. We cannot own ideas. Knowledge is not something that can have any monetary value. Ideas and knowledge are infinitely reproducible, and in infinite supply. Discovery of knowledge and inception of ideas is a completely different matter (since these obviously cost time and resources to obtain), but if you have an idea, then holding it back from the rest of humanity for personal gain is an obviously selfish act. Likewise, laws that prevent ideas from being improved upon are counter-constructive. Someone may be incapable of coming up with their own original idea, but that does not mean that they are incapable of improving on another idea.<br/><br/><br/>In summary, (tl;dr) the world could easily be fixed if absolutely everyone thought logically, changed their opinions in the face of compelling arguments, and had respect for all life, rather than their own, essentially negligible, well-being.<br/><br/></div>", "published": "2012-03-27T16:43:00.001000+02:00", "updated": "2012-03-27T16:43:36.955000+02:00", "draft": false, "categories": ["people", "fixing the world", "incompetence"]}