{"id": "on-history-and-single-strength-of-human", "title": "On History and the Single Strength of the Human Race", "content": "I guess this follows on from the <a href=\"http://alphanumericsheeppig.blogspot.com/2009/04/on-invention-and-discovery-of-bread.html\"> bread discussion</a> I had last year, in which I hinted that the intellectual leap needed to go from a field of grain to a loaf of bread is to incredible to be possible.<div class=\"readmore\"> This idea is far greater than just bread. It can be used to unlock one of the greatest secrets to the overwhelming success of the human race. There is no doubt that humans dominate our planet, and there is no doubt that they do this only because of the technology at their disposal. Humans often claim that the reason they have so much technology is that their intelligence is far superior to that of any other creature on the planet. Without focusing on the arrogance of the statement, I’d like to point out that, in a sense, the opposite is true.<br/><br/>(On a side note: maybe I will focus just a little on the arrogance of the statement. Whoever came up with the idea that humans are smarter than animals obviously never had any pets (except for maybe some fish) and had very little contact with the outside world. The majority of dogs and cats I have encountered have been smarter than several people I have encountered. I am certain that my dog is more intelligent that at least two thirds of the people I have ever met.)<br/><br/>The reason that the human race is where it is today is purely because we are a race driven by pity. Not all of us... I admit that much. In fact, there are only just enough pity-driven people so that most acts of cruelty are frowned upon by the general society, but that is all it takes. In nature, most animals, if they look after their young at all, tend to ignore those animals with severe handicaps. It’s a matter of survival. These animals slow the group down, and there is little benefit to the group in keeping them. Humans, on the other hand, tend to look after the handicapped. A look at the social divisions within any school will show you this. In general, the children who are physically stronger and perform better at activities that would be useful to animals in the wild (such as sports, which simulate both hunting prey and evading predators) are less likely to come up with some invention. It is the physically inferior children who tend to advance technology.<br/><br/>Take for example the neighbouring nations of Sparta and the Greece. The Spartans would kill any infant who showed any physical weakness whatsoever, and their upbringing was such that any child who could not cope with a highly competitive life style would not make it to adulthood. Every child was raised to be a soldier. The Greeks were different. Children were allowed to choose their path in life. Greece became a thriving nation, with the world’s most advanced philosophers, and an extremely good understanding of architecture, shipbuilding and economics. Sparta was stuck in a technological rut for its entire history, and added absolutely no knowledge to the human race. Even their military strategies were merely adaptations of strategies used by older nations.<br/><br/>More importantly, cast your mind back to the beginning – the instant that the human race made the single discovery that would separate us from animals forever. Forget the opposable thumbs – most apes, monkeys and bears have those too. Forget even the tool use – there are thousands of other species who have worked out how to use tools for a variety of uses... even octopi can use tools. The one discovery that no other species has made is the secret of creating fire. It happened so long ago that particular day is now long forgotten. There is little doubt that man already knew fire well, from natural fires in the grasslands of Africa. There is also little doubt that the first fires were started from the sparks produced from a piece of flint – what amounts to little more than bashing rocks together. In my opinion, there is no doubt that the discovery of fire was made by a retarded kid who was sitting on a bed of dry grass, bashing rocks together.<br/><br/>The human race is only the dominant species on this planet because we do not kill off the retards.</div>", "published": "2010-01-31T18:54:00.001000+02:00", "updated": "2011-04-07T13:17:53.285000+02:00", "draft": false, "categories": ["technology", "people", "incompetence", "history", "domesticated animals"]}