{"id": "on-hydro-processed-nanocheese", "title": "On Hydro-Processed Nanocheese", "content": "Which seems like a mouthful at first, and it is. A mouthful of hydro-processed nanocheese, as long as that’s what’s in your mouth, and your mouth is full of it. If not, then it’s not a mouthful, is it? If I haven’t lost you (although I think I just might have), then I’ll try moving faster, taking sharper corners, and being slightly less predictable.<div class=\"readmore\"> The problem with driving like that, however, is an accident is more likely to happen. And no one likes an accident, especially if it’s a puppy that’s had an accident on the carpet. Especially if it’s your carpet. Even more especially so if you were the one who accidentally trod it in.<br/><br/>If I have lost you, then I recommend that you learn to read a map. Or buy a GPS, and you’ll be able to make your own way there without having to follow me. I’m not the easiest person to follow at times. I move fast and take the long route; the obscure route.<br/><br/>(On a side note: Or more just an example than a side note, but I like side notes, so I’m going to call it one. Two weeks ago, I was driving somewhere, and I was stopped at a robot*. A flashing green arrow came on telling me to turn left, so I did, even though my destination was straight ahead of me. The road brought me along side a golf course. I then saw a bridge off to the side, and decided to cross it. Ten minutes later, I was driving along a ridge with one of the best views of the city I’d ever seen. I wasn’t lost, because I could see where I needed to be. I just took twenty minutes longer to get there.)<br/><br/>(* On another side note for any non-South African that might read this: robot refers to a traffic light. This reminds me of my second year applied mechanics lecturer (a mostly deaf Indian, who had studied engineering in Canada), who, in our first lecture, recalled hearing a traffic report after his first arrival in South Africa. The report had said “Robots are out at several intersections, causing chaos in the traffic.” My lecturer had then said, in an accent not too dissimilar from Apu (from The Simpsons), “This is a very technologically advanced country.” The confusion lies in the technical definition of a robot. Foreigners, think of a robot as an automated machine which replaces a human function, and not a traffic light. But a traffic light is a robot. The human function is a traffic cop directing the traffic at the intersection.)<br/><br/>See? I like taking the long way. Have I lost you yet? Learn to read a map.<br/><br/>The problem with a map or GPS is that you have to know your destination, and maybe you don’t, which is why it’s important that you follow me. There is no reason for you not to know where we are going, since I think I made that quite clear from the start. The moment I typed “On Hydro-Processed Nanocheese”, in fact. The fact that I still haven’t gotten there is just more proof that I like taking the scenic route.<br/><br/>Enough of that nonsense. It’s time that this thing got somewhere.<br/><br/>“Washed” is a word that should be used with caution. It’s a simple, but powerful word that implies hard work resulting in a general cleanliness. Some people use it too casually, when they really mean “rinsed”. Then you hear those that talk about being washed in a river. In most rivers nowadays, the cleanliness implied by the word “washed” is a lie. In this case, “rinsed” is not a suitable word either, since it doesn’t convey the scrubbing and soap that went into the whole business. That is why I prefer the term “hydro-processed”. It implies nothing except that it involves some process (which may involve as little as one action), and that, somewhere along the line, it makes use of water. In other words, it means the same as “washed”, just without the implicit cleanliness. It’s definitely a better word, especially when used in conjunction with cheese, which contains several types of bacteria. (A lot of people take the word “clean” to mean the absence of bacteria, although a better term for this would be “very, very dead for a very, very long time”).<br/><br/>On the topic of cheese, micro cheese refers to grated cheese (in the vast world inside my head, which may vary slightly from the outside world you may be familiar with). Nanocheese is simply really finely grated cheese, or powdered cheese. The way parmesan cheese is grated. It’s quite simple really.<br/><br/>So, hydro-processed nanocheese is simply really finely grated cheese that has been rinsed in water. It probably tastes all watery, so I wouldn’t recommend it. Anyway, it all sounds like far too much effort to me. If you want cheese, its probably easier to have it straight.</div>", "published": "2009-08-30T13:37:00.006000+02:00", "updated": "2011-09-19T12:42:47.050000+02:00", "draft": false, "categories": ["traffic"]}