{"id": "on-how-wrong-people-are-reading-right-books", "title": "On How the Wrong People Are Reading the Right Books, and Why It Does Not Matter", "content": "Blog posts have been scarce the past couple of months. My excuse is simply and unashamedly that I've been reading. Ayn Rand's <i>Atlas Shrugged</i> is a book I've wanted to read for a number of years, but I've always put it off, because although I know many people who've started reading it, I don't know of a single person who's finished it.<div class=\"readmore\"> Seven weeks ago, I finally decided to give it a try, expecting it to be incredibly boring. I was pleasantly surprised. Although Rand's writing is admittedly excessively verbose and repetitive, I found the story captivating and the philosophy it promoted incredibly interesting. It is still fairly slow reading (especially John Galt's three hour radio address, which is quoted uninterrupted, word for word, across more than 60 pages), and it took me seven weeks to reach the end.<br/><br/>Toward the end of the novel, I began to realise that I was the wrong person to be reading it. Its political message of <a href=\"http://en.wikipedia.org/wiki/Libertarianism\">Libertarianism</a> and philosophical message of <a href=\"http://en.wikipedia.org/wiki/Objectivism_(Ayn_Rand)\">Objectivism</a> were views I already held, to some degree or another. The people who should be reading it are those who are living representations of the book's antagonists: The James Taggarts, Wesley Mouchs, Phillip Reardens, Robert Stadlers, Floyd Ferrises and Mr Thompsons of the world. The people who envy achievement and would rather jealously devalue the success of others than work towards success of their own.<br/><br/>Naturally, all of the characters are inflated embodiments of real life values. At first glance, the events come across as exaggerated in importance, and the consequences of actions appear excessively accelerated. One finds themselves asking, could the events described in the book really lead to the collapse of an entire country in just a few years? It's actually quite scary that the economic collapse that Rand predicts would result from certain interfering social and economic policies reads remarkably similar to the <a href=\"http://en.wikipedia.org/wiki/Zimbabwe#Economic_difficulties_and_hyperinflation_.281999.E2.80.932008.29\">history of Zimbabwe's economy in the last couple of decades</a>.<br/><br/>Even more worrying is watching the same social and economic policies being implemented or called for in my own country. It's impossible not to draw comparisons between the events in the book and our own stifling labour laws, calls for nationalisation of our largest industries, vast incompetence and indifference of people filling jobs for no reason other than that they need money, obvious corruption in government, refusal of anyone in a position of responsibility to accept blame for a job poorly done, and appointments of friends and family members without regard to qualifications or competence.<br/><br/>The book has made me fear for the future, and although I don't believe that withdrawing my mind will make the slightest difference, it has reinforced my belief that nothing is more important than rational thought. Everyone inherently knows from birth how to think rationally and objectively. It guides the early development of our minds, and influences our first actions and abilities - discovering the concepts of solidity and thereby learning to grasp objects, drawing the association of words with real objects and concepts and thereby learning to speak, developing an intuitive understanding of concepts like gravity and trajectories and thereby learning to stand and walk.<br/><br/>It is only through later indoctrination that we learn to suppress our rational thought, because we are taught that we shouldn't point out that reality contradicts another's opinion because they might consider it offensive, and learn that arguing - the most fundamental principle in rationalism - is viewed as a generally negative thing to do.<br/><br/>The main theme of <i>Atlas Shrugged</i> - that there is nothing more important than the value of one's own mind - is something that needs to be taught and reinforced throughout the world. Nothing is more powerful than reason, logic and critical thought, and your ability to apply them.<br/><br/>One of my first thoughts when I began to understand the meaning of the book was that political leaders should read it, but I soon realised that there is little hope that they'd understand it. As Rand describes, they would \"blank out\" reality in order to preserve their world view for fear of appearing selfish and moral. The process bears remarkable resemblance to George Orwell's concept of <i>doublethink</i>. Incidentally, it is for this very reason that <i>Atlas Shrugged</i> is such a long book (it appears in most lists of <a href=\"http://en.wikipedia.org/wiki/List_of_longest_novels#List_of_longest_novels\">longest novels</a>). Having previously written three novels attempting to explain her philosophy, resulting in a flood of questions from people who did not understand it, Rand felt it necessary to explain her philosophy in enormous detail, in as many ways as possible in a single book. Still, the novel receives a lot of criticism, often using arguments of forms that are explicitly debunked in the novel. People are incredibly stubborn when it comes to changing their opinions, and it is for that reason that it just won't make a difference if political leaders do read the book.<br/><br/>The only option we can do is promote a rationalist world view, teach our children to value the same, and hope that we can take over and try again from scratch once the looters have taken us back to a pre-industrial society. <br/><br/>I sincerely hope that it doesn't come to that.<br/><br/></div> ", "published": "2013-01-16T10:37:00+02:00", "updated": "2013-01-16T10:37:46.758000+02:00", "draft": false, "categories": ["people", "fixing the world", "incompetence", "philosophy"]}