{"id": "on-highly-brittle-materials", "title": "On Highly Brittle Materials", "content": "Regardless of whether they have a crystalline or non-crystalline molecular structure, they are typically rather smooth, especially when wet, making them rather easy to drop.<div class=\"readmore\"> They are also typically relatively heavy.<br/><br/>Of course, brittle materials that can easily withstand a drop from a height of, say, the average table height or the height of the average human hand would be perfectly acceptable materials for making, say, drinking vessels. However, a mixture of 75% silica with sodium oxide and lime additives, formed above it's glass transition temperature, and then cooled to form a highly brittle solid at room temperature, is not the first material that I would choose for making drinkware. However, I must admit that standard soda lime glass does appear considerably higher on my list than something even more brittle, a lot more expensive, and that has statistical evidence linking it to lead poisoning, such as, say, for example, the lead crystal glass that wine \"experts\" claim is essential for anyone who is more than just a casual wine drinker. (The wine \"breathes\" better when you swirl it, apparently, and the refractive index improves the colour of the wine... Apparently.)<br/><br/>Almost as bad as the poor choice in material is the container shape. I am not really sure that a tall thin glass has any greater aesthetic index than a short fat one, but it is obvious that it is a less practical shape. I do think that aesthetics are important, but if they interfere with the function of a design, then a compromise must be found, and function needs to take priority over looks. The most impractical shape, of course, is the typical wine glass shape, which has a very high centre of gravity and a long thin stem. The reason for this (apparently) is that you can then pick up the glass by the stem and not affect the temperature of the wine. A far more practical way of doing this would be to drink the wine from a mug.<br/><br/>A sensible design for a drinking vessel (or \"glass\", which is a word I am going to stick to for the sake of convenience) is not very difficult to come up with. A good design should be difficult to knock over, should not break when it falls, should be easy to hold and should not become slippery when wet.<br/><br/>To start with, a good material to use would be polypropylene, coated with a microscopic ceramic layer on the inside to prevent the leaking of oleamide and harmful biocides that may occur after extended reuse. A low centre of gravity would improve the glass's stability, and this can be achieved by intelligent shaping of the glass. A truncated cone is a good shape for this, with a base that is broad compared to the glass's height. In order to solve the grip, a sensible thing to do would would be to roughen the outside of the glass - a frosted pattern would also aid the glass's aesthetics. A rim would also help prevent the glass from slipping out of one's hand, and could be located some distance from the top of the glass so that the drinking lip is not affected. A very simple example of such a vessel (containing Creme Soda, of course) is shown below.<br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/35RMeSKkgow.jpg\" imageanchor=\"1\"><img border=\"0\" height=\"200\" src=\"data/images/35RMeSKkgow.jpg\" width=\"194\"/></a></div><br/>A wine variant that allows for the glass to be lifted without one's hand raising the temperature of the wine can be made by simply including a handle - which means that an ideal vessel for drinking wine is essentially a beer stein.</div>", "published": "2011-03-07T11:21:00.002000+02:00", "updated": "2011-03-16T09:34:31.094000+02:00", "draft": false, "categories": ["engineering", "incompetence"]}