{"id": "on-invention-and-discovery-of-bread", "title": "On the Invention and Discovery of Bread", "content": "Because, of course, invention and discovery are two distinctly different ideas. It does not matter what order they take place in, but both must take place for anything to be useful. In the case of bread, I am absolutely certain that it was invented before it was discovered. Some things can be discovered long before they are invented. In fact, most things are.<div class=\"readmore\"> Aeroplanes, for example, had existed in people’s imaginations for possibly thousands of years before they were actually built. Bread did not.<br/><br/>For someone in that age, when no one even understood simple concepts like wheels, and when no one had yet thought of sharpening rocks (you had to find one that was already sharp), to have thought up bread would have been completely amazing. Have you ever looked at a field of grain and thought, “These are quite tasteless, but if I picked just the seeds of several thousand of these plants; then crushed them really fine, mixed them with just the right amount of water, and then put it just the right distance away from the glowing embers of a dead fires, and then kept those embers at exactly the right temperature for the right amount of time; then I would have the perfect thing to put my lunch between so that I can hold it together more easily.” It would require unbelievable genius to make this leap. It is far more likely that someone just happened to mix in the right amount of water to make dough, and then forgot it by a dying fire for a while.<br/><br/>The only conceivable scenario that I could think of that would lead to us eating bread is that the accidental baker’s child picked up the forgotten loaf, and began to eat it. It must have been his son, because boy’s are more likely to actually eat something they found lying on the floor (girls just chew things), and he must have been four or older, because a younger child would not have indicated to the parent that it actually tasted good. The parent would then have tasted a small piece; decided that it tasted bland, and decided that that evening’s dinner should be served on it. Of course, any four year old boy given a slice of bread with something on would fold it in half, thereby inventing the sandwich.</div>", "published": "2009-04-05T12:39:00.006000+02:00", "updated": "2011-04-07T13:04:57.806000+02:00", "draft": false, "categories": ["technology", "food"]}