{"id": "on-irrational-driving-part-1-only", "title": "On Irrational Driving Part 1: Only Accelerating on the Downhills", "content": "There seems to be a growing trend for drivers to apply non-optimal behaviour to their driving techniques. I do understand that I tend to analyse things a bit more in depth than the average person, but there are certain facts that seem obvious to me. One of those facts is that it is more economical (not to mention less frustrating for other drivers on the road) to maintain a constant speed while driving along a straight road.<div class=\"readmore\"> Despite this, some drivers tend to enjoy accelerating the car to its top speed on the downhill sections of the road, and then let the car's momentum carry it up the following uphill at a much slower speed. This is a horribly inefficient way of driving, and I am going to attempt to explain why now.<br/><br/>In a very simplified consideration of a car, kinetic energy (or speed) is gained primarily from two sources, and mostly lost in two ways. The car gets extra kinetic energy by burning fuel, or by losing altitude. That is, if the car starts at the top of a hill, then without burning any fuel, it can start moving, simply because it is on a downward slope. The car loses energy to aerodynamic drag (and friction and a bunch of other things, but at fast speeds, drag is the most important), and by gaining altitude. A car slows down much quicker on an uphill than on a flat road. These things are obvious to most drivers, I hope.<br/><br/>The general idea for maintaining a constant speed is to balance the energy you gain from going down the slope with the energy from burning fuel. That is, you ease off on the accelerator on the downhills, and accelerate harder on the uphills.<br/><br/>On to the irrational behaviour. Some drivers, for some reason, like to put all the energy into the car at once, i.e. accelerate only on the downhills. It is very simple to show why this doesn't work. <br/><br/>Consider a road that consists of a 50/50 distribution of uphill and downhill slopes of equal gradient. Now consider two drivers: one who goes as fast as he can on the downhills, say 120 km/h, but then goes much slower on the uphills, say 80 km/h; and a second who maintains a constant speed of 96 km/h. We will assume that the uphill and downhill stretches are relatively long, and that the first car changes speeds quickly (so that we can neglect the time spent accelerating and decelerating). The advantage of these numbers is that for a journey of say, 6 km (which I chose for the round numbers it gives), both cars will take exactly the same time to reach the destination, that is 125 seconds. We will also assume that there are equal numbers of up and downhills, so that the starting point and destination are at the same altitude - this just makes the calculations a bit simpler. <br/><br/>The difference comes into the power that the cars lose through aerodynamic drag, since this power lost is proportional to the cube of the velocity (that is, a car doing twice the speed will lose eight times the power to aerodynamic drag). So while the drag of the first car is 30.6% lower on the uphills than that of the second car, it is 56.3% higher on the uphills. The result of this extra drag is that the first car loses 12.8% more energy to drag than the second car.<br/><br/>Since a specific quantity of fuel will release a specific amount of energy when it is burnt in the engine, this means that the car that accelerates hardest on the downhills will need to burn 12.8% more fuel throughout the journey.<br/><br/>So to sum up, a car that accelerates to 120 km/h on downhills but only does 80km/h on the uphills will use 13% more fuel than a car that holds a constant 96km/h, but arrive at it's destination at exactly the same time.<br/><br/></div>", "published": "2011-12-04T21:29:00+02:00", "updated": "2011-12-05T08:20:16.340000+02:00", "draft": false, "categories": []}