{"id": "on-imminent-loss-of-ultimate-kitchen", "title": "On the Imminent Loss of the Ultimate Kitchen Instrument", "content": "<div class=\"readmore\" style=\"float:right; padding:20px; font-size:75%; text-align:center;\"><img border=\"0\" src=\"data/images/VZs3qYVC9zM.png\" width=\"200\"/><br/>[A picture stolen from <a href=\"http://www.ebay.co.uk/itm/RARE-Tullen-All-Purpose-Snips-Shears-Discontinued-NEW-/270513925143?pt=UK_Kitchen_Accessories&amp;hash=item3efbe2ec17#ht_1119wt_879\">ebay.co.uk</a>]</div>Growing up, I always took the set of Tullen Shears (pictured right) mounted on our kitchen wall for granted. They could (and did) cut through almost anything, and I simply assumed that everyone had a pair. Unfortunately, over the last couple of years or so, they have been getting progressively less sharp. This is not that surprising, considering what they have had to cut through in their almost 29 year life: virtually everything, including plastic, cardboard, tin cans, chicken bones, a couple of pairs of sunglasses, and a glass window pane. <div class=\"readmore\"> Ironically, the one thing that it could never make a clean cut through was paper.<br/><br/>While the shears still work, they don't cut through some things (like plastic) quite as neatly as they once did, so we have been looking for a replacement pair for a while now. This has unfortunately been unsuccessful. After turning to the great power of the internet for an answer, we found (with some digging, in a forum dated five years ago, from someone claiming to be the daughter of the inventor of the shears) that Tullen New Zealand was sold to an English company in the late 1980s and they stopped making the shears shortly thereafter.<br/><br/>At first I was surprised that no one had ever seen the gap in the market and come up with shears that could match those once made by Tullen, but gradually it began to make sense to me. Those who have never heard of Tullen Shears do not know that such an incredible instrument is possible, and those that do know about them still have a working pair.<br/><br/></div>", "published": "2011-12-12T13:16:00+02:00", "updated": "2014-01-17T08:39:10.972000+02:00", "draft": false, "categories": ["technology", "history"]}