{"id": "on-john", "title": "On John", "content": "Crouching forward, glaring at the dull grey light emanating from the screen, the man appeared deep in thought. It took a while to realise that he was dead, and probably had been so for a day or so. Even after realising this, and seeing the red of the gunshot wound in the back of the man's head, John gave the body a quick nudge with the tip of his boot before checking for a pulse, just to make sure. Nothing. Of course. <div class=\"readmore\"> <br/><br/>He left the room, returning less than a minute later with a large black bag.  He pulled the chair out from under the table, and tipped the body onto the floor. In the manner of one who has unexpectedly spent a decade or two too long in one job, he dragged the heavy body into the bag and pulled the drawstring tight. A thick, tattered cord was hastily tied through a pair of roughly cut holes in the bag's base, and John dragged it out into the hallway, carelessly knocking furniture on the way out. He passed by the too-long-out-of-order elevator doors, and made his way down the stairs, the body thunking violently down each step. A hobo lay in a pile of his own vomit, drunk at the bottom of the stairs. John carried on walking, dragging the bag over the hobo’s legs as if he weren’t there. The hobo mumbled something unintelligible in his sleep, but John lurched on.<br/><br/>It was late morning, although little more than wisps of light could pierce the deep mist curtains that hid the rest of the city away. John tossed the body into the back of a run-down truck. He spent a couple of seconds looking back at the building before clambering into the driver’s seat and heading off. He was tired of this.<br/><br/>It was several hours before he approached his destination. Two blocks away from the place he was looking for, he was forced to swerve at an intersection as a couple in a battered sports car hurtled through on a red light, sending John and his truck skidding out of control into the side of a grey brick apartment block. He yelled profanities after them, but they were already long gone. Mumbling under his breath, he pushed the airbag down and climbed out to inspect the damage. It wasn’t too bad – it could probably be repaired – but the truck would not be going anywhere for a couple of days. That was unfortunate. He doubted that he had a couple of days. He took the body bag and a steel shovel out of the back, and grudgingly dragged them the final couple of blocks.<br/><br/>There was a park on the banks of the river, beautiful trees dropping autumn leaves which drifted under a large stone bridge. He had always loved this park. It was so peaceful here. He found a quiet corner under a tree, and in the orange light of a setting sun, he began to dig.<br/><br/>He wondered briefly how strange it was that he felt nothing. It was as if he was fulfilling an almost forgotten promise to a friend with whom he’d long since parted company.<br/><br/>The body buried, he turned back toward the road. A woman stood watching, long, wispy grey hair blowing gently in the breeze. He was not surprised. He had been expecting her to be there. “It is difficult,” she said, a small tear glistening in her otherwise lifeless face. He shook his head. “An obligation owed. Nothing more,” he replied.<br/><br/>He took her hand, and the pair walked down the street to the nearby pub. It was deserted, save the sullen barman behind the counter. He gave them little more than a glance as they walked in and seated themselves at the bar. The two sat in silence for quite some time before ordering.<br/><br/>The hours passed by, and the dirty glasses piled up. The pub closed, and the two made their way to the woman’s tiny apartment.<br/><br/>The night blurred into early morning, and John awoke on the kitchen floor. The woman was gone, but empty bottles still lay across the table and floor. Feeling bilious, John staggered out into the street, barely registering that the sun was still not up. His stomach finally giving up the battle, he threw up violently over his pants and shoes. He walked through the doors of the building next door, and passed out in the lobby. He lay there for several hours. Few people walked by, but those that did looked down scornfully, before pretending that they hadn’t seen him.<br/><br/>The grey-haired woman woke him. “Hurry, we need to leave,” she told him. “If we don’t make it in time…” John nodded, understanding. The two climbed into her car and set off.<br/><br/>“We won’t make it in time,” John told her.<br/><br/>“We have to,” the woman replied, pushing down on the accelerator.<br/><br/>They soared out of the city, and up a windy pass. As they left the mountains behind, the clouds opened up, and the mid afternoon sun pummelled down on them. The distant blue of ocean flickered though gaps in the trees as they heedlessly bounced over the cracked asphalt.<br/><br/>Speeding through the narrow streets of the city, the woman rashly cut corners, leapt over sidewalks, and completely ignored the traffic signals, sending more than one car swerving out of her way. She came to a stop in the middle of the street outside a battered old building. The two leapt out of the car, and made their way up the stairs, cursing the elevator which was not working.<br/><br/>Sitting in the chair, John fired up the computer. “Come on, come on,” he mumbled under his breath. The screen lit up, and he began clicking the mouse furiously.<br/><br/>“Will it work?” the grey-haired woman asked.<br/><br/>“I’m not sure. We need more time,” John replied.<br/><br/>“We don’t have time. Will it work?”<br/><br/>“I think so.”<br/><br/>“We need to be certain.” <br/><br/>“Yes. It will work.”<br/><br/>“Thank-you.” She turned made her way to the door. Her hand on the handle, she stopped and turned. “And, John?”<br/><br/>John did not remove his eyes from the screen. “Yes?” he asked, exhausted.<br/><br/>“I’m sorry,” she said as she fired the gun. She scrambled down the stairs, out the door, across the road, hurried across the river at the bridge, and came to a stop on a small hill looking over a quiet corner of the park. There, she stood and waited patiently as an old man slowly filled a grave for a long-forgotten friend.<br/><br/></div>", "published": "2013-02-21T18:40:00+02:00", "updated": "2013-02-22T12:55:36.911000+02:00", "draft": false, "categories": ["fiction"]}