{"id": "on-learning-to-use-technology", "title": "On Learning to Use Technology", "content": "There is so much out there in the way of advanced technology these days. From fancy computer systems to cellphones, smart irrigation systems and intelligent fridges and toilets. I am slowly beginning to realize that the majority of people have no clue how these technologies work, never mind how to use them. Arthur C. Clarke said that \"any sufficiently advanced technology is indistinguishable from magic.\"<div class=\"readmore\"> This is rubbish, obviously, because someone had to develop that technology, and that someone would have needed to understand the workings behind it (presumably). The people who can't tell it is not magic are the ignorant users, who are probably not engineers. I've always wondered how things work, and I've always made an effort to understand every technology I've used, even if it is on a very elementary level.<br/><br/>Technology has replaced so many brains. Apart from the obvious culprit of the internet (which is, of course, always right - even when it contradicts itself), there is another major culprit that is even more widely believed. Most people know it as GPS, a few confuse it with GPRS, and most don't actually know what it stands for. A lot think it stands for Global Positioning Satellite, but these are people who don't think. If that were correct, then those who say they have had GPS installed in their cars are idiots. By definition, a satellite is something in free orbit around the earth. To install a satellite in ones car either means that one has brought down a satellite, or is planning on sending their car (together with this satellite) into space. Actually, GPS refers to any Global Positioning System, but we now use it to refer to those systems that use satellites. The interesting thing about GPS maps is that they only know what they've been told. They don't have a brain to work things out for themselves, ad they don't learn from their mistakes (neither do most people). They know nothing about road closures, and they only know about 90% of roads. I found out recently that even major roads aren't properly recorded on GPS maps.<br/><br/>A woman was looking for a place, which she knew was in Sandton, so she drove to Sandton. Since Sandton, is about 10 km across, and the busiest commercial hub in the country, she landed up driving through rush hour traffic for 40 minutes to get to the centre. She then phoned the place to find out where it actually was. It turns out that it is on the very edge of Sandton. She enters the address into her GPS and is told that it doesn't exist. So she phones the place again and tells them they don't exist, because they aren't on the GPS. This results in a big argument, with one side remaining calm, and the other completely losing their temper. The place she was looking for (a hospital that had occupied that address - which happens to be on a main road - for forty something years) had obviously been using the wrong address since it was built.<br/><br/>People need to remember to use their brains when dealing with technology. The only problem is that remembering that requires the use of a brain, an art which is only carried on by a steadily declining minority.</div>", "published": "2009-02-18T15:28:00.007000+02:00", "updated": "2011-04-07T13:06:10.086000+02:00", "draft": false, "categories": ["technology", "engineering", "incompetence", "tuna"]}