{"id": "on-lost-sandwiches", "title": "On Lost Sandwiches", "content": "The definition of being lost is to not know where you are going. And as far as I know, it is impossible for a sandwich to know something. This means that all sandwiches are lost, even if you know where they are. In order to know something about the future, especially to understand a concept as complex as a destination, requires being able to sense the environment, and adapt to it.<div class=\"readmore\"> This is the basic principle behind any control system. One of the requirements for being lost is to have a destination, but to not know where it is in relation to one's self. Is it possible for the sandwich to feel this way?<br/><br/>In order to be lost, the concept needs two things: the ability to store information in a stable manner and an ability to record its position. At first thought, this seems impossible, but it definitely requires further investigation. Bacteria live on almost everything you can put on a sandwich, which provides the sandwich with some form of (very simple) consciousness. Bacteria are able to pick up small bits of information and store some of it, but I doubt that a single bacterium is able to grasp a concept as advanced as a destination. However, large numbers of bacteria just might be able to. There have been studies into the ability of bacteria to interact and have an \"emergent group consciousness\".<br/><br/>This all means that a sandwich just might be able to have a concept of a destination, and know where it is relative to its destination. The fact remains that it still has no means to propel itself towards that destination, and has to rely on carriers. The sandwich has no means of controlling its carrier’s route (I hope). Unless the primitive minds of sandwiches are a lot smarter than I am (which is a very scary thought), they have no way of working out how to get to their destinations. This amounts to not knowing how to reach the destination, which essentially amounts to the same as being lost.<br/><br/>In conclusion: all sandwiches are always lost, no matter how you look at the situation.<br/><br/></div>", "published": "2009-03-29T13:42:00.005000+02:00", "updated": "2013-01-21T15:47:31.396000+02:00", "draft": false, "categories": ["food"]}