{"id": "on-libraries-part-iii", "title": "On Libraries Part III", "content": "It's not the <a href=\"http://alphanumericsheeppig.blogspot.com/2009/06/on-plagiarism.html\">first time</a> I'm whining about something like this, but a study released last week that found that kids who use more libraries are more likely to read more was all over the news.<div class=\"readmore\"> However, it was actually a mission to track down the actual study (See <a href=\"http://www.literacytrust.org.uk/assets/0000/7424/Public_libraries_literacy_2011.pdf\">Clark, C. and Hawkins, L. (2011). <i>Public Libraries and Literacy</i>, National Literacy Trust, London.</a>) This amused me (as usual) for two reasons.<br/><br/>The first is the obvious one – not so much the “duh!” factor of the study (so much so that I have no idea why it was newsworthy when so much valuable, less obvious research is never heard of in the public domain), but the fact that the main conclusion reported by the news was inconclusive based on the data anyway. While it is possible that using a library may turn a child into an above average reader, I don’t think that this is the case. Personally, I think above average readers are more likely to go to the library.<br/><br/>It’s like saying people who go to Chinese restaurants are more likely to like Chinese food (rather than saying that people who like Chinese food are more likely to go to Chinese restaurants).<br/><br/>The other reason is that this study was so widely mentioned and quoted, yet not even one media report gave the name or the authors of actual report. If I was on Wikipedia, I’d quietly add a <a href=\"http://en.wikipedia.org/wiki/Template:Citation_needed\">{{fact}}</a> tag and move on, but there is no way of doing this in the media. It is amazing though that people take what the media says as (at least probable) truth, but there is so much debate about referenced scientific reports that get published.</div>", "published": "2011-02-07T10:52:00.002000+02:00", "updated": "2011-03-07T13:29:04.333000+02:00", "draft": false, "categories": ["libraries"]}