{"id": "on-little-something-involving-pie", "title": "On a Little Something Involving Pie", "content": "I'm not too sure where I get this stuff... The internet was down for 20 minutes, and I had to keep myself occupied.<div class=\"readmore\"><br/><br/><div style=\"text-indent: 2em;\"><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif; font-size: x-large;\"><i>I</i></span><i style=\"font-family: Times, 'Times New Roman', serif;\">T</i><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\"> was a dark and dreary Thursday morning when the last of the pie slices arrived home. It was raining heavily, and his pastry coat was feeling rather soggy. It would take hours for it all to dry out properly and reach its correct crisp golden brown hue. Careful not to lean out of the small dry nook that the small refrigerated entrance hall formed, he dug in what might have been a pocket of sorts for his keys. Cursing the fact that his pie pockets were filled with a sloppy cinnamon apple chunks in a sticky caramel gravy, he eventually found his keys. Inserting them into the lock and turning them, he quickly glanced back over his crusted shoulder into the dark street behind. Nothing.<br/><br/>Wrapped in the faint atramentous warmth of his box apartment, he turned up the heating element. In the orange incandescence of the oven, One could make out a variety of crumbs, discarded cigarette butts and a single half eaten pizza slice trodden into the aged carpet. Two couldn’t make them out – his eyesight had been severely damaged in a car crash years ago. Three would have been able to make them out quite well, but he’d been dead close on six years.<br/><br/>“Who’s there?” called Two, sitting up alert in his sofa.<br/><br/>The last of the pie slices remained quiet. Skulking slowly across the room, he withdrew an old buckled stainless steel blade. A bald eagle fluttered on the window sill, startling the pie slice. The eagle tried to take flight, instead crashing into the pavement below as its featherless wings failed to make purchase on the thin air. Flapping wildly, it dashed across the lawn, and into a dividing fence. <br/><br/>“God damn it!” screamed Four. “I was half way through disproving rational numbers as a closed number set under the division operation!”<br/><br/>“The fence was skew anyway, Six sat on it far too many times. Now shut up, I’m trying to sleep,” called Two unenthusiastically, before settling back down.<br/><br/>The last of the pie slices stepped on the half eaten pizza slice, his foot suddenly coming into the limited field of vision that One could make out. Slightly hung over, but mostly still drunk, One called out, his words slurring together: “S’at yoo’ Three? S’at the ghost ofa d’parted quant’ty?”<br/><br/>“It was that damn bird,” mumbled Two. “Now shut up, I’m trying to sleep.”<br/><br/>“Nope, t’wasn’t a bird. Looked like... Wheres’a fence?” One asked, and promptly fell asleep. Slowly, the last pie slice slipped back into the shadows, moving around the back of the room. wiping his sticky caramel hand on some upholstery as he went. Swiftly, he guided his pie cutter through One’s throat. Barely a choke escaped before the rich cranberry juice slid across the floor. Pulling out a small pistol, he fired a single shot through the glass door, into Four’s back. And then turned rapidly to fire at Two, but Two was not there. He did not feel the blade of the sword that he could see sticking out of his chest. As his vision began to fade, he was vaguely aware of a calm thud that he could recognise as words, but his ability to comprehend them had already abandoned him. The last thought that crossed his mind was the fatal flaw in his otherwise perfect plan. Two was not completely blind, merely severely visually impaired. Eight’s plot to become the only pie slice had failed.<br/><br/>And with that, the last of the pie slices descended into pie hell, where he would be baked unevenly and at the wrong temperature for the rest of eternity. <br/><br/></span></div></div>", "published": "2011-04-07T12:44:00.001000+02:00", "updated": "2013-02-21T17:18:24.576000+02:00", "draft": false, "categories": ["fiction"]}