{"id": "on-methods-for-concealing-baldness-and", "title": "On Methods for Concealing Baldness and Other Such Nonsense.", "content": "If you are one of those that are still impressed when an advert claims that a certain product is patented or patent pending, with the belief that if it can be patented it must work, I have bad news for you...<div class=\"readmore\">A prime example which most people are familiar with is <a href=\"http://www.google.com/patents?id=H4k5AAAAEBAJ&amp;printsec=abstract&amp;source=gbs_overview_r&amp;cad=0#v=onepage&amp;q&amp;f=false\">US Patent number 4,022,227</a>. If you are bald on top but fortunate enough to have extra length hair around the sides of your head, you could \"conceal\" the bald part by carefully folding your hair over the bald area to conceal it in the classic hairstyle known as the comb over. Everyone (except perhaps those who have a comb over) knows that the comb over is an instant notifier of baldness, and in may cases, looks even worse than if they had just left it. It looks almost as ridiculous as a toupée.<br/><br/>The truth is that anything can be patented, provided that you have the time to write out a well worded patent application, and the money to throw to the patent office. Perhaps more absurd is the inventor <a href=\"http://www.humanai.com/\">Mitchell Kwok</a>, someone with enough spare money to splash out on no fewer than six patent applications for a time machine. His plan is remarkably well thought out. The basic principle came to him while playing <i>Prince of Persia</i> on his PlayStation 2. Whilst playing the game, he came to the realisation that, in the video game world, the rules of time do not apply. He proposes programming human level artificial intelligence, and then letting these AIs loose in a video game environment where they can conduct research and develop an artificial intelligence that is much smarter than a human. He reasons that this would take humans 20 years to complete in the real world, but would take only a second in the video game world (an obvious sign that he has never used a computer to carry out research). It starts with <a href=\"http://www.freepatentsonline.com/20090164397.pdf\">US Patent Application number 2009/0164397</a>, which claims<br/><i><blockquote>\"A method and system for creating exponential human artificial intelligence in robots, as well as enabling a human robot to control a time machine to predict the future accurately and realistically. The invention provides a robot with the ability to accomplish tasks quickly and accurately without using any time. This permits a robot to cure cancer, fight a war, write software, read a book, learn to drive a car, draw a picture or solve a complex math problem in less than one second.\"<br/></blockquote></i><br/>Using this method recursively, he believes that each iteration of the AI will be exponentially smarter, and he will eventually land up with an intelligence thousands of times smarter than a human. He will then ask this AI very nicely to calculate the exact positions and velocities of every single particle on Earth (presumably anything more than Earth would be asking too much), in the past and future with \"pinpoint accuracy\", and store these in a database somewhere (hopefully on the moon to avoid the paradoxes associated with self-containing systems). Following this, some prospective time traveller would be able to go up to some sort of machine and enter some sort of target date and time. Following this, \"atom manipulators\" scattered around the world will set to work and begin to manipulate atoms very quickly into position until the current environment represents that of the target date and time. This whole plan is outlined in <a href=\"http://www.freepatentsonline.com/20090234788.pdf\">US Patent Application number 2009/0234788</a>.<br/><br/>Hey, at first I thought it was too good to be true as well, but then I found out that the idea is patent pending, so it must work.  </div>", "published": "2011-06-01T07:54:00+02:00", "updated": "2011-06-01T07:54:19.617000+02:00", "draft": false, "categories": ["incompetence", "advertising"]}