{"id": "on-microsoft-service-centre", "title": "On the \"Microsoft Service Center\"", "content": "We regularly receive calls from people claiming to be from \"Microsoft Service Center\". Usually, I explain to them that I actually use Linux, and then rant on about how a computer technician should have at least heard of Linux until they hang up. Today, however, I decided to have some fun and see exactly what they wanted. <div class=\"readmore\"> <br/><br/>Turns out, its the stupid stuff. The internet is infected, apparently. Every time I connect, my computer starts downloading special viruses and trojans that can't be detected by normal anti-virus software.<br/><br/>They wanted me to run a command 'eventvwr'. This is just Window's built in system log viewer, and I know that it inevitably lists several errors and warnings. I told them I used Windows 98 on a very old desktop (keyword: \"used\"... a decade or so ago...), and that it was giving an error message telling me that the command was not found. After ten minutes of explaining to the guy that Microsoft made Windows 98 before XP, and that XP was not the first version of Windows, I finally got transferred to Dan, the senior technician.<br/><br/>(On a side note: Dan says that ten or twelve years is not old for a computer. Computers have a lifespan of at least twenty years... Yeah, sure, Dan. Whatever you say.)<br/><br/>Dan spoke nice and slow, so I pretended to type nice and slow too. He sent me to a website, which I did not recognise, so I told him so. Sounding frustrated, he told me that Microsoft has lots of websites and makes lots of products, and that Windows is just one of them, and this was another Microsoft website. I waited a little, and explained how the screen had gone red and said \"This website is not trusted\". He quickly told me to close it, and then slowly spelt out the website for TeamViewer, which is an address I do recognise (after a Google search, I now know that the first site he wanted to send me to was for remote desktop software as well). We waited five minutes while I pretend downloaded it, and apologised for having slow internet.<br/><br/>\"I don't know what it is. It's gotten really slow over the last few months,\" I told him. \"Yes,\" he said. It's the trojan virus slowing it down. It's busy downloading all the other trojans onto your Windows.\"<br/><br/>Eventually I'd finished pretending to download TeamViewer, so he asked me to install it, but I could see where things were going. He wanted remote access to my PC, but I wasn't at my PC, so things were going to reach a stalemate. I decided it was about time for my pretend PC to crash. \"Oh no, your computer hasn't crashed,\" he told me. \"It's the hackers. They've taken control of your computer. Don't panic sir. I'll help you through this.\" Too bad. I panicked. I unplugged the modem on my imaginary desktop so the hackers wouldn't be able to do anything.<br/><br/>This was where the guy began to offer some useful advice. \"We're going to install Microsoft Security Essentials, sir.\" I told him how I already pay a fortune for an anti-virus package. Apparently, that doesn't do anything to stop hackers. But for only R 150, I could purchase Microsoft Security Essentials (which is actually free). All I needed was my credit card number. I could make the purchase right there and then, over the phone.<br/><br/>Credit Card? I used to get lots of calls trying to sell me stuff (they stopped completely when I registered on the Direct Marketing Association's <a href=\"https://www.nationaloptout.co.za\">National Opt Out Database</a> over two years ago), so I know exactly how to stop this. I'm a student, I told him. I don't have a credit card. I do have a card, but it doesn't have an expiry date. It's not a Visa, it's not a Mastercard, and I can't use it to make payments over the phone. Beeep. Beeep Beeep. He'd hung up. Unfortunately. I was really having fun.<br/><br/></div>", "published": "2013-08-29T15:37:00+02:00", "updated": "2013-08-29T15:48:48.604000+02:00", "draft": false, "categories": ["technology"]}