{"id": "on-making-telephone-calls", "title": "On Making Telephone Calls", "content": "I am a little shy in some situations. I have no problem getting up in front of a crowded room and talking, but some things make me extremely nervous. Telephone calls, for example. When receiving them, I have to take a couple of deep breaths to psych myself up before picking up the phone.<div class=\"readmore\"> During the conversation, I'll usually limit myself to yes or no answers, even in cases where it doesn't really answer the question asked. I often find myself saying goodbye prematurely, typically several times before the conversation actually comes to an end.<br/><br/>Far worse than receiving phone calls is making them. In general, I try keep most contact - both business and personal - to emails, texts and instant messaging. On those rare occasions when I receive the dreaded email, \"Please contact me on 012 345-6789\", my pulse starts to rise, and sweat instantly appears in the palms of my hands. After taking several deep breaths, I get up and walk to my phone. After several more deep breaths while just standing there, I go back to my computer, just in case I see a message, \"Never mind, we can sort it out over email\", which I have to date never received. I go back to my phone, sit down and start dialling the number. Before I finish, I cancel the call, and go to the toilet to empty my bladder. When I get back, I check my email again, still hoping for them to change their mind. Finally, I resign to the fact that I'll have to make the call, and just get on with it.<br/><br/>Fortunately, I don't have to do it often. I can get away with making as few as three or four phone calls a year, including calls to my family, girlfriend and friends. Fortunately the age where phone calls are a daily necessity has passed.<br/><br/> </div>", "published": "2011-08-22T07:49:00.002000+02:00", "updated": "2011-08-22T08:10:36.303000+02:00", "draft": false, "categories": ["technology", "awkward situations"]}