{"id": "on-magic-of-unknown", "title": "On the Magic of the Unknown", "content": "It amazes me how so many people still think that technology is magic. Yes, there are robots that (sort of) walk and (sort of) talk like humans. Yes, you can talk to another person on the other side of the world in almost real-time, travel across the world in a day. Not only have people been in space, we have already filled it up with several thousand devices and systems (little more than chunks of metal, really) that we use in our daily life. It is incredible what we have achieved. <div class=\"readmore\"> <br/><br/>I was reminded of all of this when my family was discussing something (I forgot what) at dinner one evening, and my father innocently said \"Well, you can just do an internet and find out?\" Although my first thoughts admittedly involved TomSka's <a href=\"http://www.youtube.com/watch?v=cYNdUM2gRsg\">asdfmovie4</a>, I suddenly realised that my father actually has no idea how the internet works.<br/><br/>Arthur C. Clarke famously said \"any sufficiently advanced technology is indistinguishable from magic.\" I don't like this saying, mainly because I've seen so many people just accept it. That's just a way of admitting defeat, and saying \"I'm never going to understand that\". I am incapable of dropping everything like that. I have to understand everything, even if it is only on some superficial level. It is a compulsive urge. It is what drives me to live. I cannot just accept that I don't know something. Everyone is capable of understanding everything. I firmly believe that this is true. It just takes someone to have the first spark, work out one tiny fraction of reality, and write it all down. After some time, their ideas will spread (ever faster now that we have so much sufficiently advanced technology), and more and more people will begin to understand that tiny bit of reality. Viable alternatives for understanding in each field will arise and the ideas will naturally evolve until one is sufficiently complete and has enough support (from reality itself, not in terms of a fan-base), letting the others fall back to be archived. It is a slow process, no doubt, but it is the only one that can possibly work. <br/><br/>I often look at my dog, who gives the TV barely more than a passing glance, and I wonder what he thinks. He knows that it's not real. I can tell that he understands that they are just projected images. They don't even smell real. He obviously doesn't understand the physics behind it all (or at least, he chooses not to show it), and quite frankly, neither do I. But I do have a vague idea of how the light reflects off of actors and onto a set of photosensitive capacitors, which will hold a minute electric charge if the right amount of light strikes them just right. I understand the basics of how these can be transmitted and stored in various series of copper conductors and silicon semiconductors, and how a series of pre-programmed pulses from a computer system can systematically call each of these charges in order and pass them through an inductor which emits pulses of electromagnetic radiation out into the air several billion times a second, which are in turn picked up by a giant dish floating in space that is drifting at just the right angle to catch them, perform some elementary calculations and then pulse them back down to Earth, where they are reflected through a small coil of copper wire by a small dish on my roof, which emits small electric signals which, after some processing, are passed through tiny cells of liquid, which momentarily crystallise in the presence of an electric field. The light in the room then reflects off the crystals, making it appear as if there is an image on the screen. Complicated, but not magic. <br/><br/>I believe that my dog understands this. I just wish that humans would get over it. The world is even more wonderful when you start to see how things work. And when you harness that understanding, and combine it with your knowledge to create something new, nothing can ever beat that combined feeling of wonder and achievement.<br/><br/></div>", "published": "2012-02-06T16:55:00+02:00", "updated": "2012-02-06T16:55:23.864000+02:00", "draft": false, "categories": ["technology", "awkward situations"]}