{"id": "on-my-13-favourite-pieces-of-metal-music", "title": "On My 13 Favourite Pieces of Metal Music", "content": "The music I listen to falls mainly into the genres of metal and classical music. A while ago, I put together a list of my <a href=\"http://www.alphasheep.co.za/2013/02/favourite-classical-music.html\">13 favourite pieces of classical music</a>, so I decided it was about time to put together a list of my favourite metal music. <div class=\"readmore\">Funnily enough, I find that classical music gets me worked up, and if I want to relax, no other music works quite as well as metal. I'm not very good at having favourites, so I should probably point out that there may be some more deserving songs out there that were accidentally overlooked, and my favourites change from day to day. However, these are the ones that I'd have to consistently include near the top of a list like this, but they are in no particular order. Once again, I have limited myself to one song per artist, and I have not listed songs that have made lists on this blog before.<br/><br/><br/><span style=\"font-size: large;\">    <b>1. <a href=\"https://www.youtube.com/watch?v=xpUtyrRaS1Q\">Moonsorrow - <i>Raunioilla</i></a></b></span><br/><br/>Moonsorrow is my all-purpose music. No matter what mood I'm in, I'm in the mood for Moonsorrow. It's my first choice when I have to concentrate on work, or when I want to sit back and relax, or when I'm stressed, or sad, or really happy. <br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/xpUtyrRaS1Q\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>2. <a href=\"https://www.youtube.com/watch?v=cDe0cXJc-kw\">Rhapsody of Fire - <i>Queen of the Dark Horizons</i></a></b></span><br/><br/>Rhapsody of Fire's album <i>Rain of a Thousand Flames</i> is considered a filler album, as it only plays a small side role in the epic story they tell through their music. Still, it contains some of their best work, and <i>Queen of the Dark Horizons</i> is easily my favourite song of theirs. It is a perfect mix of symphonic and power metal, and I love every second of its 13 and a half minutes.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/cDe0cXJc-kw\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>3. <a href=\"https://www.youtube.com/watch?v=yk9AXC31V3o\">Cradle of Filth - <i>Nymphetamine (Fix)</i></a></b></span><br/><br/>My brother went through a phase where he listened to nothing but Cradle of Filth. Musically, I think they are brilliant, but I never liked Dani Filth's screaming. With exposure though, I did grow accustomed to it eventually. The one song that stood out was <i>Nymphetamine</i> (perhaps because Liv Kristine sings a large portion of the song), from the album of the same name. The song appears twice on the album, but the first version (the overdose) has a mismatched intro and outro which just don't fit in with the rest of the song. For that reason, I prefer just the fix.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/yk9AXC31V3o\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>4. <a href=\"https://www.youtube.com/watch?v=TR8d_TVKJ24\">Deathstars - <i>Razor End</i></a></b></span><br/><br/>While I had heard a little of the Deathstars' music before I met my girlfriend, I had never heard <i>Razor End</i>. We'd been dating for just a couple of weeks when she had my taste in music completely figured out. She burned me a CD, which had this song on. It's a pity it's not on any Deathstars album, because I feel it's easily their best work. Four and a half years later, it was still one of the easiest songs to choose when I started putting together this list.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/TR8d_TVKJ24\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>5. <a href=\"https://www.youtube.com/watch?v=jF9klwct9_0\">Anathema - <i>Eternity, Part I</i></a></b></span><br/><br/>I've always had a taste for depressing doom metal, and that's what led me to Anathema. I enjoy almost all of Anathema's music, from their work in the early 90's, up to their latest albums. Listening to all of their albums in order and hearing the progression in style from doom metal to through to alternative rock is a fascinating experience in itself. <i>Eternity, Part I</i> is the first of three parts, and is written in a rather heavy doom metal style. The second part is a soft instrumental piece, and the third part closes off the first with a more progressive style, and cleaner vocals. I encourage you to listen to all three parts, but the first is definitely my favourite.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/jF9klwct9_0\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>6. <a href=\"https://www.youtube.com/watch?v=cNhvGmW4q_w\">In Flames - <i>Come Clarity</i></a></b></span><br/><br/>In Flames is a band I have mixed feelings about. There are many of their songs that I thoughroughly enjoy, and then there are others that I cannot stand. <i>Come Clarity</i> is one of their softer songs, and I'm not sure what it is about the song that makes me love it so much.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/cNhvGmW4q_w\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>7. <a href=\"https://www.youtube.com/watch?v=pxMkIm5JxkM\">Wintersun - <i>Death and the Healing</i></a></b></span><br/><br/>There are a couple songs from Wintersun which were strong contenders for this list. <i>Beautiful Death</i> was probably at the top, but it has already been listed on this blog as part of the <a href=\"http://www.alphasheep.co.za/2011/10/on-end-of-world-part-ii.html\">soundtrack for the end of the world</a>. Instead, I chose <i>Death and the Healing</i>. The slower pace and clean vocals make the song really stand out from the melodic black metal that makes up the rest of the album.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/pxMkIm5JxkM\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>8. <a href=\"http://www.youtube.com/watch?v=PtiW6TgzhDA\">Metallica - <i>No Leaf Clover</i></a></b></span><br/><br/>When Metallica reached 30 years old, I compiled a list of my 30 favourite Metallica songs. Of them, 27 were released in the first 15 years of their career, and only 3 in the second 15 years. Also, I really don't like live music. It's rather funny then that my absolute favourite Metallica song was only released in the band's 19th year, and only ever as a live recording. I think it has something to do with the symphonic elements. I just wish there was a studio recording of the song.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/PtiW6TgzhDA\" width=\"560\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>9. <a href=\"http://www.youtube.com/watch?v=yuhEDECXOhE\">Nightwish - <i>Phantom of the Opera</i></a></b></span><br/><br/>For a long time, Nightwish was my favourite band. For the last few years, however, there just seems to be something missing from their music (I wonder what it could be?) Even though it's not an original song, <i>Phantom of the Opera</i> seems to epitomise everything I loved about the band when they were at the peak of their career.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/yuhEDECXOhE\" width=\"560\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>10. <a href=\"http://www.youtube.com/watch?v=UigqgJ6cMJE\">Lordi - <i>It Snows in Hell</i></a></b></span><br/><br/>The piano intro to this song is really simple to pick up and play, and really catchy, and I'm constantly getting the chorus stuck in my head. There's also something about the guitar solo that makes me think of a lazy Sunday afternoon. <br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/UigqgJ6cMJE\" width=\"420\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>11. <a href=\"http://www.youtube.com/watch?v=yCUx5WKIZ1E\">Bathory - <i>The Lake</i></a></b></span><br/><br/>Although the album <i>Blood on Ice</i> was written in the late 80's, it wasn't released because the band were worried that it was too different to any of their other music. At the time, Bathory was known for their fast-paced black metal. Through the first half of the 90's, they changed their style, and began to define the Viking metal genre. In 1996, the band finally decided that they were ready to releace <i>Blood on Ice</i>. <i>The Lake</i> was the first song on the album that I heard, and remains my favourite to this day.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/yCUx5WKIZ1E\" width=\"560\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>12. <a href=\"http://www.youtube.com/watch?v=wvIW2dVv8GU\">Therion - <i>To Mega Therion</i></a></b></span><br/><br/>Therion is the metal band that has experimented (mostly successfully) with more styles than any other band I have heard. <i>To Mega Therion</i> is from their album <i>Theli</i>, which was the first album to drop their death metal roots entirely. <i>To Mega Therion</i> features a full orchestra and choir, interspersed with raspy male vocals and catchy guitar and keyboard solos.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/wvIW2dVv8GU\" width=\"560\"></iframe><br/><br/><br/><span style=\"font-size: large;\">    <b>13. <a href=\"http://www.youtube.com/watch?v=LWpwC1p-Ilw\">Green Carnation - <i>Light of Day, Day of Darkness</i></a></b></span><br/><br/>Yes, this song (if it can be called that) is just over an hour long. When I first heard about it, I expected it to be drawn out and repetitive, but it is far from it. The style and tempo of the music varies throughout the song, so that it easily maintains my interest for the full hour. I once heard a shortened version in which the song had been cut to ten minutes, and even though the editing had been done extremely well, and the transitions fitted in perfectly, I found that the song was seriously lacking. The full hour needs to be heard in one go. In my opinion, not a single second can be cut out.<br/><br/><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/LWpwC1p-Ilw\" width=\"420\"></iframe><br/><br/><br/><i>Legal notice: I obviously don't claim to own any of the songs or videos in this post. Copyrights belong to the respective publishers.</i><br/><br/></div>", "published": "2014-09-02T21:25:00+02:00", "updated": "2014-09-02T21:25:27.627000+02:00", "draft": false, "categories": ["music"]}