{"id": "on-modern-medicine-and-measurement-of", "title": "On Modern Medicine and the Measurement of Sound", "content": "For my entire life, I have been partially deaf, and since the age of nine, I have been completely deaf on my right hand side. However, I have never really understood why. All I knew was that it was caused by a recurring Cholesteatoma, what ever that is.<div class=\"readmore\"> Last time I went to the doctor, he asked if I'd ever looked it up. He was surprised when I told him I hadn't. Today, I looked it up on Wikipedia, which tells me that \"Cholesteatoma is a destructive and expanding keratinizing squamous epithelium in the middle ear and/or mastoid process.\"<br/>Yeah sure... that really explains it.<br/><br/>What I did learn is that I suffer from tinnitus, which is a common condition caused by various inner and middle ear problems. Basically it means I have sound hallucinations. I hear people talking when there's no-one there, and songs when they aren't playing. And a constant beeping. This plays hell in hearing tests. \"When you hear the beep, press the button.\" the tester tells me. I nod. I hear a beep, and so I press the button. \"Only press it when you hear a beep.\" comes the testers voice again. The problem is that when there is a beep, which anyone should be able to hear, I can't hear it. Is a hearing test a valid medical test if it doesn't work for people like me? Last time I went through it, the audiologist told me that I had the minimum possible score. if I had any lower, they would have thrown the test results away. Bearing in mind that I might have been imagining beeps when the machine really was beeping below the limits of my hearing, one has to admit that the test results should have been thrown away anyway.<br/><br/>(On a side note, the beeping used to give me panic attacks when I was a child. In the test, the beep stops the moment you press the button. Lying in bed at night, the beeping would start, and I'd begin frantically pressing an imaginary button to get the noise to stop.)<br/><br/>(On another side note, a study suggested that 93% of tinnitus free people will experience a perception of beeping, whistling, buzzing or pulsing when placed in an anechoic chamber - which is exactly where they place you to perform a hearing test. Did they know that when they developed the test?)<br/><br/>Apart from that, the unit used to measure sound levels is the decibel, which is the logarithm of the ratio of power transmitted in a sound to the power carried by a sound that is at the limit of human hearing, divided by 10. In other words, it uses the limit of human hearing as a datum. Since everone's limit is different, how does this work. It is an arbitrary datum, so how can it be scientifically acceptable. Scientists are weird.<br/><br/>From an engineering point of veiw, my hearing loss is very useful. It is about 85 dB in my right ear, which is exactly the maximum noise level allowable by the Occupational Health and Safety Act. Above this, one is required to use earplugs, or permanent ear damage may result. By simply blocking my left ear, I have a perfectly reliable test to see whether or not earplugs are required by the Act. A useless super power, but it's better than nothing.<br/><br/>(Sorry, I like side notes. Here's another one. I went through most of school and university telling people that my deafness was due to a tumour. Apparently I was wrong: \"The status of cholesteatomas as tumors is currently unresolved. There is some evidence to support the hypothesis that cholesteatomas are low-grade tumors however, recent studies have failed to show consistent DNA instability in cholesteatomas (as a tumour would).\" Source: Desloge RB, et. al. <i>DNA analysis of human cholesteatomas</i>. Am J Otol 18 (2), 1997: pp 155–9)<br/><br/></div>", "published": "2009-01-17T20:35:00.002000+02:00", "updated": "2013-01-21T15:48:05.768000+02:00", "draft": false, "categories": ["technology", "medicine", "sound"]}