{"id": "on-my-neon-coloured-inflatable-safety", "title": "On My Neon Coloured Inflatable Safety Device", "content": "I carry my lunch in a neon green cooler bag (or a neon orange one, if I forget the green one in my desk drawer the day before). When people ask, I tell them that it is an inflatable safety device in case I fall into a lake. <div class=\"readmore\">The real reason is simpler, but the full story is rather long-winded. I will give it a try, nonetheless.<br/><br/>All through school and for my undergraduate years at university, I carried only one bag around with me with all of my books as well as my lunch and juice. In high school, the sheer size of my bag earned me a bit of a reputation. Most people packed their bags in the morning or the night before, and only packed the books that they needed for that day. I was never the sort to be able to get into a routine (never mind have to work out what day it is, every single day), and after several occasions where I went to school taking books packed for the wrong day, I decided that such a system could never work. Instead, I adjusted the system to use terms instead of days. This way, I only needed to pack my bag with all of the books I would need in the next three months, and only needed to remember to do so every three months. (And although I often have difficult remembering what day yesterday was, I usually find it easier to remember which term the last one was (since three months does give it time to sink into my long term memory).)<br/><br/>However, at university, the books grew bigger, the distances between classes grew further, I grew lazier, and large bags grew more expensive. It did not take long for the immense compressive forces inside my bag to cause a bottle of grape juice to pop its lid – an accident which left my unfortunate chemistry textbook permanently disfigured (and stained pink, which I’m sure is the source of much teasing from the other books). Thanks to this (and one or two other close calls), I learned to leave my text books at home, and take only a notepad and some pencils with me to lectures, and then empty the previous days notes out when I got home. That way, I would lose at most one day’s work in case of a catastrophic leak. Unfortunately, by third year (which I reached in five years, due to my inability to decide what I what I want to be if I eventually grow up), I began to carry my laptop with me to classes, and still used only one bag. (Actually two on some days, because of the immense number of reference material that my aircraft design lecturer insisted we had with us all the time, but there was no way I was going to risk damaging the thousand odd pages of charts and tables and diagrams, so my laptop and lunch remained in one bag.)<br/><br/>(On a side note, when I did carry two bags, I had to tie them together. The awkwardness of having a piece of string to deal with every time you moved or pick up the bags was far preferable to realising that you had forgotten one bag somewhere several hours previously.) <br/><br/>I was very careful, and for almost one and a half years my laptop survived sharing a bag with not just one juice bottle, but a half litre water bottle as well. However, one day (19 January 2010, before 11:24 am, judging by my facebook status update regarding the event), The water bottle, apparently jealous of the bag being dry inside, decided that the bag should carry half the water as well. I pulled out my sopping wet laptop, pulled out the keys and patted it down with toilet paper. (Very bad idea. It sticks to everything when it gets wet, and it turns out that removing the bits of toilet paper is a real mission.) Fortunately, the laptop made it through with absolutely no damage (apart from toilet paper stuck to the backs of one or two keys). <br/><br/>From that day onwards, I have been carrying my juice and water bottles in a nice black cooler bag that my father once got for free at some company function.<br/><br/>Oh... wait. That explains the black cooler bag, and not the neon green one, doesn’t it? I started carrying the neon green one several months before the laptop-water incident because the large bowls of leftovers that I regularly take for lunch don’t fit in the bag with my laptop, didn’t I? Ah, apparently it's not so long-winded after all.  </div>", "published": "2011-05-16T07:13:00.001000+02:00", "updated": "2011-05-16T10:27:29.575000+02:00", "draft": false, "categories": ["food"]}