{"id": "on-next-week-tuesday", "title": "On Next Week Tuesday", "content": "It is widely believed that the seasons are centred about their corresponding equinoxes and solstices, and that the seasons are each roughly three months long - September means spring, December means midsummer, March means autumn, and June means midwinter (or cycle each month two seasons to the right if you live on the wrong side of the world). Some cultures believe the other extreme - that the solstices and equinoxes mark the separation of the seasons. I disagree with both, simply because of this idea of having well defined seasons is stupid.<div class=\"readmore\"> <br/><br/>Even though the winter solstice is hitting next week Tuesday (somewhere around quarter past seven in the evening), we are only just starting winter. Excluding the repeated buffeting from severe cold fronts, the weather has actually been warm enough to wander around with just a jeans and a T-shirt during the day. Each and every year, the real cold, where even the sun has no warmth, comes during July and August. It amazes me how people fail to notice this every year. <br/><br/>(On a side note, it is a common misconception that the solstices arrive on the same day each year. This is not true at all. In reality, it varies from year to year as the Earth follows its elliptical orbit, and its axial tilt does not change as the orbit moves around the sun. For example, the solstices this year are 20 March, 21 June, 23 September and 22 December (UTC), but next year they will fall on 20 March, 20 June, 22 September and 21 December (UTC, of course))<br/><br/>As with this idea that rain in June being \"unseasonal and unusual\" - it is actually rather common, and happens at least one, if not two, out of three years. Cold fronts almost always carry a bit of rain with them. Around the end of May or beginning of June, the cold fronts are pushed far enough North, and bring a day or two of rains, and another half a week of icy weather and wind. It is just as bad as those who believe that September brings rain, when really, more often than not, the first spring rains only fall somewhere around the end of October (which I <a href=\"http://www.alphasheep.co.za/2010/09/on-shiny-silver-flying-pizza.html\">wrote about before</a>).<br/><br/>The best way to work out the seasons is by using nature, rather than just forcing on arbitrarily defined definitions. In Johannesburg in particular, you know Autumn has started when the majority of trees start losing their leaves (usually late April, early May); winter has started when the sun has no warmth on a clear day (around mid June); spring starts when the trees start shooting their leaves (mid September); and summer starts when the sun is hot enough to burn the grass (late October), but there is a fuzziness of some sort for two to three weeks which make up the transition periods in between, and these can  move forward or backward by up to a month from year to year... <br/><br/>When I was 11 or so, I spent a lot of time developing a complex system of sixteen seasons, in which every sort of weather pattern was accounted for. In the end, I had to discard the whole idea on account of the fact that it did not resemble reality at all - something which most others unfortunately seem rather reluctant to do.<br/><br/><i>[Editor's note: Apologies for the rather late post due to technical errors - in this case a rather unfortunate configuration of synapses which have a tendency to fire electrical signals in such a way that it has lead to a case of chronic procrastination, even of tasks that themselves were originally meant as a form of procrastination. When you start putting off your procrastination until next week, you are most certainly in trouble. In return a long and boring post - 20 June 2011, 9:26 AM]</i><br/><br/></div>", "published": "2011-06-13T15:33:00.014000+02:00", "updated": "2012-06-21T07:23:15.839000+02:00", "draft": false, "categories": ["incompetence", "annoying things", "weather"]}