{"id": "on-nanowrimo-part-ii-on-barghest", "title": "On NaNoWriMo Part II: On Barghest", "content": "which, as those of you who followed my progress would have seen, was more or less unsuccessful. To be a little more precise, I spent 73% of the month not writing at all, 7% writing hardly anything, and 20% writing a little.<div class=\"readmore\"> However, during the month of November, I did submit my first scientific paper for publishing, gave my first presentation to an audience outside of my own university, and did more travelling than any other month in my life. Anyway, here are the 11 or so pages of novel that I did manage to write. (Please excuse any grammatical errors. Proof reading is the reader's job)<br/><br/><br/><br/><div style=\"text-indent: 2em;\"><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif; font-size: x-large;\"><i>S</i></span><i style=\"font-family: Times, 'Times New Roman', serif;\">TUMBLING</i><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\"> over rocks, and massive chips of broken concrete alike, carefully dodging the rust-red twisted steel rods dull grey-white window frames, five-year-old Ashley made his way over to the whines of the dull dark brown lump of fur sticking out from the crumbling remains of what was once a monumental archway. He was not worried about the beads of shattered glass that covered the landscape – decades of rain, snow, hail and sandstorms had worn them into smooth, transparent beads. Anyway, if he did encounter the occasional sharp edge, his short childhood spent crawling over the ruined concrete landscape had made the skin of his feet, palms and knees almost impenetrable to all but the sharp metal edges that had somehow remained hidden from the weather.<br/><br/>The lump half squealed, half growled as he came close. Ashley stopped, instinctively understanding the warning. He pricked his ears carefully listening for any movement. There was no sound, not even a slight whistle of a breeze through the few steel and concrete pillars that still stood. Still not convinced he was alone, Ashley waited.<br/><br/></span></div><div style=\"text-align: center;\"><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\">*****</span></div><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\"><br/>Watching the boy from under a twisted steel frame, a dark shape also waited. Absolutely silent, it’s dull camouflaged fur rendering it almost invisible amongst the twilight shadows. Every now and then the dying light of the distant red sun faded reflected off a drop of saliva dangling from the corner of its mouth, but these were indistinguishable from the occasional glint of a glass bead that had remained somehow unscratched after so many years. As Ashley slowly began to move forward, the shape began to follow, slowly stalking ever so quietly. The light shimmered as it ran over its mottled coat.<br/><br/></span><br/><div style=\"text-align: center;\"><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\">*****</span></div><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\"><br/>Ashley studied the archway. As far as he could tell, it was some sort of bridge, although why it was made of concrete and steel, as opposed to the wooden bridges he was used to, was beyond him. No wonder it had fallen over, he thought. Wood is so much lighter. Anyway, what was a bridge doing here? There was no river. It was puzzling, but Ashley passed it over. The lump underneath it was far more interesting.<br/><br/>After reaching the bridge, he knelt down. The thing wasn’t stuc<br/>k, as he’d initially thought, and it pulled back further into its hollow. It was filthy, and it was difficult to tell the true colour of its fur through the dust and mud that caked it. Behind it lay scatterings of dried grass and leaves, old clothing and torn fur of various small animals. Here and there a broken piece of bone or smashed in skull lay, showing obvious signs of frequent gnawing. It was half as big as Ashley, but Ashley was stubborn and too young to be afraid. He lunged forward and grabbed the creature by the ears and pulled hard. The animal snapped, its jaws closing around Ashley’s forearm, but it had neither the strength nor the position advantage that would be enough to do any more than skin damage. It hurt, but Ashley had all the stubbornness of a five-year-old on his side, and his grip on the creature’s ears only tightened. He pulled hard, trying to wrestle the creature out of the cave, but the creature refused to budge.<br/><br/></span><br/><div style=\"text-align: center;\"><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\">*****</span></div><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\"><br/>The dark shape rose up barely metres behind Ashley, the thick fur on its back puffing out. A deep thunderous rumble came from deep within its chest. Ashley ignored it, intent on getting his newfound toy out of its hiding place. The shape growled again, this time a deep thunderous roar. Ashley heard and knew immediately what it meant. His heart leapt. He slowly loosened his grip on the ears and turned to face the monster behind him. He tried to back away, but trying to turn with a set of jaws holding his arm in place had gotten him into a rather awkward position. He fell into a twisted sitting position.<br/><br/>The creature was massive, with thick black and grey mottled fur, and shaggy triangular ears, pricked up at the roots but hung along its face. Little of its body was visible, but Ashley could see two columns of blood red eyes run up the sides of its long snout, and its jaw was slightly open, baring two rows of jagged teeth. As the growl ended, and a damp patch marked the spot where Ashley sat, the creature lunged for Ashley’s throat. A shrill whistle pierced the air, and the beast froze, it’s teeth inches from the skin on Ashley’s neck.<br/><br/><div style=\"text-align: center;\">*****</div><br/>The woman seemed to appear out of thin air. She wore a cloak which matched the colour of the beast. It was wrapped tightly around her, so he could make out little except her dark brown hair and green eyes. He did not know where she had come from, but he was more concerned about the uncomfortable heat.<br/><br/>“Cŵn, down. Gwyllgi, come here.” She ordered in a neutral tone. The big beast in front of Ashley lowered its head to the ground. A low rumble still echoed from deep inside its throat. He felt the teeth on his arm (nearly forgotten by now) loosen, and the smaller brown creature backed away from him slowly.<br/><br/>“Gwyllgi, I said come here.” The woman repeated. A small whimper came from the animal.<br/><br/>“Gwyllgi ...” she repeated, her voice rising very slightly, with a clear implication of a final warning coming through. The dull brown lump of fur half ran, half stumbled out of the cave, passed the larger beast, and up the concrete hill where the woman stood, tripping over it’s too short legs and long ears as it went.<br/><br/>“Good boy”, she said, holding out a small strip of something she took from her cloak. The lump of fur lunged for it, but she moved it out of the way at the last instant, causing the poor creature to fall onto its back, rolling several metres away before coming to a stop against an asphalt slab, its legs splayed in extremely awkward looking position. The woman scowled, and firmly told the creature “No”, but offered the strip again. It slowly stood, giving a sulking look in its eyes. “Slowly now.” Never removing its eyes from the strip, it walked toward her, slightly more steadily than before, but still stumbling. “Gently.” The creature took the strip carefully in its jaws and moved away slowly. As soon as it was out of reach, it began thrashing its head from side to side, viciously growling, its body writhing violently. With its claws, it began scratching at the strip, ripping it apart, gnawing constantly with its teeth, but struggling to keep a grip. In its effort, it had forgotten to keep its footing on the unstable ground, and went tumbling around as before, dropping the strip in the way. It scrambled over to the strip, and resumed its mauling.<br/><br/>The woman let of a sigh, shaking her head in disappointment. Turning to Ashley, who was still frozen with fear, she said “Come, let’s get you cleaned up.” Ashley’s cheeks went red with embarrassment as he was reminded of the damp feeling along his legs. He glanced nervously at the massive black-grey beast in front of him, which was still growling softly.<br/><br/>“Cŵn!” she shouted. The beast rose and approached the woman, and for the first time, Ashley could see its distinct dog-like appearance and character. The beast’s shoulder stood at least as high as those of the woman, and through its thick wiry coat of fur, it was still possible to make out it’s slender but muscular build. Its head was medium length, and much softer looking than it had appeared when it had been about to close its teeth around Ashley’s throat. Its eyes were blood red, and stood in columns, five on each side. The head looked abnormally small, compared to the beast’s long thick neck, which it held upright. Its long tail wagged furiously as the woman began to scratch the beast’s shoulders. It lowered itself to ground, and she climbed onto its back.<br/><br/>“Well? Aren’t you coming?” she asked Ashley. Ashley stared in amazement, too dumbfounded to say anything.<br/><br/>“Suit yourself,” the woman told him. “You two had better get home soon. Darkness is approaching faster.” Even before she finished speaking, the beast started moving away. She gave it two quick pats on its side, and it broke into a sprint, accelerating at an incredible rate, so that before long, it was running faster than anything Ashley had ever imagined. Within a few seconds, the pair had disappeared from sight.<br/><br/>The sun was setting fast, and he wanted to get home. The problem, which he wouldn’t have mentioned even if he hadn’t been too terrified to speak, was that he didn’t actually know which direction home was. He sat down and began to cry. A tugging at his arm caught his attention. He’d somehow forgotten about the smaller creature.<br/><br/>“You got left behind too, huh?” he said through his tears. The lump of fur bared its teeth and growled. The sun had disappeared completely now, and the residual red glow was the only light that remained. In the darkness, the creature’s ten fiery eyes gave off a very faint light. Looking into them made Ashley feel very uneasy, but he tried to ignore it. He looked back into the concrete cave. It looked comfortable enough – much better than the prickly dead bush he’d used for shelter the previous night, at least. The creature next to him growled again, louder this time. It snapped its jaws and pounced on Ashley, growling and snapping its jaws in his face. If Ashley hadn’t emptied his bladder just minutes earlier, he would have done so now.<br/><br/>A shrill shriek pulsed from somewhere far away, approaching rapidly. It echoed off the concrete and asphalt canyons, shaking the dust off the ground. On the eastern horizon, a dim flaming light appeared, approaching fast. Ashley held his breath, lay flat on his back, as still as he possibly could, closed his eyes and wished his heart would stop beating so loudly. He knew what the light meant, and while he wasn’t actually afraid of it, he knew that it must not see him, must not hear him either. He had seen what it could do, once.<br/><br/>It was over a minute before the light became more than just a pin point on the horizon. It covered the sky in an odd sweeping pattern, arcing up to a high altitude, then turning back down to the ground with an enormous acceleration, letting off the tremendous shriek as it did so, missing the ground by metres, and then slowing down to the top of the next arc. The trajectory reminded Ashley a lot of a game they used to play, where they had slid stones down a pipe that had been cracked in half down its length, the way the stone had swung from side to side like a pendulum, but still rushed down to the bottom of the pipe. <br/><br/>As it approached, the dust around him began to be stirred into frenzy, lifting up and swarming around. Concrete and asphalt chips started to lift off the ground, and gradually, larger and larger chunks and steel started to lift and swirl around in the air. Even though the creature on his chest seemed to be almost weightless, it was enough to pin Ashley firmly to the ground. He couldn’t hold his breath any longer. Taking in a brief, dust filled breath; he spluttered and coughed, struggling for air. The shriek stopped instantly.<br/><br/>Within seconds the light had swooped toward him, letting off a deafening whump as it passed just metres above him. The creature on his chest spun around and leapt, snapping for the light, but fell far short. Ashley felt a tremendous upward pull as the creature jumped off, and as it landed, it smashed him back into the ground. He bit his tongue as his head hit the ground. He trembled, his heart beating rapidly and irregularly, gasping for air, still battling to get enough through, the thick dusty storm around him scratching at his throat.<br/><br/>The image of the light was burned into his eyes. It was difficult to make out the exact shape with the flames that engulfed the creature and the turbulent cloud of dust and smoke that followed it, but he had not missed the enormous talons or the burning feather covered wings that blotted out most of the sky.<br/><br/>The phoenix arced up and turned again, swinging back down with its deafening shriek. Concrete chunks in its path shattered into dust as it passed, adding to its trailing wake. It thrust its talons forward, preparing to strike. Ashley tried to scramble out of the way, but the creature on top of him held him firmly in place. He tried squirming, trying desperately to get out from under the furry animal, but despite seeming to weigh nothing, it was far too strong. Ashley shut his eyes and waited to die.<br/><br/>A frightening sensation that felt exactly as if he had been dropped upwards made him open his eyes. The furry animal leapt through the air, mouth open, and caught the phoenix around the throat. Although it was so much smaller with week jaws and blunt teeth, the animal managed to get a grip on the bird’s neck. The bird twisted around in pain, its formerly regular path becoming very erratic, thrashing itself from side to side. Ashley became caught in its spiralling wake of dust and debris. The creature broke free of the phoenix’s neck, taking a chunk of flesh with it. Flames spouted out from the bird’s wound. It made a sharp turn in mid air, sending Ashley flying through the air. Fortunately, he did not have far to fall, but he slid across the ground, tearing this clothes and grazing his skin. A flying block of asphalt hit him in the head, and he passed out.<br/><br/>The bird aimed at the animal, now crouched waiting on the ground. As the bird approached, the animal jumped, sinking it’s fangs in exactly where the flesh was already torn. Flames streamed from the side of the phoenix, and the pair went crashing into the side of a concrete pillar. An inferno burst forth, engulfing both the bird and animal in a furious orange fire. <br/><br/><div style=\"text-align: center;\">*****</div><br/>The splashing of morning rain on his face brought Ashley into consciousness. In front of him, five pairs of burning eyes watched him from under thick matted filthy fur. Ashley sat up. It was the first time that he had time to look at the animal closely. Its fur was a rich black colour, but was caked with mud, making it appear brown. The rain was slowly loosening the chunks of the mud. Ashley reached out to rub it off. The creature lowered its head and growled, baring its small teeth, but did not back away. The creature was chubby with loose skin, and had an abnormally large head with long floppy ears and a large square jaw surrounded by droopy oversized cheeks. A droplet of drool swung precariously from its mouth. It had seemed vicious in the hollow which Ashley had assumed to be the creatures nest, but now, apart from its demonic eyes, it looked harmless – pathetic, even.<br/><br/>“It seems you two have made friends,” came the voice of the woman from the evening before. Ashley looked past the creature to see her sitting next to a fire, with a fat rabbit busy roasting. The mottled grey beast lay next to her. She sat in silence for several minutes before speaking again.<br/><br/>“His name is Gwyllgi. He’s a barghest,” she said suddenly. Ashley looked up. “I have been trying to train him for the past three days. He seems to prefer solitude though. I reckon he’s about four weeks old now.” <br/><br/>Ashley looked up at her, not sure what to say.<br/><br/>“He likes you. If he chooses to stay with you, you should look after him. He will look after you if you do. Treat him badly, and you will be dead.” She turned the rabbit over on the fire, and stared into the flames. The silence made Ashley feel very uncomfortable.<br/><br/>Eventually he blurted out “My name’s Ashley.” He was not sure why he had said that, and felt like an idiot when the woman ignored him. “What’s your name?” She ignored him again, her attention lost in the flames.<br/><br/>After a while, she took the rabbit off the fire and gave some to Ashley. He had not realised how hungry he was, and devoured it quickly. When he looked up, the woman was already finished and kicking dust over the fire, extinguishing the flames. When the fire was out, she used her foot to move the dust out the way, and a single mottled egg lay in the centre. She picked it up in her gloved hand and held it out for Ashley to take. He was hesitant.<br/><br/>“Don’t worry, it’s not hot,” she told him. Carefully, he took it from her. It was warm to the touch, but it did not burn him. “It’s a phoenix egg,” she told him. “I don’t know where it came from, but we should be weary of whatever killed it.”<br/><br/>“He did it,” Ashley told her.<br/><br/>She looked at him, puzzled. “Gwyllgi? He couldn’t have. He’s nowhere near strong enough. You’ve been hit too hard on the head.”<br/><br/>She sniffed the air. “You smell,” she told him. “Come, let’s get you cleaned up. Whatever took down the phoenix could still be around. Cŵn!”<br/><br/>The mottled grey beast came over and lay down in front of her. She picked Ashley up and put her on its back and climbed on behind him. “Hold on tight,” she said, and whispered something unintelligible to Cŵn, who made a sharp right turn and began to gallop.<br/><br/>The noise of the wind was unbearable, but Ashley fought the unbearable urge to let go and cover his ears. Soon, however, the noise was replaced with a loud ringing in his ears, together with the gentle rain and the soft but steady thumping of Cŵn’s padded feet on the hard uneven ground. Ashley tried to tell her she had forgotten Gwyllgi again, but no sound came out of his mouth.<br/><br/>It wasn’t long before the ruins of the concrete bridge were no longer visible, and soon, they were out of the long dead city and running amongst scattered ruins of much smaller, more scattered buildings. Dead brown grass covered most open areas, but every now and then an oasis of green burst through. Gradually, the ruins became more and more scattered, although they never disappeared completely. Ashley new that it was impossible to escape the old world, although in his imagination, he always believed there were places that had been untouched by man or animal, where he could just be left in peace.<br/><br/><div style=\"text-align: center;\">*****</div><br/>Crouching low and absolutely still in the long but dead grass, Sen watched his prey grazing at the oasis. It was an abnormally large herd of bluebacks –small, long-legged, deer-like reptiles that stood about knee high. They were mostly a greyish-brown colour, with a much richer and darker grey patch over their backs. They skittered and jumped around nervously, watching both land and sky, weary of predators. Seeing them this far from the mountains had once been very rare, but was becoming increasingly common as the northern tribes were pushed down by the uninhabitable tundra that grew more and more with each passing winter. Sen couldn’t help wondering what would happen once the northern tribes were forced over the mountains into the city ruins below. Then where would the bluebacks go.<br/><br/>Ever so silently, he raised his weapon – a heavily modified long bow which used a combination of an electric motor and a complicated lever system to pull the string far tighter than he would be able to on his own. He held it horizontal so as to remain hidden. Even though bluebacks did not have exceptionally remarkable eyesight, they were especially sensitive to movements and were timid enough to bolt at the first sign of danger. From his back, he carefully unclipped his arrow from his back. It was a thin rusted steel rod, salvaged from one of the thousands of collapsed buildings that scattered the ruins of the city. One end had been carefully sharpened and half a feather had been attached two thirds of the way down its length. It was not particularly accurate as far as missiles went, and its range was actually rather pathetic, but its weight meant that it had the momentum to go through the thick scales that covered a bluebacks skin.<br/><br/>Taking a deep breath, and took aim. His bow had an automated radar adjusted directional thermal sensor which pointed directly where the arrow was expected to hit, which would tell him when he was on target. Unfortunately, bluebacks were cold-blooded, and had very well insulated skin, so they rarely gave off enough heat for the targeting system to work. Sen had to aim by eye, but he was used to it. He drew back his arrow and aimed for the what he thought looked like the fastest animal in the herd. The moment he loosed the arrow, he leapt out of his cover, breaking into a sprint. Even before he had hit the ground again, he had another arrow in the bow and was taking aim for the next target. He was nowhere near as fast as the bluebacks, but by the time they had all scattered out of range, four of them had hit the ground.<br/><br/>Strapping his bow to his back, he quickly made his way over to the closest animal. It was still alive, but the arrow through the back of its neck had rendered it paralysed. It was giving out a coarse soft roar as Sen approached. He took a long dagger from his waist and stabbed it through the animal’s throat. Wasting no time, he moved on to the next animal, which was starting to limp away, arrow still sticking out from its hind quarters. With one swift movement, he loosed the bow from back, drew an arrow, aimed roughly, and let off an arrow through the blueback’s skull. After seeing to the last two animals, one of which was already dead the other which couldn’t breathe through a punctured lung, he dragged them all away from the small patch of greenery at which they had been grazing. He removed his arrows and clipped them one by one to his back, then strapped his bow over them. With a length of rope he took from his shoulders, he tied the legs of all four animals together, and then tied the other end of the rope around his waist, before climbing the rocky slopes out of the valley to begin the long journey home.<br/><br/><div style=\"text-align: center;\">*****</div><br/>There were hundreds, if not thousands of such valleys carved out of the landscape. They started deep in the mountains in the distant north, where the melted snow and ice runoff from the ice fields that had once existed beyond the mountains, collected into gushing streams and poured down into the plains below. There, the streams had combined into vast rivers which had gouged out massive canyons into the otherwise flat terrain. Aeons of wind and rain had worn the canyons into gently sloped valleys, and settlers had been drawn due to the readily available water and abundance of wild life. Farms had popped up, and they built huge dams to irrigate their crops. They farmed the wildlife out, and replaced it with their domesticated cattle and sheep. Over the centuries, the farming subsided and villages and towns popped up, these growing rapidly, eventually forming cities. The cities grew, and with them, overpopulation, starvation and crime became serious problems. The rampant death rate was second only to the incredible rate at which the millions at first, but later billions, of impoverished people could breed.<br/><br/>The only thing slowing the growth of the cities were the frequent earthquakes from the tectonic action which kept the mountains growing. As skyscrapers started to go up, and then come down, the people learned of the importance of designing and building earthquake proof buildings. But pressure from the vast homeless population and the lack of resources driving the prices of building materials led to almost all contractors taking shortcuts. Very soon, the standards of buildings dropped, and the numbers of critically damaged buildings after each earthquake began to rise phenomenally. Rather than making repairs, the megacity just abandoned the critically damaged buildings and expanded outwards. Of course, having the buildings officially abandoned meant that the homeless could move into them. When the buildings did eventually collapse after several years, tens of thousands lost their lives each time, but those that survived would just move onto the next building.<br/><br/>The megacity began to die from the inside out. Having no means or resources to find and dispose of the bodies in the rubble, the people just left them there to rot. Diseases bred, and animals, firstly insects, then rats, then dogs and other larger animals moved in.  Eventually, with the population in the tens of billions, the city’s growth came to a standstill.<br/><br/>Gradually, as the tectonic plates shifted, the mountains grew. Tens of thousands of years after people had first settled at their feet, they were tall enough to cut off the rain which came in from the distant ocean in the south. Snow ceased to fall on the ice fields, and over time, they melted, leaving behind the bone dry, wind scorched tundra. Without the constant feed from the ice fields each summer, and with only the winter rain to keep them flowing, the rivers dried up for half of each year. With no water for drinking or sanitation, and – perhaps more importantly to the citizens – there was no water to drive the city’s industries.<br/><br/>With the city taking the little water that did come down from the mountains, the lands to the far south began to dry up. Within barely a few hundred years, they had formed a vast desert, with no water and only a handful of plants and animals tough enough to survive. Within a few millennia, even they could only be found around the edges. What had once filled the landscape was eroded by the wind into dust, and the dust formed furious dust storms, which accelerated the erosion.<br/><br/>The inhabitants of the southern lands gradually moved north, and settled amongst the remains of the city in the north. A scepticism and hatred for the citizens of the megacity that had developed over thousands of years was far too deep to be just dropped, and it ensured that the southerners would never venture far into the inhabited parts of the city. There was inevitably some conflict between the two populations, mostly brought on by the original citizens, but the southerners were scattered and had no leadership structure, so it was impossible for the city’s shambled government to launch a structured attack against them. That was when the world fell into chaos.<br/><br/>But that was millions of years ago.<br/><br/><div style=\"text-align: center;\">*****</div><br/>Sen found the location of the town annoying, to put it mildly. In fact, the very fact that there was any need for the town was something he had difficulty understanding, and he made a point of voicing that opinion at every opportu<br/></span><br/><br/><br/><br/>And that's where it ends, because, like I've said <a href=\"http://alphanumericsheeppig.blogspot.com/2009/09/on-unfinished-work.html\">I hardly ever finish anything</a>.</div>", "published": "2010-12-06T10:07:00.003000+02:00", "updated": "2011-12-01T09:04:05.688000+02:00", "draft": false, "categories": ["fiction", "NaNoWriMo"]}