{"id": "on-number-one-problem-with-human-race", "title": "On The Number One Problem With the Human Race", "content": "I am an idiot. This is a fact. Trawling through the evidence for this is an insurmountable task, but you don't have to go through all of it to see that my original statement is true. I am, without doubt, an incredible idiot. I realise this, and I acknowledge it. And wherever possible, I try to take it into account when making decisions. The number one problem with the human race is that most people do not do this.<div class=\"readmore\"> <br/><br/>When I was a teenager, I was convinced that I knew exactly how to drive a car. I understood all of the basic principles of how the car worked, and had some knowledge of the intricacies of handling a vehicle in various favourable and unfavourable driving conditions (most of which had been gained from playing video games and watching TV). I had built working steering systems and gearboxes from <a href=\"http://technic.lego.com/en-us/Default.aspx\">Lego Technic</a> sets, and was pretty confident that driving a real car would be simply a matter of adjusting to the size and feel of the controls. Needless to say, when the 17 year old me climbed behind the wheel the day after passing his learner's license, the resulting 3 second journey was enough to scare my poor mother to such an extent that she has never again been a passenger in a car with either me or my brother as the driver, in spite of the fact that we have seven and five years of driving experience respectively.<br/><br/>In psychology, this is known as the <a href=\"http://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\">Dunning-Kruger effect</a>. This effect causes people who are completely unskilled in a field to rate their ability in that field as much higher than average. And, unfortunately for us, it affects the majority of the human population.<br/><br/>However, there does seem to be a cure of sorts for the Dunning-Kruger effect. And, it is not that difficult to do. All that needs to be done is to provide some form of basic training in that field. Interestingly, a person is able to rank their ability more accurately after minimal training, even if the actual increase in their ability is negligible. <br/><br/>I can't wait for the day (if it ever arrives) when everyone receives very limited instruction in every field, just so that they can realise that all of us are incredibly stupid. Once we realise that, maybe we will be able to move on and just take it into account in our decisions.<br/><br/>References:<ul><li>Kruger, Justin; David Dunning (1999); <i>Unskilled and Unaware of It: How Difficulties in Recognizing One's Own Incompetence Lead to Inflated Self-Assessments</i>; Journal of Personality and Social Psychology vol. 77, No. 6; p. 1121.</li><li>Ehrlinger, Joyce; Johnson, Kerri; Banner, Matthew; Dunning, David; Kruger, Justin (2008); <i>Why the unskilled are unaware: Further explorations of (absent) self-insight among the incompetent</i>; Organizational Behavior and Human Decision Processes Vol. 105 No. 1; p. 98.</li></ul><br/>See also:<ul><li><a href=\"http://spikedmath.com/314.html\">Spiked Math #314: The Dunning-Kruger Effect</a></li><li><a href=\"http://en.wikipedia.org/wiki/Illusory_superiority\">Illusory superiority</a></li><li><a href=\"http://xkcd.com/793/\">xkcd #793: Physicists</a></li></ul><br/>(On a side note: While I may come across as believing that I rate myself as an above average amateur psychologist in the above post, I'd like to point that I only get my knowledge through reading (something that any educated child can do), and that I do not consider myself an amateur psychologist at all. I'm just a guy who likes to point out stuff because I wish other people knew more.)<br/><br/><br/></div>", "published": "2012-01-31T17:36:00.002000+02:00", "updated": "2012-01-31T17:36:43.048000+02:00", "draft": false, "categories": ["incompetence"]}