{"id": "on-nanowrimo-part-iv-type-iv", "title": "On NaNoWriMo Part IV: Type IV", "content": "Even though I did not finish, I would call National Novel Writing Month 2011 a success from my point of view. I managed to write over 16 days in November, and put out 22 186 words (or 44% of the novel's minimum length) - my contribution to the more than three billion words written worldwide. This is a big increase over NaNoWriMo 2010, during which I managed to write a total of 4 607 words.<div class=\"readmore\"> <br/><br/>Unfortunately, I won't be giving you a full novel, because I have decided over the course of the next few months, I will be finishing it. It will be released as a free e-book under a Creative Commons license as soon as it is finished (and hopefully proof read and edited too).<br/><br/>The novel, is titled <i>Type IV</i>(Working Title) is set in a world very similar to the world inhabited by <a href=\"http://www.alphasheep.co.za/2010/12/on-nanowrimo-part-ii-on-barghest.html\">Ashley</a> of last year's novel, and <a href=\"http://www.alphasheep.co.za/2009/01/on-as-yet-unrealised-evolution-of.html\">Sarieth</a> of this blog's opening post. It is a world that may or may not be our own, long after a technological civilisation, which may or may not be us, has fallen and receded. The story centres on our descendants who are living in and around the ruins of ancient cities. The story centres on two characters.<br/><br/>Amser is an extremely gifted girl who is obsessed with discovering things. Although the sciences of the ancients are long since forgotten in the isolated city in which she was born and raised, she is a genius when it comes to inventing. Her true gift however, is chemistry. Through a childhood of trials and experiments, she has learned how to create a vast range of mixtures and chemicals that can perform a whole range of apparently magical functions. These lead her to discover ways to temporarily restore books left behind by the ancients, and she explores the world, absorbing knowledge, and applying it where she can.<br/><br/>Llyr, aka Pedran, aka Elhaearn, is a man who is being hunted by the Company - a corrupt private law enforcement agency that has the entire country under its terrifying rule, much like the rule of Llyr's father (self-appointed lord of the city of Pyr, notorious pirate and marauder, and insidious conman) had once had over those very same people. Hunted in exile, he is searching for these mysterious creatures that have been prophesied to be the ones to bring freedom from tyrannous rule to his country. Funnily enough, he finds that these creatures have a very strange connection with the foreign girl, Amser.<br/><br/>Anyway, here's a short extract:<br/><br/><div style=\"padding: 0px 40px;\">“This guy saved our lives back there. Don’t they have names?” he asked.<br/><br/>Amser shrugged. “Not really. I’m not good with names. I call that one Type I,” she said, pointing to the smaller of the bird-creatures upon whose back Llyr was now sitting. “I call this one here Type IV.”<br/><br/>“In that case, I’m going to call this one Sion. Strong name. Means ’saviour’.”<br/><br/>Amser laughed. “I’m sticking with Type IV. Accurate name. Means the fourth combination of ingredients that worked.”<br/></div><br/>And then because I have the habit of graphing things (more for show than for actual information),<br/><br/><div style=\"text-align: center;\"><img border=\"0\" height=\"223\" src=\"data/images/SYViv5bHbGs.png\" width=\"400\"/><br/><br/><img border=\"0\" height=\"299\" src=\"data/images/BlJVF5j_lH8.png\" width=\"400\"/><br/><br/><img border=\"0\" height=\"176\" src=\"data/images/BnUnsjr-EMo.png\" width=\"400\"/><br/></div><br/>And of course, since I promised you at least part of a novel, you can have a prologue.<br/><br/><br/><div style=\"text-indent: 2em; padding:0px 20px;\"><br/><div style=\"font-family: Times, 'Times New Roman', serif; font-size:200%\"><b>Prologue: The Girl Who Explored</b></div><br/><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif; font-size: x-large;\"><i>C</i></span><i style=\"font-family: Times, 'Times New Roman', serif;\">AREFULLY</i><span class=\"Apple-style-span\" style=\"font-family: Times, 'Times New Roman', serif;\">, using a sharp, flat piece of metal, the girl pried the small square concrete slab out of place. Once it was loose, she began to lift it, ever so slowly, keeping it absolutely straight. As soon as it was clear of the slabs around it, she tossed it through the battered doorway where it joined a pile of other identical slabs. The girl let out a sigh of relief. The faint rust outline of a key was just visible on the coarse cement base beneath. She removed a thin square of paper from a wooden box she had taken out of her coat pocket and placed it over the outline. From a small glass bottle in the box, she poured a clear pungent chemical over the paper and then blew over it. The red outline of the key was gradually drawn through the paper. She mixed two more chemicals from the box in a small vial and poured the silver mixture into the area within the outline. Within seconds, it was glowing red hot, the paper curling in the heat. The girl was ready with a bottle of water as soon as the paper caught alight. Once the billowing steam had cleared, she lifted a rough key from the floor. After quickly filing the burs from the key, she placed it in a pocket of her coat, together with her wooden box, and after a nervous glance at the window, hurried out of the room.<br/><br/>Several hours later, she was several stories underground at the bottom of a narrow and broken flight of concrete stairs that had apparently been ineffectually repaired with wooden planks a number of times in their long history. Panting from moving some of the concrete slabs from the rooms above all the way down to bridge missing steps, she began to search her pockets.<br/><br/>She quickly found what she was looking for. She removed two small vials, one containing a clear transparent liquid, and the other containing a thick orange gel. She rubbed a small bead of the gel over her left hand, and then allowed a tiny drop of the liquid to spill over it. She closed her eyes as the combination erupted into blinding blue flames, engulfing her entire hand. The flames resided in an instant, leaving just a glowing blue aura around her hand which cast a faint but sufficient light several metres around her.<br/><br/>She was standing in a narrow stone passageway. The floor was slippery with moss, and the thick smell of damp hung in the air. She slowly advanced along the passageway. Every now and then, at somewhat irregular intervals, passageways identical to the one she was in would branch off to her left or right. Most of these she ignored, but every now and then, she would turn down one. After half an hour, the light emitted by her hand was no longer bright enough to show the path in front of her. She rubbed some more of the orange gel over her hand, and the light was restored. <br/><br/>Eventually, she approached a thick steel door. Here, the damp heavy air at the entrance had given way to a much dryer thin atmosphere. A thick layer of dust coated the floor and was thrown up by her feet as she passed. She stopped several meters away from the door, pulled a cloth over her nose and mouth, and moving very slowly, she pulled a small spray bottle from one of her pockets and began spraying a fine mist into the air. She waited while the dust settled, taking shallow breaths and exhaling very slowly. When the air was clear again, she moved forward, the dust remaining undisturbed bar a few faint foot prints.<br/><br/>When she reached the door, she examined it for several minutes. Finally, she fired a short burst of the mist from her spray bottle into the key hole, and then immediately blew into the lock. Out came her wooden box again --- this time so that she could take out a small bottle with a brush in the lid. She took out the key and painted over it with a thick red-grey grease. Slowly but forcefully, she slid the key into the lock, listening for each click as either the key or the catch in the lock gave way and sprang back into place. Once the key was fully in the lock, she sprayed it with a new bottle, this one containing a transparent fluid with a soft acrid smell which slowly ran out of the lock. She searched a coat pocket hurriedly for something, cursing under her breath when she couldn't find it. She eventually found what she was looking for in another pocket --- a small silver-grey rectangular stone. She held it a few inches away from the lock, and the fluid, stained slightly brown from grease, flowed towards the stone. She slowly moved the stone in a circular motion, spiralling first clockwise, and later reversing the direction. Once she had been round several times, she turned the key in the lock. With a loud grinding noise, the lock eventually turned. With a loud clang, the door was unlocked.<br/><br/>With no shortage of resistance, and a deafening squeal of resistance from the long neglected hinges, she finally got the door open. She quickly moved into the room and pushed the door shut behind her. A smile slid across her face as she walked across the floor. The rough concrete roof was only just higher than her head, and lined with cables with long perished white rubber insulation. Every few meters, bare glass bulbs dangled from the ceiling, and where they were missing, shattered shards lay on the ground. The room extended further than she could make out and was filled with rows and rows of crude metal shelves, many of which had buckled under the weight of books they had held for centuries.<br/><br/>She made her way to the centre of the room, taking care not to disturb anything. Where a shelf had collapsed, or books had fallen, she changed rows to pass them, rather than disturb the fallen heap.<br/><br/>When she reached the room's centre, she took off the large tanks that she had strapped to her back and placed them on the floor. She untied a small mask that was attached to the one and fastened it across her face. She opened the valves on the two tanks, first on the one her mask was connected to, and then the other. A thick yellow mist filled the room. As the gas filled the room, she began to lift books of their shelves seemingly at random, spraying the liquid she had used earlier to settle the dust. Turning the rigid pages one by one, she began to read...<br/><br/><br/><br/><br/></span><br/></div><br/></div>", "published": "2011-12-01T07:50:00.001000+02:00", "updated": "2012-11-08T20:59:17.909000+02:00", "draft": false, "categories": ["fiction", "NaNoWriMo"]}