{"id": "on-online-learning", "title": "On Online Learning", "content": "There is probably a reason why, after 10 years, I'm still a university student. I can't say what it is, but I think I may be addicted to learning. At the beginning of the year, I discovered <a href=\"http://en.wikipedia.org/wiki/Massive_open_online_course\">MOOCs</a> (massive online open courses) through an article that randomly popped up on my Facebook feed. Eight months later, I've completed two courses through <a href=\"https://www.edx.org\">edX</a>, and am on my way to finishing two more.<div class=\"readmore\"> <br/><br/>The key to the success of these courses, I find, are the entry surveys that they typically ask you to complete before the first lecture. One part of most of these surveys asks you to select a response to a series of sentences. The available responses go from \"Not at all confident\", through \"Somewhat confident\", to \"Extremely confident\". My reaction to these sentences often runs something like this.<br/><br/>      <i>\"I am confident that my English skills are sufficient for this course.\"</i> <br/>Of course. No doubt there. Extremely confident.<br/><br/>      <i>\"I am confident I can understand the main concepts taught in this course.\"</i> I'm doing a PhD in engineering. I should hope I can understand this. Extremely confident.<br/><br/>      <i>\"I am confident that I can handle the assignments, the quizzes and tests in this MOOC.\"</i> Once again, absolutely no doubt. It couldn't be much harder than anything I've handled before. Extremely confident.<br/><br/>      <i>\"I am confident that I will finish the course.\"</i> The slap in the face question. It gets me every time. It's like the arrogant \"Oh yeah, then prove it\" that I just can't back down from. Over the next few weeks, I will find myself working late on Sunday nights just to finish some assignment for a deadline the next morning, feeling like a complete undergrad, wondering why I ever signed up for this torture. Every time, I will think to myself, I could just quit. \"There's no obligation to complete the course and earn a certificate\", the FAQ constantly reminds me. But I don't quit, all because of that one time, right at the beginning of the course, that a survey used my ego to blackmail me into admitting that I was \"somewhat confident\" that I would finish the course.<br/><br/></div>", "published": "2013-10-07T20:45:00+02:00", "updated": "2013-10-07T20:45:06.978000+02:00", "draft": false, "categories": ["those damn penguins"]}