{"id": "on-pigeons-and-doves", "title": "On Pigeons and Doves", "content": "Several times in my life, I have gotten into arguments about the identity of birds. The bird family of Columbidae can be very confusing, because, in truth, no one really knows the difference between pigeons and doves. Even ornithologists can't really decide what the difference between the two are.<div class=\"readmore\"> <br/><br/><div style=\"float:right; text-align:center; padding:0px 20px;\"><a href=\"http://en.wikipedia.org/wiki/Laughing_dove\"><img src=\"data/images/rmlQWDP69Zk.jpg\" width=\"260px\"/></a><br/><br/>Laughing Dove<br/><span style=\"font-size:70%;\">Photo by <a href=\"http://www.flickr.com/photos/69759896@N00\">Sandeep Thoppil</a>, 2010.</span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Cape_Turtle_Dove\"><img src=\"data/images/JX-sTb0qQgw.jpg\" width=\"260px\"/></a><br/><br/>Cape Turtle Dove<br/><span style=\"font-size:70%;\">Photo by <a href=\"http://en.wikipedia.org/wiki/User:Muhammad_Mahdi_Karim\">Muhammad Mahdi Karim</a>, 2011.</span><br/><br/><a href=\"http://en.wikipedia.org/wiki/Feral_Pigeon\"><img src=\"data/images/ettldwkNdTw.jpg\" width=\"260px\"/></a><br/><br/>Feral Pigeon<br/><span style=\"font-size:70%;\">Photo by <a href=\"http://en.wikipedia.org/wiki/User:Muhammad_Mahdi_Karim\">Alexander Gamauf</a>, 2008.</span><br/></div>Originally, the Germanic word that gave rise to the word \"dove\" refered to all birds in the family Columbidae, whilst the word \"pigeon\" was derived from the French word that specifically referred to the meat of these birds. After some time, when new species were found and named, the word \"pigeon\" began to slip in. Now, the birds that are referred to as pigeons and doves are so mixed up, that many species of pigeon are more closely related to doves than they are to other pigeons, and vice versa. In general, however, the words \"pigeon\" and \"dove\" are applied consistently within a genus, the only exceptions being the Rock Dove, Stock Dove and Lemon Dove - all of which belong to the genus Columba, which consists of thirty species of pigeon, and only three species of dove.<br/><br/>The only reliable way of telling whether a bird is a pigeon or a dove is to identify it and refer to its common name. Fortunately, in South Africa, it is very easy to tell the difference between the most common species of pigeons and doves.<br/><br/>The Laughing Dove is the most common species to be found in South African gardens. It is easily identified by it's plain colouring, the only decorative markings being faint speckles on the front of it's neck. The similar looking Cape Turtle Dove can be distinguished by the thick black stripe on the rear of its neck. There is very little variation in colouring with these species.<br/><br/>The Feral Pigeon is slightly larger, and has a more pronounced cere than the doves. Pigeons are most commonly found wherever someone may drop food. Feral Pigeons evolved from escaped Domestic Pigeons and have come to inhabit most of the world. Originally, Domestic Pigeons were bred from Rock Doves, which are only called doves because the name \"Rock Pigeon\" officially belongs to members of the Australian genus Petrophassa. They vary greatly in colour, from plain black to plain white, but are usually grey with a couple of dark stripes across the wing.<br/><br/>Interestingly, the white doves that are often released at weddings are usually domestic pigeons.<br/><br/>So, in future, just remember that the simplest way to tell the difference is: <br/><ul><li>Those stupid, plain-looking birds that won't get out of the way of your car are doves.</li><li>Those evil red-eyed demons that swarm you in packs at the slightest sign of food are pigeons.</li></ul><br/></div>", "published": "2012-01-09T16:58:00+02:00", "updated": "2012-01-09T17:03:06.576000+02:00", "draft": false, "categories": ["annoying things"]}