{"id": "on-philosophers-part-ii", "title": "On Philosophers Part II", "content": "I wrote about philosophers two weeks ago, (<a href=\"http://alphanumericsheeppig.blogspot.com/2009/07/on-philosophers-and-their-heavy-boots.html\">On Philosophers and their Heavy Boots</a>), and someone made a comment about trees falling in the forest. (I really appreciate the comments. I really wish more people would leave them, even if it doesn’t say anything.)<div class=\"readmore\"><br/><br/>It is a long standing question (since the ancient Greeks, as far as I know), whether or not a tree that falls in the forest makes a noise if there is no one there to hear it. It’s like the Buddhist koan “What is the sound of one hand clapping.” The answer to that is simple. The sound is a solid “whack”, just like when two hands clap. If you want proof, then simply ask a man who has only one arm to clap. He substitutes his missing arm with the side of your face.<br/><br/>The issue of the tree can be solved so simply. The answer is no, the tree does not make a sound. If you want proof, the easiest way is to put a deaf person there to listen. (Since, technically, he is not there to hear it.) Leave him alone with the tree, and then return once the tree has fallen. If he’s a nice guy, he will tell you he didn’t hear the tree make a sound. If he’s not, be prepared to dodge a fist to the face, and repeat the experiment using a different deaf person.<br/><br/>The reason I brought this up again is because I have managed to make observations on a similar situation involving a completely different object. My kettle, like most modern electric kettles, has an automatic switch that triggers as soon as the water starts boiling. However, the kettle is not as perfect as it once was, and the switch doesn’t always work. The problem is that I am used to switching on the kettle, and then getting on with other things, knowing that when I return, there will be a kettle full of boiled water waiting, and that no water or electricity would have been wasted by the kettle staying on for to long.<br/><br/>The problem is that the switch doesn’t always work, and this has been happening for a while. From experience, I have noticed that the kettle only switches itself when I’m nearby, and waiting to switch it off. When I’m not there, it carries on boiling merrily. One could simply put this down as an example of Murphy’s Law, but I think one needs a more scientific approach.<br/><br/>Applying quantum mechanics to the situation, one realises that the kettle is both on and off until someone is watching it. As soon as I’m in the room, the two probability waves for the kettle collapse, and the kettle settles into its final state. In at least one universe, the kettle had been boiling the whole time, and that energy can’t just be forgotten. This means that if there is no observer, the water has to boil in at least one universe. If there is an observer, then there is no chance for multiple probability waves to form, so the water never boils in any universe (at least, not in any of my universes).<br/><br/>Of course, I’m not a quantum physicist. I’m an engineer, so naturally, I think it’s got more to do with the collapsing reliability function of the kettle.<br/><br/></div>", "published": "2009-07-26T13:13:00.002000+02:00", "updated": "2013-01-21T15:23:40.522000+02:00", "draft": false, "categories": ["philosophy"]}