{"id": "on-public-transport", "title": "On Public Transport", "content": "Not the public transport system itself (which is not quite as nonexistent as most people believe), but rather the people who use it. There’s no denying that most normal people in this country don’t use public transport. Anyone who does use public transport either does not own a car or driver’s license, and cannot get a lift with anyone, or has something wrong with them, or is just abnormal.<div class=\"readmore\"> I fall into the latter category, and because of this, I catch a bus on a regular basis.<br/><br/>Catching a bus in South Africa is easier than most people think. It just takes patience. There are hundreds of bus routes in Johannesburg, and there are bus stops every couple of blocks. Once you find the route that goes where you want to go, and found one of the numerous bus stops on that route, it’s just a matter of waiting. I have a lot of patience, and so waiting is no problem for me. Unfortunately, I travel one of the less popular routes, so the buses going my way are slightly less common, and I often have to wait over an hour for a bus.<br/><br/>The thing with waiting is that most people don’t find it as easy as I do, and they assume that everyone has as little patience as they do. In order to avoid the wait, they arrive at the bus stop only when they expect the bus. There is one bus in particular that runs every half hour. The drivers of that route are reliable and punctual, and so the commuters of that route are particularly good at arriving at the bus stop exactly when the bus arrives. If the bus is not there, they seem to like asking those standing around if they have seen the bus. Last week, one of them asked me. I simply replied “Yes”. He replied with an OK, and left the bus stop. If he had waited five more seconds, I would have added “but that was thirty minutes ago”, but he simply assumed that I would not have the patience to wait that long. Within a minute, the bus he wanted came and left without him. It’s too bad that he got home half an hour later that day than he could have. He didn’t even need to be patient – he just had to realise that some other people in the world are. </div>", "published": "2009-07-05T17:58:00.003000+02:00", "updated": "2011-09-19T12:42:47.127000+02:00", "draft": false, "categories": ["technology", "traffic"]}