{"id": "on-perseverance", "title": "On Perseverance", "content": "<div>I’ve reached the first landmark I set myself. This is my 100th blog post and it’s taken me 197 days (just over 17 million seconds). I wasn't sure how long I’d be able to keep it up, but it seems that I managed. I’m not sure how it happened, but I’m pretty sure it was only out of pure boredom.<div class=\"readmore\"><br/><br/><a href=\"data/images/ENk0B_QmDLA.jpg\"><img alt=\"\" border=\"0\" id=\"BLOGGER_PHOTO_ID_5365356684029497138\" src=\"data/images/ENk0B_QmDLA.jpg\" style=\"DISPLAY: block; MARGIN: 0px auto 10px; WIDTH: 247px; CURSOR: hand; HEIGHT: 327px; TEXT-ALIGN: center\"/></a><br/><br/>Anyway, thanks to those of you who read what I have to write. My readership is erratic, but I think it’s a miracle any of you remember to come back. You seem to average over 20 a week. Since I like graphs, I’m going to give you one.<br/><br/><a href=\"data/images/JJvkesmsD5Y.bmp\"><img alt=\"\" border=\"0\" id=\"BLOGGER_PHOTO_ID_5365349496094525538\" src=\"data/images/JJvkesmsD5Y.bmp\" style=\"DISPLAY: block; MARGIN: 0px auto 10px; WIDTH: 400px; CURSOR: hand; HEIGHT: 175px; TEXT-ALIGN: center\"/></a><br/><br/>And since I’m an engineer, I like discussing graphs, but I’m going to try my best to refrain from discussing this one… I promise I won’t… I’m really fighting the urge… I’m sorry, I really am doing my best…Due to technical issues, the counter was down for most of week 23… I’m sorry. You must understand that this is difficult for me. I'm just disappointed that it's not climbing steadily. (Tell you friends about this blog, and make it famous...)<br/><br/>Admittedly, 30% of those readers are people who know me from university, and another 20% are friends who know me from elsewhere. What impresses me are the 8% who are Americans who find my blog in Google, desperately wanting to know how to get a pig to mate with a sheep, wanting to find out if rabbits can eat chicken, or paranoid that ants are busy eating their houses out from under them. Some of them have even come back. Then you get the ones who want to know if squirrels lay eggs.<br/><br/>Its also interesting to note that 25% of my visitors read more than just the front page. The most popular pages seem to be the ones the ignorant masses seem to enjoy Googling. In other words, those involving the <a href=\"http://alphanumericsheeppig.blogspot.com/2009/02/on-destructive-potential-of-ants.html\">ants</a>, the <a href=\"http://alphanumericsheeppig.blogspot.com/2009/03/on-giant-rabbits-eating-salad.html\">giant rabbits</a> and the <a href=\"http://alphanumericsheeppig.blogspot.com/2009/06/on-squeezing-squirrel-eggs-from-stolen.html\">squirrels eggs</a>. I’m not sure why people would want to read these so much, but it’s up to them, I guess.<br/><br/>Anyway, I will hopefully have more nonsense to feed you people about slightly stupid spiders in slippers sliding into stuff while spinning in the snow on slippery slopes. If that’s the sort of thing you like.<br/><br/>Next milestone is 200.</div></div><br/>", "published": "2009-08-02T13:59:00.006000+02:00", "updated": "2013-01-21T15:23:34.498000+02:00", "draft": false, "categories": ["houses", "land marks"]}