{"id": "on-parking", "title": "On Parking", "content": "I’ve always wondered why some people like reversing into a parking. The standard excuse is that it is “easier to get out.” This is  certainly true, but it is also more difficult to get in.<div class=\"readmore\"> The whole system needs to be investigated in terms of the total net increase or decrease of ease that is gained by reversing into a parking.<br/><br/>The entire process can be broken up into two obvious tasks: Entering and exiting. Using a simple scale from one to ten in order to rate the difficulty of the task (with one being really easy and ten being really hard (or for those that require a more precise scale: the scale being a measure of the average between task related brain activity, relevant sensory activity, and muscular activity required to execute the manoeuvre; approximately logarithmic to base <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>e</span></i>; and scaled and shifted along the axis such that one is equivalent to the difficulty of driving in a straight line at constant speed, and ten is equivalent to a high speed hand-brake turn into a narrow fit parallel parking, including at least two jumps over other vehicles, at least one of which must be carried out without the aid of a ramp)). Rating each task individually and averaging them gives a reliable indicator of the total difficulty of the entire parking process.<br/><br/>Considering an average sized parking with cars on both sides, the difficulty of each task is estimated to be approximately (to the nearest integer) as follows:<br/><ul><li> Reversing in: 4 </li><li> Driving in: 2 </li><li> Driving out: 2 </li><li> Reversing out: 3 </li></ul>The primary difference comes in the reversing out compared to reversing in, since reversing into a wide area is easier than reversing into a narrower area (obviously).<br/><br/>The average for both going in and out of the parking is thus:<br/><ul><li> Reversing in, driving out : 3</li><li> Driving in, reversing out: 2.5 </li></ul><br/>The argument is therefore invalid in the absence of further reasons.</div>", "published": "2010-08-16T09:33:00.001000+02:00", "updated": "2011-09-19T12:42:47.121000+02:00", "draft": false, "categories": ["incompetence", "traffic"]}