{"id": "on-pens-pencils-and-paper", "title": "On Pens, Pencils and Paper", "content": "I write almost exclusively in pencil. I heard once from a friend (I cannot remember who it was) that psychologists say that this indicates a lack of confidence. <div class=\"readmore\"> The ability to erase any errors when using a pencil is definitely part of the reason that I use them, but it is not because I lack confidence in my abilities. I change what I am writing a lot. I rewrite each sentence a couple of times until I get the wording as I want it. I do this because whenever I read a sentence that I have written, I know that I am capable of composing a better sentence. As a result, my pen-written work is always an incredible mess, with more crossed out than not, which makes it rather difficult to read.<br/><br/>The real reason I prefer pencil, however, is because of the way I turn and spin the pen in my hand when I think. When I was still in school, and forced to write in blue pen, my hands and shirts (and occasionally my face – don't ask how) would be covered in inky stripes. Even after using a pen for five minutes to fill out a form, I inevitably have at least a couple of stripes across my palm.<br/><br/>These days, however, I favour typing over pencil. It's just easier not to have to worry about the corners of the paper folding. How it happens, I don't know, but it just may be caused by the way I move around as I write and think. All I know is that it used to frustrate my grade 7 history teacher beyond belief.<br/><br/>On the note of folding paper, I have finally gotten around my problem of the corners of pages and the spines of books folding over as I read them. It was simply a matter of moving into the future. I now find electronic copies of any book I want to read. I've actually reached the stage where a paper book is just to clumsy and awkward that I can no longer even sit and read one for any extended length of time.<br/><br/> </div>", "published": "2012-03-06T09:53:00.002000+02:00", "updated": "2012-03-06T09:53:30.047000+02:00", "draft": false, "categories": ["pencil", "technology"]}