{"id": "on-production-of-chicken", "title": "On the Production of Chicken", "content": "<img src=\"data/images/BjNqSvibvAk.jpg\" style=\"padding: 5px; float: left;\"/>When I started this blog, I decided I was not going to put in any pictures, mainly because I'm too lazy to be bothered. But this time, I couldn't care less about enforcing my own rule. It's a stupid rule anyway, so I put a picture in anyway.<div class=\"readmore\"><br/><br/>I also promised myself that I would never target any specific person or group of people, or place or people from a place, but that's a bit of a stupid rule too. I've already targeted stupid children, and they're a group of people too (albeit a big group).<br/><br/>Because, we all know that KFC does torture their chickens. That's what makes KFC so much juicier and tender than anyone else's... But it's OK, because the chickens aren't really alive. KFC has genetically engineered their chickens to such an extent that they now grow strings of featherless chicken pieces, already crumbed and ready to be fried. Who cares if they beat a couple of lifeless wings and thighs...<br/><br/>Just joking... On the more serious side of things, KFC don't actually farm chickens. They sell fast food, which is a completely different business to farming. Another one people often mix up is Woolworths. Woolworths does not make everything they sell themselves, nor is it made specially for Woolworths. If you read the label, it even says \"packed specially for Woolworths\". Note the wording. It clearly says \"packed\", and not \"grown\" or \"made\". In fact, KFC and Woolworths buy their chickens from exactly the same place, and so does Pick 'n Pay, and Spar, for that matter. So does half of South Africa.<br/><br/>The point I'm trying to make is that there are so many people that will go out and pay more to buy what they believe to be a superior product, but it is exactly the same as what they could have gotten anywhere else for cheaper. No that wasn't the point, I wasn't actually trying to make a point, but I made one anyway.<br/><br/>Another thing I don't understand is those vegetarians who give up meat because they don't believe in killing animals. Giving up meat for religious or medical reasons is something I respect. (I don't understand it, but I do respect it.) But if you don't believe in killing animals, why don't you protest against game reserves. Like the Kruger National Park. Did you know, that lions are actually allowed to go round killing animals indiscriminately. And they actually chase their food down and rip its throat out with their teeth. I've yet to meet a vegetarian who is against this practice.<br/><br/>Before you boycott meat, you should realise that plants have feelings too. If you think killing living creatures for food is horrible, I think ripping bits off and leaving the creature alive is even worse. Even those only eat fruit that has naturally fallen off the tree are quite disgusting. I really like steak, but if a cow was walking along, and a section of its backside fell off, I'd stay well away. It's just not right...</div>", "published": "2009-03-08T11:53:00.007000+02:00", "updated": "2011-03-16T09:36:35.458000+02:00", "draft": false, "categories": ["incompetence", "food"]}