{"id": "on-polar-bears", "title": "On Polar Bears", "content": "Polar bears are cool. Sorry... I mean interesting, or... cool. Someone really needs come up with a word that doesn’t make a lame pun when used with polar bears. It’s a serious flaw in the English language. (A side note: when a horse becomes lame, they shoot it.) But, the fact still remains that polar bears are normally cool animals.<div class=\"readmore\"> How cool they are is a function of the time elapsed since their last meal, and whether or not they are facing you. The same goes for tigers. If you see a tiger, it’s probably better if it is watching something else, and that it keeps doing that.<br/><br/>But back on the topic of polar bears, I’ve always wondered what convinced polar bears to abandon the forests where bears normally live and move up into a region that has no trees, no plants, and is permanently covered with a layer of solid ice. Polar bears are big, and it’s never a good idea to put something really big on ice. And surely it was much easier to find food in the forests. And surely it was a bit warmer. And then people still think of polar bears as being wise.<br/><br/>Polar bears chose to go north, over land, but the penguins moved south, over several thousand kilometers of ocean to Antarctica. Possibly it was to get away from the polar bears, but there is one important thing to note about the continent of Antarctica before one can jump to any conclusions. There are only two creatures that live on the land in Antarctica (Seals are stupid, so they don’t count). These are penguins and people. The only reason people are there is to conduct scientific research. The conclusion one can draw from this is that the penguins also only moved there to conduct scientific research. I’ve always said that penguins cannot be trusted.</div>", "published": "2009-06-23T07:34:00.003000+02:00", "updated": "2011-04-07T13:10:52.798000+02:00", "draft": false, "categories": ["those damn penguins", "weather"]}