{"id": "on-psychoactive-drugs", "title": "On Psychoactive Drugs (Sort Of)", "content": "When I was 19, I made a concious decision not to drink alcohol. I don't know why I chose to be like that, but I think it had something to do with the fact that my brain is hard enough to control at the best of times, and I don't like losing control of it, even slightly. I feel the same way about all psychoactive drugs, including caffeine. <div class=\"readmore\"> I even feel that way about painkillers, which I take only when absolutely necessary - which is about once or twice a year, if that.<br/><br/>One morning about a month ago, I was fairly short on sleep, so I decided to try a cup of coffee to wake up. It worked, and I felt incredibly alert for the next few hours. However, by lunch time, the effect had worn off, and I was rendered useless for the rest of the day. The next day, I didn't get quite enough sleep either, and so I did the same thing. I kept it up for about two weeks, after which I introduced a second cup a day in order to try to keep my brain functioning for longer. In order to avoid developing a dependence on caffeine, I made sure to have at least three consecutive caffeine-free days a week.<br/><br/>I've definitely <i>felt</i> more alert and productive on those days that I've drunk my coffee, but looking back on how much I've achieved on those days, I don't think I've achieved any more than usual. If anything, I've been procrastinating even more than I usually do (and that's saying something), and I've felt particularly existential and irritable over the past month, which tends to be even more counter-productive. Not to mention that I've had a couple of the worst headaches I've had in years over the past month (not counting those from when my titanium bolt was screwed in), and I blame it all on caffeine.<br/><br/>I think I'm going to put a stop to this. No more psychoactive drugs for me.<br/><br/></div>", "published": "2012-10-15T15:09:00.001000+02:00", "updated": "2012-10-15T15:09:08.063000+02:00", "draft": false, "categories": []}