{"id": "on-quartering-of-sandwiches", "title": "On the Quartering of Sandwiches", "content": "Of course, how you cut your sandwiches is entirely a matter of personal preference, but what happens if you have no preference? The majority of shop bought sandwiches are halved into two triangles of roughly equal size, but I find that quartered sandwiches are ever so slightly more convenient to eat with my hands. Exactly the same applies to slices of toast.<div class=\"readmore\"> <br/><br/>When I was much younger, I liked to have my toast cut into five long fingers. This had the advantage that 60% of the slices would contain almost no crust, but with the obvious disadvantage that the remaining slices would consist almost entirely of crust. In addition, this requires four separate cuts to be made. Cutting the slice into four resulted in half the pieces having an unacceptable large proportion of the crust. By the time I was ten years old, I had abandoned this and adopted the two cut quartering method for good - both for toast and sandwiches.<br/><br/>The two cut quartering method is illustrated in the diagram below.<br/><br/><div style=\"text-align: center;\"><img border=\"0\" height=\"250\" src=\"data/images/3PMhNcs5yOQ.jpg\"/></div><br/>The edges of the sandwich are given by the quadrilateral ABCD. The sandwich is first halved along the line FH, where F and H are arbitrary points along the top and bottom of the sandwich respectively. These two pieces are then halved again simultaneously by making a single straight cut along the line GJ, with G and J representing arbitrary points along the right and left edges respectively.<br/><br/>The big question that arises from this is where exactly should the points F, G, H and J be located. Obviously, locating them on the midpoints of the line segments AB, BC, CD and DA results in pieces of identical size, shape, and crust distribution. However, as I established from the four versus five fingered arrangement, I would much prefer the majority of pieces to have a below average portion of the crust. Locating the points F, G, H and J exactly on A, B, C and D results in four isosceles triangles of two different sizes - a shape that is very popular for cocktail platters. If we consider a sandwich that is a perfect rectangle of aspect ratio of 1.2, then the two larger pieces will have 16.2% more area than the other two pieces, and contain 20% more crust. <br/><br/><div style=\"float:right; padding 10px;\"><img border=\"0\" height=\"120\" src=\"data/images/2pK4pawhhIk.jpg\"/></div>I have even considered locating F, G, H and J on the quarter points, producing the shapes shown to the right. This results in two of the pieces having 9.0% more area and 9.5% more crust than the other two pieces. Unfortunately, there is no possible way using the two cut quartering method method as described here that results in the larger slices having less crust, which would be my preference.<br/><br/>However, whatever the maths says, I always find myself reverting back to the standard four little triangles. I wish I knew why I preferred that shape.<br/><br/><br/></div><br/>", "published": "2012-01-03T14:29:00+02:00", "updated": "2012-01-03T14:29:16.977000+02:00", "draft": false, "categories": ["mathematics", "food"]}