{"id": "on-rabid-laminated-plastic-chairs", "title": "On Rabid Laminated Plastic Chairs...", "content": "... with hairy armpits, and an unusual obsession for throwing polystyrene from the boxes of old electronic appliances at passing cats, and then cleaning up the mess afterwards. It is a terrible problem. You wouldn’t have noticed it, unless you were a cat. Even the cats are only mildly annoyed with it, since those polystyrene packaging things don’t hurt at all when you are hit by them.<div class=\"readmore\"><br/><br/>Did you wonder why anyone would want to laminate a plastic chair? Or where you can buy them? Probably not. You were too busy thinking of the whole thing, and didn’t let each concept sink in.<br/><br/>(On a side note: I bet the word random came into your mind, and if it did, then you would have been wrong. There is no such thing as ‘random’. We have to use pseudo-random, which means carefully chosen, calculated based on a set of extremely complex and highly linked set of rules that make the output so difficult to accurately determine, that it becomes unpredictable by any practical means. Whenever I roll a dice, I try to construct Newton’s laws, and set up a system of differential equations. The problem is that I can never seem to differentiate the trajectory of the roller’s hand precisely enough to get an accurate measure of the imparted velocity, and I have no idea of the Young’s Modulus and Poisson’s ratio of the damned dice, so I can never get a good idea of the deformation as it hits the surface – which would allow me to work out the exact trajectory as it bounces. My eye is also a poor judge of surface quality, so I have no idea of the microscopic imperfections that would affect the rebound of the dice, and the weight imbalance from the markings throws me off a bit. The gravity variation as the dice changes height is easy to work out, but by the time it takes me to model the aerodynamic forces on a three dimensional rolling cube, the dice has already been lying still for several hours. It’s difficult to predict, yes, but I could still work it out. Nothing is random. Some quantum physicists may argue, but they poison cats for a living... Why would you trust them? This blog post is not random at all. I really prefer the term “arbitrarily chosen”, which mathematicians like to use instead of “carefully chosen after 6 weeks of sleepless nights and several thousand pages of failed calculations, in order to reveal a single slightly interesting, but mostly pointless phenomena”.)<br/><br/>What I’m trying to get across here is that there is a plot by penguins to agitate domestic cats into attacking furniture (since the laminated plastic chairs are claw proof, they’ll have to take out their frustrations on expensive leather sofas and polished wooden tables, and the TV stand.) This will cause an outrage with trees and cows, whose dreams are being shattered. (Their best aspiration has just been turned to a scratch post. The next best thing for a cow is to become a MacDonald’s burger...) This will cause a trees and cows to revolt, destroying the world, and the penguins will walk in and take over, completely blameless.<br/><br/>The penguins are there... spying on you. If you don’t believe me, refer to the plot in Figure 1 below.<br/><br/><div align=\"center\"><a href=\"data/images/BG_QEwIYA8o.jpg\"><img src=\"data/images/BG_QEwIYA8o.jpg\"/></a><span style=\"font-size:85%;\"> <br/>Figure 1: Variation of visible penguin populations with time.</span></div><br/>It is apparent that penguins are disappearing, and yet the number of visible penguins in your house remains constant at zero. Where do the remaining penguins go? Invisible penguins in your house... And we don’t know what the initial population of penguins was, so the number of invisible penguins could be anything from a few thousand to several billion...<br/><br/>And, I’m not even getting into the rabies side of things... Not to mention the hairy armpits.<br/><br/>Sometimes, my mind breaks down the little concepts so much, I start scaring myself. I wish I could just see the world as a whole without having to worry about the consequences of the built-in subtleties of every little thing... </div>", "published": "2009-05-10T18:21:00.005000+02:00", "updated": "2011-04-07T13:15:35.202000+02:00", "draft": false, "categories": ["engineering", "those damn penguins", "chairs", "domesticated animals"]}