{"id": "on-religious-beliefs-and-my-own-lack", "title": "On Religious Beliefs, and My Own Lack Thereof", "content": "<div class=\"readmore\"> (On a side note: This is a particularly difficult post, but I think I am now mature enough to be open and honest about this. I can't say the same for those around me (because, while I consider myself to be a reasonable judge of character most of the time, this is the one field in which, due to its very nature, people tend to be completely irrational. Please don't be irrational if you read this. Think calm thoughts.)<br/><br/></div>    <span style=\"font-size: large;\"><b>I am an atheist.</b></span><br/><br/>This does not mean that I believe that there is no god. It means that I do not believe that any god exists. These are two fundamentally different ideas, and I think the difference between them are a primary source of confusion for many theists and a fair number of agnostics too. <div class=\"readmore\"> <br/><br/>I realised that it is important for me to talk about my religious beliefs after stumbling across a certain Wikipedia article (<a href=\"http://en.wikipedia.org/wiki/Importance_of_religion_by_country\">Importance of religion by country</a>), and in particular, the fact that only 65% of the USA perceives religion to be important as opposed to an alarming 84.5% of South Africans. The poll opened my eyes, and I have suddenly noticed the incredible number of devout religious followers in my life every day.<br/><br/>Atheism tends to be tricky to explain to someone who completely and absolutely believes a certain set of religious teachings. The problem seems to be with understanding how atheism goes beyond the whole idea of belief. While all religions tend to emphasise the concept of faith and belief, even putting it forward as the defining characteristic that will earn the most divine rewards (\"<i>He who believes in me has everlasting life</i>\" - John 6:47), atheism simply rejects that belief. It's difficult for a believer to understand that. So let me put forward another one of my religious views to help clarify.<br/><br/>    <span style=\"font-size: large;\"><b>I am also an agnostic.</b></span> <br/><br/>When I was less informed on the matter, I was very much against being labelled an atheist. I grew up under the impression that atheism was an arrogant assertion of the non-existence of any deity that had no room for error. While I was (and still am) almost certain that no god in the conventional sense actually exists (partially on the grounds that there simply is no evidence that a god exists, nor any need for one to exist), I have never been able to discount the remote possibility that I could be wrong. I am pretty arrogant, but even I do not have the extreme arrogance to claim that I have all the answers to the universe.<br/><br/>I cannot claim that there is no god. I do not believe that there is no god. I do not believe anything regarding the existence of god. It really is as simple as \"I do not believe in god\". Gradually, as I came to understand more about atheism, I realised that being able to say that one statement truthfully is all that it takes to be an atheist. Now, I am proud to label myself an atheist.<br/><br/>    <span style=\"font-size: large;\"><b>I am also a pantheist.</b></span><br/><br/>Or more specifically, a <a href=\"http://en.wikipedia.org/wiki/Naturalistic_pantheism\">naturalistic pantheist</a> in a sense. Being an atheist does not mean that I do not have a sense of awe and wonder at the natural world. The natural world is amazing, and those that know me will know that I am fascinated by almost everything. I have a very high respect for almost all natural phenomena, and life (not only human life) is one of the things that I hold in very high regard. <br/><br/>    <span style=\"font-size: large;\"><b>I am also an antitheist.</b></span><br/><br/>I have never really been open about my views before, but I increasingly feel the urge when I am around religious people to point out how absurd and arrogant their beliefs are. I know that the only reason I have never done so in the past is because I lack the confidence in my ability to put forward a convincing argument to convert them to atheism faster than the argument would alienate them.<br/><br/>Although I certainly dislike awkward situations, I've come to the point where I'm starting to feel that it is my moral obligation to stop people from throwing their lives away on a fictional concept, and start living their lives with wonder, realising that they actually don't know anything.<br/><br/>Opposition to religion tends to cause people to take offence, but it shouldn't. The words of Douglas Adams (possible one of the biggest influences on all of my writing) from his speech at <a href=\"http://www.biota.org/people/douglasadams/\">Digital Biota 2 in September 1998</a> probably highlights this best: \"The invention of the scientific method and science is the most powerful intellectual idea, the most powerful framework for thinking and investigating and understanding and challenging the world around us that there is, and that it rests on the premise that any idea is there to be attacked and if it withstands the attack then it lives to fight another day and if it doesn't withstand the attack then down it goes. Religion doesn't seem to work like that... Yet when you look at it rationally there is no reason why those ideas shouldn't be as open to debate as any other, except that we have agreed somehow between us that they shouldn't be.\"<br/><br/>So, from this moment forth, I am going to strive to attack religion with sensible and rational arguments. My aim is not to alienate people, but to inform them of the absurdity of absolute belief. Even if I cannot turn everyone I know into atheists, just having them accept an open-minded and agnostic viewpoint would be enough. I don't intend to be mean and I certainly don't mean offence, but it is inevitable that some will take things offensive. All I am asking is for everyone to just admit that they just don't know.<br/><br/>(On another side note: Even though I was never confirmed, I used to consider myself a Christian until only a year or two ago. And it wasn't like I was young and impressionable when I first started really calling myself a Christian. I was in my very late teens when I first started seeking religion, and spent almost two years calling myself a Buddhist before I began calling myself Christian. Gradually, I came to realise that I didn't really believe, nor did I need to believe. It is not at all difficult to drop belief in the Bible, and dropping belief in God is only a small step away from that. I suggest that absolutely any doubt in the existence of God is a sign that there is an agnostic hiding somewhere in your subconscious. Embrace it. The world is far more complex and amazing than any book could have you believe. Life is so much better than you think. You are free. You are one of billions in a species that is one of billions on a planet that is one of billions in a galaxy that is one of billions in the universe. And is the universe one of billions in something else? Quite possibly, but that's the awesome thing. No one really knows! Isn't that completely amazing in itself? Not knowing but striving to find out, I can assure you, is far more exciting than pretending that you know but can never understand.)<br/><br/>(On a final side note: Religion was one of the absolute no-go topics when I started this blog (I still thought of myself as a Christian back then). I guess that I have changed a lot.)<br/><br/> </div>", "published": "2012-05-21T16:27:00.003000+02:00", "updated": "2012-05-21T16:27:37.114000+02:00", "draft": false, "categories": ["people", "fixing the world", "incompetence", "awkward situations", "philosophy", "religion"]}