{"id": "on-ring-around-sun", "title": "On the Ring Around the Sun", "content": "that appeared over Johannesburg today, which has got people talking. They actually occur quite often (or so I’ve heard - I don't go outside often, and if I do, I don't generally look directly at the sun. Apparently you can see them almost every week in higher latitudes).<div class=\"readmore\"> But having read about the phenomenon before, and being a know-more-than-most (not a know it all. I don’t know it all, I just know a lot more than most people, and that likely includes you), I felt obligated to correct all the incorrect myths that have been circulated by people who couldn’t be bothered researching things (and I am not talking specifically about radio hosts...). This is a photo of what I saw. (The dot is a reflection of the sun on the lens cover)<br/><br/><a href=\"data/images/crKMQ5S5iQw.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"240\" src=\"data/images/crKMQ5S5iQw.jpg\" width=\"320\"/></a><br/><br/><br/>The halo is not caused by water droplets or condensation of water vapour like the rainbows that appear after rain, and it is not caused by cirrus clouds. It is caused specifically by hexagonal prism ice crystals that are scattered randomly in the upper atmosphere. These often occur inside thin cirrus or cirrostratus clouds, but may occur in other clouds as well. There is a myth that the halo means it will rain in 12 to 24 hours, but it is more like 2 to 3 days in Johannesburg, and only if there are visible cirrus or cirrostratus clouds in the sky (which there were today). There is a twisted version of the myth which says there will be a good rainy season. That is rubbish, and there is no connection between halos and long term weather.<br/><br/>There are several halos that can occur. What happened this morning was a 22° halo, the most common type. If you point one hand at the sun and the other at the halo, the angle between the two will be 22°. For a brief time, a parhelic circle was visible, which runs around the point in the sky immediately above you, and passes through the sun, and earlier, the 46° halo was also faintly visible. There were no sun dogs visible today! Sun dogs are two bright spots on either side of the sun, which are also known as \"mock suns\".<br/><br/>With a quick 30 minutes in <a href=\"http://www.blogger.com/%E2%80%9Dhttp://www.gimp.org/%E2%80%9D\">Gimp</a> (because Photoshop is for gullible losers), I drew a pretty picture (not to scale) to show some of the halos that can occur.<br/><br/><a href=\"data/images/3rTWdNV8VIA.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"348\" src=\"data/images/3rTWdNV8VIA.jpg\" width=\"360\"/></a></div>", "published": "2010-11-01T17:03:00.001000+02:00", "updated": "2012-04-17T10:31:39.458000+02:00", "draft": false, "categories": ["sky", "weather"]}