{"id": "on-sesquipedalia", "title": "On Sesquipedalia", "content": "A sesquipedalian is a long word. It is said to have been coined (albeit in Latin) towards the end of the first century BCE by <a href=\"http://en.wikipedia.org/wiki/Horace\">Horace</a> in his <i>Ars Poetica</i> which apparently means \"He throws aside his paint pots and his words that are a foot and a half long\". <div class=\"readmore\"> The prefix \"sesqui-\", meaning one and a half, is used elsewhere in the English language - for example, a sesquicentenary is a one hundred and fiftieth anniversary. The morpheme \"ped\", referring to a foot is much more common. The Latin word made it's way into the English language in the mid 17th century, and came to mean a long word.<br/><br/>Naturally, the fear of long words is therefore sesquipedaliophobia. However, Josefa Byrne, in her 1976 book <i>Mrs. Byrne's Dictionary of Unusual, Obscure, and Preposterous Words</i> (which is not a recognised reputable dictionary, contrary to popular belief), coined a new word by adding two made up prefixes, obtaining \"hippopotomonstrosesquipedaliophobia\", claiming it to be the fear of long words. Over time the word has gained an extra letter (perhaps deliberately) becoming \"hippopotomonstrosesquip<b>p</b>edailophobia\", and worked it's way into some of the less reputable online dictionaries, such as <a href=\"http://dictionary.reference.com/browse/hippopotomonstrosesquippedaliophobia\">Dictionary.com</a> and <a href=\"http://en.wiktionary.org/wiki/hippopotomonstrosesquipedaliophobia\">Wiktionary</a>. It is probably important to note here that Wiktionary is open to user edits, and that the entry at Dictionary.com states at the bottom \"Dictionary.com's 21st Century Lexicon, Copyright © 2003-2012 Dictionary.com, LLC\", whereas a legitimate word states something along the lines of \"Dictionary.com Unabridged, Based on Such-and-Such Dictionary, © So-and-So, 2012\". Not surprisingly, the word does not show up anywhere in my Oxford English Dictionary.<br/><br/>(On a side note: It is often said that the longest word in the English language is \"smiles\", as there is a mile between the first and last letters. Actually, if this logic is to be applied, then a word like \"campcraft\" would be the longest word, since there is an <a href=\"http://en.wikipedia.org/wiki/Parsec#Megaparsecs_and_gigaparsecs\">mpc</a> in the middle.)<br/><br/>(On another side note: The longest word that is actually in my Oxford English Dictionary is \"pneumonoultramicroscopicsilicovolcanoconiosis\", and it is quite easy to work out what it actually means. \"pneumo-\" refers to the lungs, \"microscopic\" refers to something that is too small to be seen (with \"ultramicroscopic\" referring to something even smaller than that), \"silico-\" has to do with sand, \"volcano-\" indicates ash, and the \"-osis\" suffix refers to an infection. So the word simply means a infection caused by very fine particles of sand and ash in the lungs - a condition that is usually referred to by doctors as \"silicosis\".)<br/><br/>(On yet another side note: This may look like yet another filler post, and it just may be. Perhaps that means a big post is on its way? One just may be. Perhaps it is that magical post that would fix all the world's problems? I sure hope so.)<br/><br/> </div>", "published": "2012-03-13T10:15:00+02:00", "updated": "2012-03-13T10:16:39.253000+02:00", "draft": false, "categories": ["language"]}