{"id": "on-selling-stuff", "title": "On Selling Stuff", "content": "Especially selling stuff that no one would ever need. The salesman will always be vague about what he is selling, and tell a long story first. The reason for this is simple. He's got a job to do, and that is to try selling his merchandise. He doesn't have to actually sell anything, but just try.<div class=\"readmore\"> He is vague in the hopes that you will agree to buy something without knowing what it is, or because you think it may be for a good cause, and if not, then at least he has spent a lot of time working to earn his pay. It's better to be long-winded and vague with ten people a day, and have two people buying products that they thought did something else, than to be brief and clear to a hundred people, and have all of them tell you they won't buy it because they don't need it.<br/><br/>Selling yourself is exactly the same thing (for those who have minds that jump to those sort of thoughts, I'm too lazy to think of a way to say that in such a way that it can't be made to sound like I'm talking about prostitutes. Really, if you like doing that sort of thing (twisting words, I mean – not doing prostitutes), you really will be able to twist anything I say.)<br/><br/>(On a serious side note: What is the correct standing on nested parentheses. The last paragraph was a perfect example. Do the rules of the English language allow them? If not, then why not? Why do I care? Everyone knows I’ll use them if I want (because that’s the sort of person I am).)<br/><br/>Earlier, a man, whom I think was a painter, came in to the shop. I'm quite sure he wasn't a prostitute, since he had overalls, a paintbrush and a roller in a plastic bag. He could have been, but I'm not sure what would have made him think that I'd be into that sort of thing. So I'm going to assume that he wasn't. I think he might have been looking for work, but he wasn't clear. He gave a story about how he'd done jobs here and there. I’m assuming it was painting jobs. He then told me how he had done another job yesterday and was only getting paid tomorrow. I think he was trying to say he’d do a job for me now, and I’d only have to pay later. He carried on, but he was very quiet and secretive about it, so I couldn’t hear what he was talking about. He then opened his plastic bag and showed me his overalls and painting tools. <br/><br/>I don’t need a painter, but even if I did, I would have told him I’m not interested in what he had to offer, just to be safe.</div>", "published": "2009-08-09T13:43:00.003000+02:00", "updated": "2011-03-07T14:28:44.233000+02:00", "draft": false, "categories": []}