{"id": "on-some-vaguely-related-ideas", "title": "On Some Vaguely Related Ideas", "content": "It’s been winter for so long now, but it’s finally over. Spring is here, and the insect eggs that have been lying dormant for the last six months are starting to hatch. Those creatures that eat insects are coming out of hiding.<div class=\"readmore\"> The birds are returning from the warmer north, and overnight, a pair of doves managed to permanently fix the pool brush to the wall with their nest. Along with the insects, the spiders have also come out of hiding.<br/><br/>In order to get away from the birds, spiders are attracted indoors, but they prefer the dark and damp places away from human activity. The perfect place is behind bookshelves, but the drains appear to offer a seemingly suitable alternative. Unfortunately, they are suitable for a single day, at most, because each evening, at more or less the same time, I run the bath.<br/><br/>A week ago, a spider had decided to make its home in the plughole of the bath. It was not a smart choice, although it was not a fatal mistake. Without noticing the spider, I ran the bath and got in. Relaxing in the bath, I felt a tickling feeling on my left ear. I brushed it, and thought nothing of it. But the feeling persisted, and seemed to be moving across my ear. I submerged that side of my head to try get rid of it, and when I came up, I noticed a spider floating in the water. I was raised to never hurt spiders, so I picked it up and placed it on the floor, and blew it to dry it a bit. It lay motionless for a while, but eventually got up and moved away. Thinking nothing of it, I continued with my normal routine.<br/><br/>That night, while lying in bed, my ear was starting to itch slightly. By the next morning, it felt like it was on fire. By afternoon, the base of my ear was swollen and red, and the skin felt bruised. That night, the pain in my ear forced me to sleep on my right hand side, which is something I don’t often do.<br/><br/>I am deaf in my right ear, and if I block out my left ear, I shut out the world. That makes it really easy to sleep. Lying with my deaf ear against the pillow, my left ear was open to the world, and I was reminded of the loud night-time world that I was so used to being able to just switch off. <br/><br/>I used to wear a hearing aid. I still would, if my ear didn’t reject it. I will be getting an unconventional type of hearing aid soon. It’s just a matter of waiting for the equipment to arrive in the country, and scheduling an operation. A few weeks ago, I was trying out a test version of this hearing aid, and I noticed that the volume control had numbers marked on it to indicate the level. To turn the hearing aid off, you turn the volume right down to zero. There is a slight click to indicate that the device is switched off. When you put the device on, it should be switched off; otherwise it sends really loud feedback pulsing through your skull. Once it is connected properly, then you can set the volume to the desired level, which you do by ear. You turn the wheel until it sounds right. Why do little numbers have to show the level, when the device is attached to the side of your head where you can’t see it, and you have to turn the volume off to remove the device anyway? It’s just another case of someone not thinking.<br/><br/>Like all volume control switches, it is impossible to set it exactly where you want it. It’s always just to loud, or just to quiet. It’s like most controls, actually. Especially air conditioners. The setting you want is always in between something. The room will either be too hot or too cold. One lecture theatre at the university is particularly bad. What made things worse, was that when the unit had been installed, someone had had the idea of sealing up all the windows. The air in the room was always dry and stale, no matter what the weather outside was, and although the air conditioner has a range of temperatures which the control pad implies that it is able to maintain, the unit only ever seemed to have two settings – namely “off” and “arctic blizzard”. Having it on made the air too dry and leaving it off made the room to stuffy. Last year, our class decided that the best solution would just be to open to windows. One day, with the aid of an electric drill with a screwdriver attachment, the class managed to unseal some of the windows. It worked. The room is still never the right temperature, but at least the air is breathable.<br/><br/>Having the electric drill, a couple of us decided to play a prank on a class mate. This involved drilling a couple of holes in his pencil case, and bolting it closed. A touch of super glue made sure that it would stay bolted shut permanently. This year, we played a prank on the same student. While a couple of people distracted him, someone managed to remove his calculator from his bag. During a break, a friend and I went to a nearby room and dismantled his calculator. We put it back together carefully, making sure that the ‘plus’, ‘multiply’, ‘subtract’ and ‘divide’ buttons were switched around.<br/><br/>In primary school, when I still had a cheap simple calculator, I used to take it apart and randomly arrange the buttons so that no one would steal my calculator. There was also a polarised film over the display, and turning it over would invert the colours on the screen. I used to love the fact that my calculator looked completely different to anyone else’s. Unfortunately, my calculators are far more complicated now, and rather than using a cheap plastic film, the glass in the display is polarised. That makes the calculator slightly less customisable, and it annoys me that my calculator looks so much like everyone else’s.<br/><br/></div>", "published": "2009-09-13T16:02:00.002000+02:00", "updated": "2013-01-21T15:11:01.803000+02:00", "draft": false, "categories": ["technology", "incompetence", "jokes", "sound", "houses", "weather"]}