{"id": "on-stupid-outdated-laws-in-south-africa", "title": "On Stupid Outdated Laws in South Africa", "content": "November is just around the corner, and that means <a href=\"http://nanowrimo.org/\">NaNoWriMo</a>. That is <b>Na</b>tional <b>No</b>vel <b>Wri</b>ting <b>Mo</b>nth, for those too lazy to follow a link. I'm well on track and fully intend on finishing the novel I started for last year's NaNoWriMo, and I've started making plans for self-publishing, distributing, and of course, making some money.<div class=\"readmore\"> <br/><br/>I'm a big fan of the <a href=\"http://creativecommons.org/\">creative commons</a> license, so naturally I'll be releasing the completed novel under a CC license and distributing the e-book for free. I don't really care whether the book makes money or not (I just want people to read it), but I have no problem if some people enjoy it and feel like donating a little.<br/><br/>Many bloggers, artists, authors and even musicians do this. Kevin McLeod of <a href=\"http://incompetech.com/\">Incompetech</a>, for example, creates music and releases it for free under a CC license. All he asks for in return is that people share his music, tell the world about him, and if they like, they can donate a little money.<br/><br/>That's exactly the model I would love to use. There is however one small complication. I live in South Africa, and for some reason or other South African law apparently makes it illegal for anyone to receive a donation unless they are a registered Nonprofit Organisation, which I am most certainly not. As far as I can tell, South Africa is the only country that has a law like this.<br/><br/>While I understand the purpose of that sort of law, and I can conceive the role in fighting fraud and corruption it might play, I think that it may be time for the South African government to review it. There needs to be a better way that I can make money from my book than forcing people to pay for it if they don't want to. I'm not a lawyer, so I'm not even going to make suggestions about how the law should be changed, but I'm sure that looking at how other countries handle this sort of thing would be the first step.<br/><br/>It's disappointing that a small legal complication stands in the way of the <a href=\"http://en.wikipedia.org/wiki/Free_culture_movement\">free culture movement</a> in this country.<br/><br/></div>", "published": "2012-10-15T16:28:00+02:00", "updated": "2012-10-15T16:41:38.514000+02:00", "draft": false, "categories": ["incompetence", "NaNoWriMo", "annoying things"]}