{"id": "on-starting-conversations", "title": "On Starting Conversations", "content": "Particularly phone conversations. To my knowledge, the generally accepted practice is that the phone call is initiated because the caller wishes to start a conversation with the callee. If the caller did not wish to have a conversation, then he would not call.<div class=\"readmore\"> It seemed straight forward and sensible. On a similar note, the callee has no way of knowing the caller's intended topic until the caller reveals it.<br/><br/>When I pick up the phone, and respond simply with \"Hello?\" I never give my name at the end, because who ever is on the other end ought to know who they are calling, otherwise chances are they don't need to know. If they have my number, but not my name, then I'm not sure I want them to know my name.<br/><br/>Earlier this week, the phone rang, and I answered with my usual \"Hello?\" The caller responded with \"Hello.\" and waited for me to respond. I realised then that there was a rather obvious gap in my understanding of the accepted procedure. What happens if the caller does not initiate the conversation. It should occur to him that I was probably doing something else when the phone rang, and I would prefer to continue doing that. While I'd be perfectly happy to have a meaningful conversation with someone, I have (slightly) better things to do than start conversations with complete strangers. If I wanted to do that, I'd phone a complete stranger, wouldn't I?<br/><br/>I wasn't sure what to do, so I resorted to the age old human tactic of forgetting the whole thing. I started again, working on a little more of a questioning tone. \"Hello?\". And the response came: \"Hello.\" and then nothing. I waited a while, and then started the process again. On the third try, I think he finally realised what was happening, and introduced himself, and told me what he was calling for. I wasn't paying enough attention to know what he wanted, so I told him to try calling my father, and hung up. If he didn't have the number, it was too bad. It couldn't have been important, because he would have caught my attention.<br/><br/>(On a side note: If he was a salesman, and he did happen to have my father's number, he would have been my luck. While most people get annoyed to receive a sales call during supper, my father will be genuinly interested. He'd ask a few questions, and then turn to my mother, cover the phone mouthpiece, and say, \"They're redoing gutters in our area, do we need our's done?\" My mother often has to take the phone from him to tell the salesperson that we are not interested. When she doesn't, we occasionally get a random room in our house shampooed and cleaned for free. We've also had far more valuations done on our home than I think is necessary.)</div>", "published": "2009-11-08T16:59:00.002000+02:00", "updated": "2011-05-03T15:02:47.727000+02:00", "draft": false, "categories": ["technology", "incompetence", "annoying things"]}