{"id": "on-some-more-indecisive-mathematics", "title": "On Some More Indecisive Mathematics", "content": "Solution time! I don’t just like to point things out, but I like to answer questions too. <a href=\"”http://alphanumericsheeppig.blogspot.com/2010/03/on-mathematics-behind-indecisiveness.html”\">Last week’s post</a> posed an interesting paradox.<div class=\"readmore\"> Those of you with knowledge of science, mathematics or logic would know that reality does not allow paradoxes, and they always arise out of some misunderstanding. <br/><br/>It’s all a trick, actually. A magic trick, like where the magician slips a coin out from behind your ear, or has an extra card up his sleeve. It’s only a matter of distracting the audience when a third envelope is added into the problem. It was never mentioned explicitly, but I’m sure you all noticed that there are in fact three possible amounts in the calculation, namely 0.5<i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i>, <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i> and 2<i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i>, even though in the problem, there are in fact only two envelopes. The correct solution goes as follows. Let the envelops contain amounts <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i> and <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>y</span></i>. The relation and values between these two is not important at this stage. Assuming equal probability of having either envelope, the expected value is (<i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i>+<i><span style='font-family: Georgia, \"Times New Roman\", serif;'>y</span></i>)/2. Now the relationship <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>y</span></i>=2<i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i> can be introduced, giving an expected value of 1.5<i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i>, which is what intuition tells us anyway. Granted, this is still more than <i><span style='font-family: Georgia, \"Times New Roman\", serif;'>x</span></i>, however, this solution made no assumptions about the contents of the envelope we are holding, so the expected value has a 50/50 chance of being more or less than what we already had originally... Which is what intuition tells us anyway.<br/><br/>Consider now a completely different problem of a similar nature. And this time, there is no paradox, no lies, no hidden tricks. I will be completely honest with you on this one. Consider that there are now three envelopes, and only one contains any money (and I know which one does, but you don’t). I let you choose one envelope at random. I then show you the contents of one of the remaining envelopes, which turns out to be empty. I then give you a choice to either keep the envelop you have, or switch it with the unopened envelope I have.<br/><br/>In this case, the maths behind it all reveals that you are twice as likely to get the money if you change your mind, even though your intuition tells you it shouldn’t make a difference. Think about it for a while, and then read the greatly simplified (rather non-mathematical) explanation in the comment.<br/><br/></div>", "published": "2010-04-04T16:23:00.001000+02:00", "updated": "2013-01-21T14:36:30.014000+02:00", "draft": false, "categories": ["mathematics"]}