{"id": "on-seeing-world-in-polarised-light", "title": "On Seeing the World in Polarised Light", "content": "Polarised light has always fascinated me, but being as stingy as I am, I have always only bought myself cheap sunglasses, so until recently, I have never actually owned a pair of Polaroid sunglasses. <div class=\"readmore\"> Earlier this year, after my previous pair of sunglasses broke in the mid summer sun, I decided to fork out a bit extra and get myself a slightly higher quality pair of sunglasses (although they were about the cheapest in the store when I bought them). I keep noticing things that are absolutely amazing, and I wonder to myself whether people who don't know much about the physics can really appreciate the world around them.<br/><br/>I'm not going to go into the physics here but I will leave links to Wikipedia's <a href=\"http://simple.wikipedia.org/wiki/Polarized_light\">basic explanation</a> and <a href=\"http://en.wikipedia.org/wiki/Polarized_light\">more advanced explanation</a> here.<br/><br/>My first encounter with polarised light was when I was about 8 or 9 years old, and a friend at school showed me that if you turned the filter on the calculator screen over, you could invert the colours of the numbers. I played around with a couple of filters (I wasn't ever afraid of digging broken calculators out of bins - which are more common than you'd think) and discovered that holding them parallel to each other did nothing, but if you turned one of them perpendicular, the intersecting area would darken. I also found that if you used two filters on the calculator display, and the back filter was a little bent or trampled (because you can't be worried about quality when you're digging out of bins), there would be rainbow colours across the screen. I had a nice unique calculator display with a black background and rainbows through the numbers. I was a little disappointed when I got to high school and found that the fancier calculators had no removable filter.<br/><br/>Over the years, I have collected a number of filters from various cheap digital toys, 3D glasses (about the only thing they're good for, since I have very poor stereoscopic depth perception), and the like. I keep them in a little transparent plastic box from which I once freed a set of playing cards. I liked the way that the plastic box had little rainbow patterns when viewed between two filters. In physics during my first year at university, I finally learned a bit about how residual stresses in plastics cause them to absorb and admit light of different wavelengths in differing amounts (an effect known as <a href=\"http://en.wikipedia.org/wiki/Dichroism\">dichroism</a>). That was interesting in itself, but I also learned that sellotape is dichroic. By placing sellotape in layers over a transparent surface, you can create complex patterns of shapes and colours that can only be seen when placed between two polarising filters. <br/><br/>That's all very nice, but it did not prepare me for the experience of seeing the entire world through polarised light. Everything is different. Before I had Polariod sunglasses, I did not really appreciate the way that almost all reflected light is polarised to a degree. In fact, unless the sun is behind you and the surface is reflecting straight at you, the glare from it will be at least partially polarised. That applies to <i>almost every surface</i>. I don't know if I can convey the absolute magnitude of that. <i>Almost every surface</i>.<br/><br/>I don't think I've noticed before how shiny absolutely every surface. Nothing is truly matte, it seems. The interesting part is that normally while wearing polarising sunglasses, the shine off any horizontal surface is greatly reduced (of course, that's the whole point in polarising sunglasses). However, if you tilt your head at 90°, the shine of all vertical surfaces is reduced, and you still get the glare of horizontal surfaces.<br/><br/>I can't remember exactly when I got these sunglasses, but it was around four or five months ago. I still can't get over it. While driving, I continuously tilt my head and watch how the reflections change on the surface of the dashboard, other cars, paving, windows, lakes, and pretty much everything around me. It's also interesting that the displays in my car for the clock, radio, petrol meter and the like all polarise light at 45°. This means that they are dimmed slightly when I'm wearing my sunglasses, unless I tilt my head to the right. If I tilt my head to the left (which is the likely case when I'm leaning over to change the station or volume), the display turns black, and becomes unreadable. I wonder if there's a specific reason for the polarisation angle being the way it is. Anyway, I assume people who see me driving a long just think I'm swaying my head to music or something.<br/><br/>While walking through a nursery over the weekend, I was tilting my head from side to side, looking at the reflections off the plant leaves, when my girlfriend bluntly pointed out that I looked like a retard. I know this, but still. It's just so fascinating.<br/><br/></div>", "published": "2012-07-19T14:18:00.001000+02:00", "updated": "2012-07-19T14:18:51.058000+02:00", "draft": false, "categories": ["awkward situations"]}