{"id": "on-sizes-of-things-in-sky", "title": "On the Sizes of Things in the Sky", "content": "This post was undoubtedly and unashamedly inspired by a certain post at <a href=\"http://theoatmeal.com/\">The Oatmeal</a>. In a recent comic, Inman wrote \"Write a post explaining why the sun and moon appear to be the same size in the sky.\" And so I did.<div class=\"readmore\"> <br/><br/>The truth is that we don't actually see sizes and distances. Each eye picks up a flat, two dimensional projection of the world. Our brain then calculates a couple of angles (or actually retrieves them from a database of interconnected neurons that carefully and automatically arranged themselves to match the outside world during your very early childhood), and you interpret these angles in three dimensions to give distances, instinctively using the distance between your two eyes as a reference.<br/><br/>So, on to the sun and the moon. At any time, the distance from you to the sun is somewhere between 147 and 152 million km, and the sun is just under 1.4 million km across. However, our eyes only see this as an angle. Using elementary trig, this means that we see the size of the sun as an angle of between 0.52 and 0.54°.<br/><br/>The distance to the moon varies a lot more. It could be anywhere from 362 to 405 thousand km away from the Earth, but it's only about 3470 km across, so our eyes see the size of the moon as an angle between 0.49 and 0.55°. In other words, it's about the same angle as the sun.<br/><br/>The reason the angles are similar is that, entirely by coincidence, the ratio of the distance to radius of the sun (at 150 million to 1.4 million) and same ratio for the moon (384 thousand to 3.47 thousand) turn out to be remarkably close together (110 and 108). Because the Earth has an elliptical orbit around the sun and the moon has an elliptical orbit around the Earth, the moon can appear anywhere from 9.3% smaller to 4.8% larger than the sun.<br/><br/>But, since the moon is almost 400 times closer to us than the sun, shouldn't our brains be able to tell us that the sun must be 400 times larger than the moon? Most people's brains (not mine though) are pretty good at judging distances. Millions of years ago, when our distant ancestors were apes climbing in trees, they needed to be able to tell where the next branch to grab onto was, or risk falling to their death. So, evolution placed our two eyes on the fronts of our heads a fixed distance apart, and gave our brains the ability to interpret the subtle differences in the angles that our two eyes see as distances. That is how I know (ignoring my common sense) that the car outside my office window (which appears an 8.6° angle to my eyes) is much larger than my computer mouse (which appears as a 10.4° angle), despite the fact that I can cover the car completely with my mouse (which can in turn be covered by my pinky finger next to my eye). <br/><br/>The catch is that, as the objects get further away, the differences in the angles our eyes perceive also gets smaller at a ridiculous rate. For example, my eyes happen to be roughly 7 cm apart, so the difference in the position of my computer mouse between my two eyes is a whopping 8°, yet for the car outside, it is only a tenth of a degree. That's how my brain knows that the car is almost 100 times further from me than the mouse. Our brains work well with differences of tenths of a degree. They can even deal with hundredths of a degree to a certain extent, but when they get into thousandths of a degree (the sort of angles you get from distant mountains), they start going wobbly. Anyone who's been hiking in an open flat environment can tell you that it's impossible to tell if a hill is two kilometres away or ten. When we look at the moon, the difference in the moon's position over that distance works out to just over a millionth of a degree, and for the sun, it's just a few billionths. Our brains have no hope of perceiving such small angles. (Just for interest, the difference in angles for the brightest star in the sky, Sirius, is less than 5 millionths of a trillionth of a degree.)<br/><br/>So, in short, the sun and moon are the same size for exactly the same reason that you can pretend to squash other people with your thumb, or take photos of some idiot pretending to hold up the Leaning Tower of Pisa.<br/><br/></div>", "published": "2012-04-17T10:26:00+02:00", "updated": "2012-04-17T10:31:39.464000+02:00", "draft": false, "categories": ["mathematics", "sky"]}