{"id": "on-shiny-silver-flying-pizza", "title": "On the Shiny Silver Flying Pizza...", "content": "which I was initially convinced had chicken as one of its toppings, because my mind momentarily chose to hide from me the fact that chickens are actually flightless birds. Within seconds, though, I managed to come to the conclusion that it must be a ham pizza, since pigs fly (I’m sure of it) and the overly processed pork products (salami, sausage, bacon, etc) are much heavier foods than ham.<div class=\"readmore\"> A simple ham and a light mozzarella pizza on a thin crispy base would make the perfect flying pizza.<br/><br/>Although that would not account for the rich silver colour and the overall shininess of the object, which lead me to the conclusion that the object must have been a flying saucer. An insect or two must have found their way into the silvers cupboard and made off with a member of gran’s best tea set. The problem with that theory is it does not offer an explanation as to how the insects opened the cupboard (but I’m certainly not an entomologist, so I would not know whether that is possible or not). In addition, the object was not perfectly round, and the saucers of gran’s silver tea set are – the observation that led to my initial suspicion of a pizza.<br/><br/>There is no doubt that my brain works very slowly at times, but I should point out that the above thoughts passed through my mind in fractions of a second (which is an interesting saying, because a half second is a fraction of a second, so in the plural, several thousand half seconds would be classified as fractions of a second (which acts as my defence against accusations of my writing being contradictory due to my earlier statement of “within seconds”)), and it wasn’t long before I realised that a shiny silver not-round object floating across the sky could be a cloud. A cloud bringing light rain, with a colour like that.<br/><br/>So, maybe in a little longer than most other people would have taken, I managed to conclude that the flying object which I had failed to see had not been a pizza or a flying saucer, but in fact a rain cloud, shining in the reborn strength of the spring sunshine behind it. But, of course, I failed to see this cloud, because this notion of “spring rain” in this part of the country is rare, and only happens one or two years out of five. It is strange how people never remember that usually, the first real <i>summer</i> rains usually only fall around the end of October or beginning November.</div>", "published": "2010-09-09T08:38:00.001000+02:00", "updated": "2012-04-17T10:32:08.321000+02:00", "draft": false, "categories": ["incompetence", "sky", "weather"]}