{"id": "on-squeezing-squirrel-eggs-from-stolen", "title": "On Squeezing Squirrel Eggs from a Stolen Skunk", "content": "To set the record straight, I wasn't the one who stole the skunk. It wasn’t even my idea to steal the skunk in the first place, and I had nothing to do with the whole business. I don’t even think stealing animals is right. In fact I’m against the whole idea, and I don’t even know if the skunk was stolen, or if so, where they found it. This is just not the sort of thing I do.<div class=\"readmore\"><br/><br/>And please don’t ask me how the skunk was laying squirrel eggs. The truth is that I don’t know. In fact, I don’t think I want to know, and I’m not too sure why you would want to know anyway. And since I don’t think it matters, can we please leave that topic alone?<br/><br/>The point that I wanted to make, and I don’t think I got it across in the last two paragraphs, unless you are far more perceptive than anyone could possible have imagined, is that there are no cattle living in my garage. There are no rodents living in my garage either (too the best of my knowledge), not that skunks are rodents. Yes squirrels are, but how is that relevant to my argument?<br/><br/>My argument, which seems to be growing less and less coherent with each word I type; but as you can see, the premises are really starting to build, which is not what counts. What counts is the conclusions you draw from the premise, but why would anyone want it to count. It has no way of sensing it’s environment, so counting is a skill it would never be able to put into practise, and even if it could count, being a set of typed characters, it would have no way to adjust itself to, and express the result it obtained. Much like the universe if you think about it. It’s just expanding, and contains so much information, but none of it is coherent. It’s taken several billion years to get where it is, and doesn’t look anywhere near ready to make its point.<br/><br/>Of course you’d have to squeeze the skunk. Skunks don’t just lay squirrel eggs naturally. You need to force them. I know squirrels don’t lay eggs either, but what has that got to do with the skunk. It’s just a futile effort by the human mind to bring more information into the problem, without trying to solve anything. It’s certainly human nature to try and complicate the solution to things.<br/><br/>Now I’ve gone and complicated it all so much that I can’t even remember what the problem that I started out with. It’s quite obvious that squirrels and skunks must have skunks must have made an appearance somewhere along the line, but I can’t work out where,<br/><br/>I’m just going to have to leave it there, without any point. If you want a point, its probably easiest to just use a pencil sharpener, but some people use a knife. I’ve always preferred to use clutch pencils, because then I just click a button to make the point. Its unfortunate for you that there is no button for me to click to make a point here, but that gives you a taste of what I have to live with every day.<br/><br/>Even if I did manage to make a point, I’d have forgotten why it was necessary by the time I’d made it.<br/><br/>Damn Germans…<br/><br/>(On a side note: Squirrels are very high in cholesterol, and not exactly the healthiest food. However, some people in the UK apparently deliberately eat gray squirrels (an invasive species) in an attempt to save the red squirrels (the local squirrel). I found this so outrageous that I actually needed to give it a <a href=\"http://www.nytimes.com/2009/01/07/dining/07squirrel.html?_r=4&amp;emc=eta1&amp;pagewanted=all\">reference</a>. I personally prefer the gray squirrel.)<br/><br/></div>", "published": "2009-06-14T14:09:00.004000+02:00", "updated": "2013-09-12T12:02:47.999000+02:00", "draft": false, "categories": []}