{"id": "on-security-measures", "title": "On \"Security Measures\"", "content": "Upon entering a store carrying a full shopping bag from another store, the security likes to put a tiny piece of red tape across the opening of the bag. I have yet to see this done with any real effect. <div class=\"readmore\"> In most cases, especially in a bag that is rather heavy, this little piece of tape is not enough to hold the bag closed any longer than 30 seconds. This is extremely awkward for me. It is like an unwritten agreement between you and the security guard at the door that you are allowed in the store only on condition that the bag be sealed by their tape. I feel compelled to honour that agreement and often have to resort to holding the bag in an awkward manner in order to reduce the strain on the tape. <br/><br/>The other day, however, the guard at the door had used the tiniest piece of tape imaginable to tape shut one of the fullest bags I had carried in a while. Despite my best efforts, I was unable to keep the bag sealed, and I eventually gave up after the tape tore down the middle. With visions of a number of armed guards pouncing on me to escort me out of the store, I clutched the bag in a way that obscured the torn tape from view. Eventually, at the till, I had to get my wallet out of my pocket. Without thinking, I removed my hand, and the security guard <i>saw the broken seal</i>. I know she saw it - she was staring directly at it. And yet she did absolutely nothing. I walked out of the store, and tried to nod acknowledgement at her in and inconspicuous manner, and she did nothing. I had always believed that the tape was there to prevent you from shoplifting by putting items in the bag and claiming you had bought them at another store, but considering the evidence against that hypothesis, I am not so sure now.<br/><br/>Speaking of sealed bags and security, I am highly upset with the man at the security check at a certain UK airport who decided that the knotted heavy duty butcher bag that I had put my deodorant in was inadequate. He insisted that I actually <i>pay</i> for one of their inferior resealable plastic bags. I felt like explaining that the so called \"seal\" on such a bag is to stop solid objects from falling out, and is not water tight. I would not be impressed if the deodorant leaked (which mine tend to be prone to doing) all over my bag. In any other circumstance, I may even have explained this, but fortunately I remembered an important rule that I try to live by - keep on security's good side.<br/></div>", "published": "2011-07-25T11:35:00+02:00", "updated": "2011-07-25T11:35:25.459000+02:00", "draft": false, "categories": ["awkward situations", "annoying things"]}