{"id": "on-sports", "title": "On Sports", "content": "I have never really understood the appeal of sports. I guess it’s mainly that I have never managed to grasp people’s desperation for a certain team to win purely due to an arbitrary geographical connection, in spite of whatever odds may be for or against that team, and the pointless arguing and the contention that it inevitably initiates, especially amongst those whose role in the sport is limited to providing moral support.<div class=\"readmore\"> I understand the appeal of being directly involved in a sport - the physical exercise, the sense of achievement (not just of winning, but of scoring points, or of coming close to winning), and the compulsive desire not to lose contribute to the release of endorphins which result in some degree of enjoyment for the players. For the fans, I think it's just a case of choosing to sponge of that enjoyment.<br/><br/>I find it difficult to muster support for a team which I have no real connection with apart from coincidence of geographical location. And once you take away the excitement and suspense that your mind generates if you imagine some form of bond between a team's success and your own happiness, most sports are actually rather boring.<br/><br/>(On a side note: The key to a happy and successful life is to create a similar imaginary bond with something more relevant - say, to the fact that you are alive. It is just as real and as easy as supporting a sport team, with the added benefit that if your team loses, it doesn't matter any more.)<br/><br/>The one sport I do watch though is cricket. Not so much because of the actual game play, because essentially, it's only one person throwing a ball at some sticks, a person attempting to hit that ball with a plank of wood, a third person attempting to catch the ball, and then throwing it back at the sticks. There are a very limited number of significant permutations that can result, and once you've seen the ball bowled a couple thousand times (regardless of the format of the game), you'll have seen almost all there is to the game.<br/><br/>What does make cricket interesting is the shear number of variables that are involved and collected in the game. In international matches played by full members of the International Cricket Council, the approximate trajectory of every single ball bowled is tracked and recorded (up to 600 of them in limited overs cricket, and often a couple thousand in test cricket). In terms of runs alone, the variables are endless. While results are usually decided on a runs per team per match basis, one could also work out a vast number of other relevant statistics, such as runs per batsman, runs per partnership, runs per bowler, runs per batsman per wicket, runs per bowler per wicket, runs per ball, runs per over, runs per innings, runs per opponent, runs per ground...<br/><br/>The endless list of numbers available means that it is easy to use statistics to calculate expected values (I use this term with its correct statistical definition here, not loosely) for certain teams based on their previous performance. For example, it is a simple matter to calculate that the South African team that played Bangladesh last Saturday (Amla, Smith, Kallis, Duminy, du Plessis, van Wyk, Botha, Peterson, Parnell, Tsotsobe, Tahir) has an expected score (excluding extras) after 50 overs of 244/5 (based on past batting perfomance). In order to account for the fact that they are playing Bangladesh (considered to be a weaker side), the expected value of the score can be recalculated to be 248/4 by considering only the average increase in runs for each player against Bangladesh in the past (but not a faster scoring rate). Of course, depending on how each player actually plays, the score can go up considerably - usually at the cost of wickets. The actual score of 284/8 is a perfect example of this. Similar adjustment can be made based on grounds, weather, pitch conditions, recent streaks of good or bad performance by various players, and other parameters. It is possible to calculate an expected value for the number of extras in a similar manner, and it is also possible to calculate another expected value for the score based on bowling averages alone.<br/><br/>Anyway, there's no real point to this post, but the lure of numbers attracts me as always...<br/><br/>(Note: Batting averages were calculated from data at <a href=\"http://www.howstat.com\">Howsat.com - the cricket statisticians</a> and were correct up to 22 March 2011.)<br/><br/></div>", "published": "2011-03-23T17:08:00+02:00", "updated": "2013-01-21T14:13:11.293000+02:00", "draft": false, "categories": ["mathematics"]}