{"id": "on-similar-objects", "title": "On Similar Objects...", "content": "...that are difficult to tell apart. Like a set of car keys and a wallet. Or the house keys and sunglasses. They look different when you look properly, but if you don't think about it carefully, you can't tell the difference. You may not believe me, but it's true. Yesterday, when I got home from work, I put my car keys and house keys on the table, and then went to put my sunglasses and wallet away. Later in the evening, I went to put away the car keys.<div class=\"readmore\"> On the table I found my wallet and sunglasses, which I distinctly remembered having just put away, and no car keys. The house keys were missing as well. Being as lazy as I am, I decided to postpone the whole issue. I went to put my wallet and sunglasses away (for the second time), but when I opened the cupboard and put it down, my car keys were there, but my house keys were not. I looked towards where my sunglasses should have been, and found the house keys.<br/><br/>To confuse objects like this, it is only reasonable to assume that they are similar. Maybe not in appearance, but definitely in terms of weight. If you work out the percentage by which my wallet (which is really light at the moment) needed to increase in weight in order to be within 5% of the weight of my car keys, you can easily calculate what velocity I needed to be travelling in order for relativistic effects to increase the weight. Turns out (based on really, really rough head calculations and vague estimates), I must have been moving at 20 to 40% of the speed of light. And they all said I would never make it at athletics.<br/><br/>Either that or the penguins are messing with my head again. I haven't seen any evidence of them yet, but they could easily have perfected some advanced stealth technique. I don't know if anyone has a secret training project to develop penguin assassins. Well, maybe not training assassins (because I am apparently still alive), but possibly training penguins to switch objects in peoples homes. I don't see the point in this, but I don't see the point in politics either, and that most definitely does exist.<br/><br/>(On a side note: You may not think this practice of rough calculations and vague estimates is a very reliable method, but that's actually what engineering is all about. Have you ever wondered why your doorway is as wide as it is, or why your ceiling is as wide as it is, or why your car windscreen is at the angle it is. It's all because someone sucked on their thumb and pulled out a \"reasonable\" number.)</div>", "published": "2009-03-09T16:53:00.006000+02:00", "updated": "2011-04-07T13:10:52.808000+02:00", "draft": false, "categories": ["engineering", "incompetence", "those damn penguins"]}