{"id": "on-settling-houses", "title": "On Settling Houses", "content": "It’s weird how old buildings have creaks and groans. You actually expect that sort of thing to happen in horror movies, and those houses rarely disappoint. But when your own house starts doing it, it is completely unexpected.<div class=\"readmore\"> Especially when it’s late at night, and you’re home alone.<br/><br/>The piping system in my house has always enjoyed groaning. The pipes would groan whenever a tap was turned on or off in the house, and occasionally, several minutes after a bath had been run, or someone had had a shower, there would be a series of taps and creaks from the roof as the pipes cooled down. When you hear these noises, they are not surprising, since they were caused by something you or someone else in the house did.<br/><br/>Recently, our house has started making the creaking, especially with the end of winter winds that always come in August. I was always led to believe that these noises were just the house “settling”. The noises don’t bother me (I actually like living in a house that likes making noises), and the problem is that I think they should.<br/><br/>Anyone who knows anything about engineering knows instinctively that an unexpected noise is the first warning that something is not right. If your car makes a clunking sound, something’s wrong. Even children know this. If you are climbing a tree, and the branch you are sitting on starts creaking and groaning, you move to a thicker branch. There is a scientific reason for this.<br/><br/>A noise happens when a large amount of energy is released in a relatively short period of time. For example, if you drop something, and it hits the ground, it makes a noise because it has to get rid of its kinetic energy to stop. Or if you snap a branch, it makes a noise because it no longer needs the energy to bond the two sections together. In the case of a structure (like a house), the only energy present is the gravitational potential energy (which is caused by the tendency of the house to fall down. The further the house has to fall, the more gravitational potential energy it has). The only way this energy can be released is in the form of kinetic energy, which means the house is moving. If this kinetic energy were to be lost (which must happen, unless the house is in a free fall), it needs to be dissipated in one of three means. Making a noise is by far the easiest. The second is breaking something, which would in turn lead to a noise. The third is heat caused through friction, which is normally accompanied by some form of noise.<br/><br/>The reason I should be worried, I think, is that each time the house creaks, it is falling slightly. Logic dictates that the house only has a finite number of these noises before it all comes crashing down. I hope it’s just an old penguin with a creaky chair that’s found its way into my roof, because I’d prefer my house to stay up.<br/><br/></div>", "published": "2009-09-06T14:12:00.004000+02:00", "updated": "2013-09-12T11:55:08.499000+02:00", "draft": false, "categories": ["engineering", "those damn penguins", "sound", "houses"]}