{"id": "on-sylvermyst-technologies", "title": "On SylverMyst Technologies", "content": "It was almost 2 years ago that I added the little footnote at the bottom of my blog: \"A <i>Sylvermyst Technologies</i> production.\" Around the time I began this blog, I got tired of forms that asked for an organisation (they're rare, but they exist_, so I just created one. <div class=\"readmore\"> <br/><br/>I can't even remember what the forms were for. I guess I was supposed to put the name of my university, but I really couldn't see why they'd need that. I actually started with the clichéd \"[surname] Technologies\", but a very quick Google search ended that idea very quickly. I changed it a bit, and \"SilverMist Technologies\" was born.<br/><br/>Long-time readers of my blog will remember that in early 2011, I moved my blog over to it's cutrrent domain - alphasheep.co.za - and learned a very important lesson: All of the best domain names are already taken. I decided to buy one before it was too late. There's nothing worse than someone who buys a domain name and then just sits on it without putting anything up, so I used my limited knowledge of html and threw together and a very simple webpage with a link to this blog, and a nice (in my opinion) logo in <a href=\"http://www.gimp.org/\">GIMP</a>.<br/><br/>As I mentioned in my <a href=\"http://www.alphasheep.co.za/2012/09/open-source-and-the-way-people-see-the-world.html\">previous post</a>, I started making plans to release some of my better software (I had to sift through the 50 or so half finished programs I still had for ones that I'd actually managed to finished). Overall, I put together 7 of them which I felt could have some use or entertainment value. The number of finished programs plummeted to zero around the time I my university workload really picked up, and has never recovered. Incidentally, that's around the same time I started this blog.<br/><br/>I had to go digging in a cupboard for a long lost copy of Delphi 7. Funnily enough, I stopped developing in Delphi four years ago, around the time I formatted the computer and found that the disc had mysteriously disappeared. Unfortunately, I still couldn't find the disc. All I really needed to do was add a license bit into the about box of each programs and re-build them, so I made another plan (*wink wink*). Funnily enough, I couldn't get Delphi working on my Windows 7 partition without doing a bit of fiddling, but it worked perfectly under Wine on my Linux partition. Oh, how times have changed.<br/><br/>Incidentally, thanks to an ancient backup disc my brother had made, I also found the little artificial life program that I mentioned in a <a href=\"http://www.alphasheep.co.za/2009/04/on-results-of-boredom-and-not-very.html\">post when this blog was only a week old</a>. Thanks to a <a href=\"http://en.wikipedia.org/wiki/Turbo_Pascal#Issue_with_CRT_unit_on_fast_processors\">major bug</a> in Turbo Pascal, it doesn't run on anything with a processor faster than 200MHz. On my computer at the time (a 300MHz Celeron), I found that a pretty decent workaround was to make sure the processor was kept busy enough that it seemed slower. The easiest way of doing that was to play some music in the background (which is something I always do while programming anyway). When I tried it on a computer with a couple GHz, that no longer worked so well. I was a little worried that I'd never get it working on my current computer with it's four cores providing eight processing threads, but somehow <a href=\"http://www.dosbox.com\">DosBox</a> doesn't suffer from the problem at all.<br/><br/>Anyway, the need to build a new website from scratch motivated me to learn a little PHP, and so I've pieced together a very small, simple website. Go have a look at everything I've done at <a href=\"http://sylvermyst.com\">sylvermyst.com</a>, and check out a couple of the programs I've written at <a href=\"http://sylvermyst.com/software/\">sylvermyst.com/software</a>. Let me know what you think, and of any improvements I could make.<br/><br/></div>", "published": "2012-09-28T09:03:00+02:00", "updated": "2014-01-13T09:15:53.037000+02:00", "draft": false, "categories": ["programming", "more or less nothing"]}