{"id": "on-traffic-circles", "title": "On Traffic Circles", "content": "From the start, just so that there can be no confusion, I'd like to state word for word what the official legislation in South Africa has to say about them.<div class=\"readmore\"> There are two types of traffic circle. Those that are called roundabouts are identified by a circular sign, and the law states that they should be treated as follows:<br/><br/><div style=\"padding:0px 10px 0px 40px; font-style:italic;\"><img src=\"data/images/E1aS_F2h2GE.png\" style=\"float: right; padding:25px; border:0px \"/> \"Indicates to the driver of a vehicle that he or she shall move in a clockwise direction at the junction ahead and he or she shall yield right of way to traffic approaching from the right, <b>within the roundabout</b>, where such vehicles are so close as to constitute a danger or potential danger.\"<br/></div><br/>The other type, called a mini circle, is indicated by yield sign with arrows in the centre and has completely different wording in the law.<br/><br/><div style=\"padding:0px 10px 0px 40px; font-style:italic;\"><img src=\"data/images/IAQGMYhR9CE.png\" style=\"float: right; padding:25px; border:0px \"/> \"Indicates to the driver of a vehicle approaching a mini circle that he or she shall yield right of way to any vehicle which <b>will cross any yield line at such junction before him or her</b> and which, in the normal course of events, will cross the path of such driver's vehicle and that the driver shall move in a clockwise direction within such junction and attempt not to encroach on the mini-circle.\"<br/></div><br/>It is surprising that traffic circles seem to cause so much confusion, because the law is very clear on how they should be treated in each case. The modified and distorted version of the roundabout's rules that everyone loves to state and apply to all traffic circles, regardless, is as follows:<br/><br/><div style=\"padding:0px 10px 0px 40px; font-style:italic;\">\"Give way to traffic coming from your right.\"<br/></div><br/>The closest the actually law comes to saying anything like this is the phrase <i>\"yield right of way to traffic approaching from the right, <b>within the roundabout</b>\"</i>\". It is incredibly unfortunate that those last three words get dropped, because they change the meaning completely.<br/><br/>Now that all of that has been established, I can get onto the absolute idiocy of the <i>\"give way to traffic coming from your right\"</i> rule in the form that an alarming number of people apply it. <br/><br/>Consider a hypothetical type of circle for which this rule applies, and consider the stupid but possible situation at this circle where no one is nice and everyone follows and expects the the rules to be followed to the letter - because people are much meaner when they're protected by a one and a half ton steel cage. Now consider a very busy main road running north/south, with predominantly northbound traffic at a certain time of day. Consider one of these hypothetical circles at the intersection of this main road with a side street crossing from the east and west. Now consider a day of busy traffic, an hour or two before the start of peak time. Northbound traffic on the main road gradually picks up, until there is a steady stream. The side street's traffic volume would lag behind that of the main road by an hour or so, since the majority of traffic faced with a choice will choose the main road, as long as it is flowing steadily. Any traffic approaching along the side street from the east is immediately allowed to enter, but traffic from the west must wait, potentially until the end of peak time, or until someone is nice enough to break the rules and let them through. Understand that this is independent of which street has more traffic, is immutable, and is essentially arbitrarily defined. Also understand that it is rather stupid that a traffic law be arbitrarily defined.<br/><br/>To see the danger of such blindly applied arbitrariness, consider if, on some day, the traffic on the main road is at a standstill, with a steady flow of vehicles approaching from the side street on the east. In this case, whenever the traffic on the main road moves forward, allowing space for another vehicle to pass through the circle, it is always the right of way of the vehicle waiting at the side street. Assuming that there is just enough traffic to keep the side street fed with a steady stream of cars (very much possible during peak time), then the traffic on the main road will <i>never</i> be allowed to go. Consider how stupid this is.</div>", "published": "2011-02-28T13:42:00.001000+02:00", "updated": "2011-09-19T12:42:47.109000+02:00", "draft": false, "categories": ["incompetence", "traffic"]}