{"id": "on-traditional-doctor", "title": "On the Traditional Doctor...", "content": "<em>\"Good news to you...<br/>In God and our fore fathers he never fails!!!<br/><br/>The powerful Spiritual herbalist healer, the one you heard about before his powerful muti. medicines is now next to you here!!!<div class=\"readmore\"><br/><br/>Dr. PNK Mamu<br/>An astrology, herbalist healer<br/><br/>Are you disappointed in your living life??<br/><br/>- Misunderstanding always: Fighting fighting fighting at home, work, school??<br/>- Disappointment always: In relationships, marriage, is he or she cheating on you??<br/>- Are you always worried: No peace in your mind??<br/>- In sexual problems: To be big, long and more rounds penis plus more feeling of love from your loved one??<br/>- Alchohol and drug problems: Do you want to be out of it?<br/>- Suffering in finance/bad luck: Have you been bewitched from family/friends, are they jealous of you? Get of the poverty and get rich!!!<br/><br/>You will be supriced how your problems will be solved in 2 days<br/><br/>Are in stressed A lot? Our herbs<br/>Do you want to win lotto, casino, horses, pass your exams job interviews plus your loved one?? Granted<br/>Do you want to win court cases business attraction, get promotion at work?<br/>Lose weight?? Our herbs<br/><br/>Please call and book before you come in. He is very busy busy<br/><br/>Address<br/>*** ********** * *****<br/>*.*.* ****** ***.******<br/>06th Floor, Room No. 02<br/>************<br/>JHB<br/><br/>Cell: *** *** ****<br/>Tel: *** *** ****<br/>E-mail: *********@yahoo.com<br/><br/>P.T.O<br/><br/>No more stress, no more pain<br/>In 2 days out of your problems!!!<br/><br/>Whites, Coloureds, Indians, Chinese and Africans are all welcome<br/>1. He or she cheating on you/disappering from you? Yr loved one!!<br/>2. Bad luck sent by our enemies/ see your witches by your eyes?<br/>3.Is it small and weak penis/ early ejaculation/ financial problems?<br/>4. Win exams, job promotion, customers, casino, horses, lotto/ get rich?<br/>5. Stolen properties/ back your loved one/ pregnancy/ long periods?<br/>6. Do you have chronic diseases in your body/ misunderstandings?<br/>7. Have you failed your problems with other herbalist healers<br/><br/>(You will be surprised how your problems will be solved in one day)<br/><br/>Miracles tells all about your problems before you say anything to him\\/ Heals over 92 different diseases!!!<br/><br/>Call and book before you come in<br/>The doctor is very busy\"</div></em><br/><br/><br/>The doctor is obviously also quite good at his job. He has an office in the business centre of the city, a telephone line, and an advertising campaign. I have blanked out the address, because I beleive he is sucessful enough to fund his own advertising and doesn't need to rely on me to do it for him for free.", "published": "2009-06-07T14:49:00.006000+02:00", "updated": "2011-03-07T15:31:33.449000+02:00", "draft": false, "categories": ["medicine"]}