{"id": "on-towel-day-part-iii", "title": "On Towel Day Part III", "content": "Oh dear. A post that has been regurgitated a second time... And it's the second one in a row quoting Doublas Adams. But that important time of year has come around again, so in memory of the death of the great Douglas Adams on the 11th of May 2001, and in celebration of the premier of the Star Wars episode IV on the 25th of May 1977, I’d like to remind every geek and nerd out there to remember to be proud and carry their towels with them tomorrow. <div class=\"readmore\"><br/><br/>For does the <i>Guide</i> itself not say: <i><br/><blockquote>      <span style=\"font-size:85%;\">\"A towel is about the most massively useful thing an interstellar hitchhiker can have. Partly it has great practical value - you can wrap it around you for warmth as you bound across the cold moons of Jaglan Beta; you can lie on it on the brilliant marble-sanded beaches of Santraginus V, inhaling the heady sea vapours; you can sleep under it beneath the stars which shine so redly on the desert world of Kakrafoon; use it to sail a mini raft down the slow heavy river Moth; wet it for use in hand-to- hand-combat; wrap it round your head to ward off noxious fumes or to avoid the gaze of the Ravenous Bugblatter Beast of Traal (a mindboggingly stupid animal, it assumes that if you can't see it, it can't see you - daft as a bush, but very ravenous); you can wave your towel in emergencies as a distress signal, and of course dry yourself off with it if it still seems to be clean enough.</span><br/><br/>      <span style=\"font-size:85%;\">\"More importantly, a towel has immense psychological value. For some reason, if a strag (strag: non-hitch hiker) discovers that a hitch hiker has his towel with him, he will automatically assume that he is also in possession of a toothbrush, face flannel, soap, tin of biscuits, flask, compass, map, ball of string, gnat spray, wet weather gear, space suit etc., etc. Furthermore, the strag will then happily lend the hitch hiker any of these or a dozen other items that the hitch hiker might accidentally have \"lost\". What the strag will think is that any man who can hitch the length and breadth of the galaxy, rough it, slum it, struggle against terrible odds, win through, and still knows where his towel is is clearly a man to be reckoned with.\"</span></blockquote></i><br/><br/>Even if you never read the <i>Guide</i> and don’t understand the significance of <a en.wikipedia.org=\"\" href=\"http://www.blogger.com/%E2%80%9D\" http:=\"\" towel_day”=\"\" wiki=\"\">Towel Day</a> do it for the sake of <a en.wikipedia.org=\"\" geek_pride_day”=\"\" href=\"http://www.blogger.com/%E2%80%9D\" http:=\"\" wiki=\"\">Geek Pride Day</a> tomorrow. And if you are really so geeky that a towel is not enough for you, then make sure to carry your hard boiled egg and lilac with you for the <a href=\"http://wiki.lspace.org/wiki/Glorious_Revolution\">Glorious Revolution</a> of the 25th of May, as a tribute to Terry Pratchett, and to help raise awareness for Alzheimer's research.<br/><br/></div>", "published": "2012-05-24T11:28:00.001000+02:00", "updated": "2012-05-24T11:28:21.529000+02:00", "draft": false, "categories": []}