{"id": "on-tossing-sheep", "title": "On Tossing Sheep", "content": "They don't usually go very far. It's not because I can't throw (or more correctly, only partly), but more because sheep are badly designed. The first major issue is that they are difficult to hold. The sheep's body has nowhere that allows a good grip to be maintained while still allowing room for a decent swing.<div class=\"readmore\"> The sheep has four legs, which allows for two people to swing it between them and cover a reasonable distance. However, there is not always an assistant available, and when trying to swing a sheep by the legs alone, one finds that the two free legs tend to get in the way, making the throw awkward.<br/><br/>Then there is the issue of weight. Sheep can be quite heavy, which means that you need a lot of force to get a decent launch speed. There is also the problems of aerodynamics and stability. In flight, sheep tend to roll around, and it is difficult to get the sheep to land in the any specific position. The woolly coat is uneven and a symmetrical, leading to a significant drag increase, as well as a steady sidewards force. Together with the constant turning in flight, this can really mess up the planned trajectory.<br/><br/>There are two possible solutions to this problem. The first is to make some modifications to the sheep. Choose a smallish sheep, and strap two legs to it's body (for best results, do this to one front leg and one back leg). To save time, you may wish to choose a three (or even two) legged sheep, if you can find it. Then wrap the sheep in insulation tape, being careful to ensure that the sheep is symmetrical. You may wish to brace the neck, as the sheep tends to try look around, and this can lead to a very unstable flight. To the tail, attack some stabilising fins. Hold the sheep by the two free legs, give it a few good swings, and release it when near the top of it's arc. With practice, you may be able to get the sheep 50% further than a conventional sheep.<br/><br/>The second option is to review the projictile selection process. Sheep may have been a bad choice of animal to toss in the first place. Chickens, which are significantly lighter than sheep and have two legs, make remarkably good projectiles, provided you tie their wings back (flapping wings tends to lead to an inaccurate toss). Rabbits fly especially far, possibly due to the additional stability provided by their ears. (This point may be disputed, since the ears seem to add nothing to a donkey's flight)</div>", "published": "2009-03-15T11:57:00.004000+02:00", "updated": "2011-04-07T13:15:03.430000+02:00", "draft": false, "categories": ["engineering", "domesticated animals"]}