{"id": "on-transit-of-venus", "title": "On the Transit of Venus", "content": "I just happen to live on that magic line along which <a href=\"http://en.wikipedia.org/wiki/Transit_of_Venus,_2012\">Venus's transit across the sun</a> ends exactly at sunrise. <div class=\"readmore\"> For most of South Africa, it won't be visible at all, except for parts of Limpopo, Mpumalanga and the northern corner of KwaZulu-Natal. Along the Swaziland border, it will be visible for as long as 15 minutes after sunrise. That is, if you can find a high enough spot that the damn horizon isn't in the way.<br/><br/>The reason I bring up the transit is that, like with eclipses, all the news sources talk about methods for viewing solar events. Of course, everyone knows that you should never look at the sun directly unless you want to go blind (even looking for a couple of seconds can cause permanent damage).<br/><br/>The alternatives that are usually mentioned are the trick involving projecting sunlight from a pinhole onto a piece of paper, or wearing welding goggles or specially rated solar glasses (sunglasses do not provide sufficient protection).<br/><br/>The alternative that is very rarely mentioned is that the camera on your cellphone is ideal for viewing solar events. I used the camera on my cheap cellphone to photograph a <a href=\"http://www.alphasheep.co.za/2010/11/on-ring-around-sun.html\">halo back in November of 2010</a>, and you can see how well that worked. You can take decent pictures of eclipses just by pointing your camera at the sun. It is very important to keep your head in the shadow of some object so that you cannot directly see the sun, and hold your arm out into the sun using the screen to see where your camera is pointing. You will need to look at the screen at an angle to achieve this. Don't point the camera at the sun for too long at a time unless you have a solar filter. And, whatever you do, don't look at the sun directly, and don't look through any eyepiece of a camera at the sun. Keep your head in the shade and watch the sun on your screen.<br/><br/>Unfortunately, this trick won't work so well with the transit of Venus, since Venus will be a tiny spot on the sun, and the glare from the sunlight will pretty much obscure it completely for your cellphone camera. You can reduce the glare considerably, however, by taking the photograph through the wind shield of a car (many of which are treated for glare), and holding a pair of sunglasses over the camera lens. The cheaper and simpler the camera, the better, since it's more likely to automatically adjust the light levels in the picture, rather than requiring you to set it. You certainly won't get professional quality photographs like this, but at least you'll see what's going on.<br/><br/>(On an interesting side note: Nobel prize-winning physicist Richard Feynman watched the first ever detonation of an atomic bomb from 20 miles away with no more eye protection than the wind shield of a truck, because he insisted that you wouldn't see anything through the special goggles they had been given, and the glass of the truck had been treated to block UV rays. He later boasted that he was probably the only one who actually saw the explosion. [Source: <a href=\"http://www.amazon.com/Surely-Feynman-Adventures-Curious-Character/dp/0393316041\">Feynman, R.P. <i>Surely You're Joking, Mr. Feynman!: Adventures of a Curious Character</i>, W. W. Norton &amp; Company, 1985.</a>] Note that the wind shield of a truck does <i>not</i> provide sufficient protection for looking directly at the sun.)<br/><br/>(On another side note: It's not at all difficult to get professional quality solar photographs from the camera of an average smartphone. All you need is a tripod and a special solar filter.)<br/><br/>What I am curious to see is whether or not the shadow of Venus will be visible on the surface of the moon (which is just two days past full, and should be fully visible in the western sky during the transit). For reference, if you are interested, Venus will be at the middle of its transit at 03:30 SAST tomorrow morning, and will be in transit for just under three and a half hours on either side of that mark.<br/><br/>[Edit - 6 June 2012, 07:56 SAST: My very first thought as I woke up this morning was that I had been an idiot thinking that the shadow would be visible on the moon. It makes me wonder what my subconscious does while I'm asleep. I didn't even know yet that I was awake when I realised it. My eyes were still shut. I literally was sleeping one second, and the next second I was awake thinking \"The shadow won't be visible on the moon and I'm an idiot, and by the way, its morning now.\"<br/><br/>Of course, most of the sunny side of the moon would have had a full view of the transit just as good as we had on Earth (actually, Venus would appear 0.6% smaller), but the fact is that Venus only blocks out a small fraction of the sun (0.095% of the light from the sun, according to my quick calculations). And that light would be blocked for most lit side of the moon. So, the net result is that there would have been a really, really slight (no where near perceptible) dimming of the entire moon after midnight last night, and that would be all.<br/><br/>Of course, its always interesting to look at the moon through a pair of binoculars, so that realisation did not stop me.<br/><br/>(On a side note: Most people know how to estimate the time from the position of the sun, but very few can tell the time from the position of the moon. Maybe I should do a post about that some time...)]<br/><br/></div>", "published": "2012-06-05T20:49:00+02:00", "updated": "2012-06-06T08:09:46.867000+02:00", "draft": false, "categories": ["sky"]}