{"id": "on-the-elusive-PhD", "title": "On the Elusive Doctor of Philosophy", "content": "The number one problem with a PhD is that no one really knows what you need to do to get one. Over the past few years, I've been asked too many questions like \"When will you finish?\" and \"How many pages does your thesis have to be?\" The answers are actually surprisingly simple: \"When I'm done\" and \"Enough\".<br/><br/><div class=\"readmore\"> I'll start by telling you about the official Rules and Syllabuses of my faculty. This is a three hundred and something page document that goes into a lot of detail into what you need to get various degrees. For undergraduate courses, it will go into some detail about what courses of specific lengths you need to take, how many credits each course is worth, the minimum number of credits required in each year, and summarises the basic requirements for each course and how they are assessed and examined. When it comes to a PhD, though, the rules are pretty vague. Here's what it says: <br/><br/><blockquote><b><i>Conditions for the award of PhD:</i></b> <br/><br/>A candidate for the Doctor of Philosophy shall –<br/><ol type=\"a\"><li>present for the approval of the Senate a thesis which must constitute a substantial contribution to the advancement of knowledge in the subject chosen, which thesis must be satisfactory as regards literary presentation.</li><li> present himself/herself for such assessment as the Senate may determine.</li></ol></blockquote><br/>There's a little more about admission requirements, having an advisor, examiners, something about spending a minimum of two years, and a how many copies of the final thesis need to be handed in (it's five, by the way, not counting the electronic copy), but that covers the gist of it. In summary, I need to do some research and write a thesis on it. Nothing about a page count at all. There's just that one requirement: it \"must constitute a substantial contribution to the advancement of knowledge in the subject chosen\", whatever that may be.<br/><br/>Naturally though, after a few years of research, one can produce a hell of a lot of rubbish. When writing up a thesis, it's natural to start to wonder how much of that actually needs to go in.  How much of it would be considered an acceptable amount of filler material to bulk up the actual content.<br/><br/>My University has been operating for a little under a century, and there's a basement level in one of the libraries that is packed with past theses arranged by subject. You could walk through there to try figure out how long a thesis should be, but there are many there that are five or six hundred pages long, and some that are just a few dozen. However, it's not to difficult to see that theses written under the same advisor often land up being similar lengths.<br/><br/>So, curious as to where I stood (and because I'm sick of endlessly processing results), I went down to the library and pulled down five recent theses in my field that had been written under my advisor. So, instead of plotting the results of my experiments, I plotted a breakdown of each of those theses and compared them to what I have at the moment. The similarities in length and structure are clear.<br/><br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/UrZptLq9UCo.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"data/images/UrZptLq9UCo.png\"/></a></div><br/>That's me on the right, just next to the average thesis. My introduction is a couple pages longer than average (with about 2 pages left to write), and my methodology is about 7 pages below average (although I shoved about 20 pages into an appendix, so maybe it's longer than average), and my conclusion is a blank page right now.<br/><br/>It's reassuring to see that my results are the only thing left to type up. And with more than 600 photographs from experiments to process, and 260 GB of data from computer simulations to sift through, I don't think I'm going to have a problem adding the 81 pages that will take me past the average thesis.<br/><br/>I was hoping to finish by the end of this month, but here I am procrastinating again. It looks like I may just need a little bit longer...<br/><br/><br/></div>", "published": "2014-02-19T20:21:00+02:00", "updated": "2014-02-19T20:21:57.537000+02:00", "draft": false, "categories": ["engineering", "more or less nothing", "libraries"]}