{"id": "on-those-somewhat-serious-tones", "title": "On Those Somewhat Serious Tones", "content": "I've always found that I tend to take on a most seriously formal tone in my mind when proof reading my writing, even when my tone was very relaxed and casual when my mind was dictating to my hands what to write. <div class=\"readmore\"> I recently bought myself a cheap headset and have started recording my voice, and to my surprise, I found that the relaxed and casual voice that is constantly echoing inside my head comes out as slightly boring and monotonous - essentially the same as my mental proof reading voice. <br/><br/>I've always liked the sound of my own voice. Not in the figure-of-speech sense that would imply that I talk a lot (although I can, if you get me started, but that's more because my mind just starts throwing things at me, and my mouth just has to do its best to keep up). It actually came as quite a shock to me to hear my recorded voice (which is very different to hearing your voice over speakers while you are speaking). <br/><br/>My mind works incredibly slowly. I like to think it's because it's an incredibly complex machine that has far too many intricate parts, so it takes a while for them to all come together and give me a final thought, but really, that's just another way of saying my mind is easily distracted. Anyway, the net effect of this is that my voice sounds much slower when I speak out loud than when I say it in my head, even though they seem to take the same length of time to say. It may sound contradictory, but if you were in my head, you'd know what I mean (obviously).<br/><br/>(On a side note: I'm eating my mother's chicken curry while writing this - easily one of my favourite dishes of all time. Her secret ingredient is apples, which practically disintegrate into the creamy sauce to sweeten it up and balance the flavours. It's just hot enough to tingle on your lips and leave a comforting glow down the back of your throat for a few minutes after eating it, but not so hot that you break into a sweat. And the uniform yellow colour means that I can eat it in what ever order I like, as long as I pick out the chunks of chicken first.)<br/><br/>(On another side note: I'm not sure why, but my thoughts have been very incoherent recently. I really struggle to pick one thought at a time from the hundreds my subconsciousness throws forward. Incidentally, this started shortly after I started my current box of Omega 3 supplements. They are now yellow capsules (they used to be red), have different ingredients, and come in different packaging. I am starting to doubt that they are even the same thing. If only I was more fond of sea food.)<br/><br/></div>", "published": "2012-04-26T11:50:00+02:00", "updated": "2012-04-26T11:51:26.211000+02:00", "draft": false, "categories": ["sound", "tuna", "language"]}