{"id": "on-wishy-washy-nature-of-reality", "title": "On the Wishy-Washy Nature of Reality", "content": "It has always amazed me (In case you haven’t worked it out by now, I spend my life in an eternal state of amazement and wonder) that people are prepared to believe so much with absolutely no evidence.<div class=\"readmore\"> I like to think that I question everything I hear (even though I really don’t come close) and I like to look at everything from as many angles as possible before I accept them. My entire world is built on simple principles that I accept based on inductive reasoning, and where there is not enough support for induction to provide a conclusion, I satisfy myself that I can’t develop any firm belief. I guess, technically speaking, I could be regarded as a <a href=\"http://en.wikipedia.org/wiki/Philosophical_skepticism\">philosophical skeptic</a> although I have never really considered myself one. As a result, I have, essentially, no firm beliefs whatsoever. <br/><br/>(This is getting very close to my religious beliefs, which is a subject I was always going to avoid in this blog. Suffice it to say that I usually list my religion as <a href=\"http://alphanumericsheeppig.blogspot.com/2009/04/on-religion.html\">Potato</a> and that I will now try to steer this post away from that topic.)<br/><br/>This sceptical nature, which to me seems the only sensible approach to life, actually seems rather rare in the real world. Ignoring the millions of self help books and get-rich-quick schemes out there, there are millions of little so-called “facts” and “scientific explanations” that people randomly believe.<br/><br/>(On a side note: The best get-rich-quick scheme, and the only one that works is to come up with (or steal) a brilliant idea or product that people like (or think they like), work out how to get people to pay you willingly for having that idea or product, and then sacrifice every aspect of your life for the endless hours of hard work you will need to put into marketing your idea or product.) <br/><br/>(On another side note: The common explanation for how an aircraft wing generates lift – that goes into how one side is longer, and the air flows faster etc. – has always annoyed me. I have no idea how the incorrect explanation started, since the correct explanation is far simple. The wing is at an angle so that it pushes the air downwards, and by <a href=\"http://en.wikipedia.org/wiki/Newton's_laws_of_motion#Newton.27s_third_law\">Newton’s action-reaction law</a>, which everyone knows but loves to misquote, the air is also pushing the wing up at the same time. Very simple.)<br/><br/>Interestingly enough, I can pinpoint the reason why people are so ready to accept fiction passed off as fact. I cannot say how it started, but the human race in general seems hesitant to explain the concept of imagination to its children. It is perfectly acceptable for children to watch a show in which some animals and inanimate objects act human, while others carry behave as in the real world. As if this wasn’t confusing enough for the children, there are large numbers of parents who are not prepared to explain that the animals and inanimate objects only talk in the universe that someone has imagined. They can’t explain that what happens on the TV is fictional and does not really happen in real life. In particular, <a href=\"http://www.iol.co.za/business/companies/pay-channel-fined-for-horror-advert-1.1008510\">a local TV station was fined yesterday</a> for showing an advert for a horror movie festival, which contained some graphic scenes from a variety of horror movies, during prime time. I agree that it should not have been done, and I agree that they should be fined. What disturbs me is what one viewer said in response:<br/><br/><blockquote>“How do I explain to a five-year old the stuff she saw - a child sitting in front of a television and something coming out of the TV and grabbing her or the lady in the shower washing her hair and then there’s a hand in her hair coming out of her head?”</blockquote><br/>The answer is very simple. You explain the difference between fact and fiction, explain to your child that he/she shouldn’t believe everything they see on TV, and encourage other parents to do the same, and perhaps in 20 or so years, the world will be a better place.<br/><br/></div>", "published": "2011-01-06T12:30:00.002000+02:00", "updated": "2013-01-21T14:19:13.318000+02:00", "draft": false, "categories": ["incompetence", "advertising", "philosophy", "annoying things"]}