{"id": "on-walkies", "title": "On \"Walkies\"", "content": "There is a woman who lives down the road from me. She is about fortyish with long blond hair, and a pointy nose, and a dress sense that immediately places her in the stereotype that screams out that, twenty years ago, this woman was an activist for any cause there was.<div class=\"readmore\"> It also hints that the woman believes in “new age” something or other, and reads a lot about “spiritual” whatevers. (On a side note: stereotypes are usually right.) She also believes that animals should not be confined. This makes life interesting when she takes her dogs (of which she has five) for their daily walk.<br/><br/>Actually, the word “takes her dogs for” is a little inaccurate here. A far more accurate way of putting it would possibly be “lets her dogs have”. Or maybe, “frees some untrained animals for”. The gate to her property opens, at some point in the afternoon each day, and three of the dogs begin causing chaos in the neighbourhood (I have seen the other two leave the property only once). She walks around the block three times, before returning to her house, waiting for all of the animals to return, and then shuts the gate. In the time she spends walking, the only time a dog will come within two hundred metres of her is when one comes tearing past, chasing a car, butterfly or imaginary scent. In the mean time, the dogs dig up pavements, start fights through fences, and make futile attempts at mating with everything in sight, be it dog, cat, peacock or bicycle.<br/><br/>This is not the strangest dog walker in our neighbourhood though. There is another woman who is too lazy to go walking. Instead, she leans out the window of her BMW, holding the leashes for her two dogs as she drives around the block. I used to think this was rather special, until a couple of days ago. Driving past a park, I saw a red 4x4 driving off-road through the park, with a dog on a leash held by an arm out the window. I wonder where laziness will have taken us in a hundred years time...<br/><br/></div>", "published": "2009-12-13T16:05:00.001000+02:00", "updated": "2013-09-12T12:34:36.611000+02:00", "draft": false, "categories": ["incompetence", "stereotypes", "domesticated animals"]}