{"id": "on-winter", "title": "On Winter", "content": "The colder side of winter is definitely here. Its freezing (according to my standards, at least). Being slightly bored, I decided to apply my mind to the problem. The simple solution is that everyone in North and South America simultaneously move into their northernmost neighbour’s residence, and at exactly the same time, everyone in the rest of the world moves into their southernmost neighbour’s residence.<div class=\"readmore\"> This would change the axis of rotation of the Earth very slightly, effectively countering the movements that everyone made. The Americas would slowly begin to drift south, and the rest of the world would drift north, meaning that South Africa would get closer to the equator, and grow a bit warmer.<br/><br/>Being bored, I did all the necessary calculations to see what would happen. The movement of the world’s population would impart a total of more than thirty seven thousand Gigajoules of rotational kinetic energy to the Earth. Of course, people move all the time, but people move in random directions and the energies all cancel out. An orchestrated move will result in kinetic energy that is not cancelled out. (I estimated that the human population of the world is 388 billion kilograms. That’s a lot of mass to move...)<br/><br/>This may sound like a lot of energy, but it’s not really. The Earth itself weighs 15 trillion times more than the entire human population, so you have to look at this sort of thing in context. The energy is still enough to cause an angular rotation about an equatorial axis of about a trillionth of a radian per second (which for the non-engineers of the world, translates to a net northward motion of my house of about 3.7 metres a week). This does not sound like much, but within 2600 years, my house will be in the tropics. I’m not selfish, you see. You have to think of the future generations.<br/><br/></div>", "published": "2009-06-28T15:03:00.004000+02:00", "updated": "2013-01-21T15:23:54.802000+02:00", "draft": false, "categories": ["mathematics", "weather"]}