{"id": "on-why", "title": "On \"Why?\"", "content": "In my years of being an arrogant know-more-than-most-people, I have learnt that even though people constantly ask “Why does this happen?” and “How does that work?”, they don’t really want to know why. They are satisfied with a superficial basic answer, and get frustrated if your answer goes too deep.<div class=\"readmore\"><br/><br/>(On not a side note, since it is actually relevant here: I hate the term <i>know-it-all</i> because even I openly admit that I don’t know it all. I just know more than most people because I read a bit more than average, and my curiosity takes me deeper than most people like go. If I want to know why something happens, or how something works, I look it up, and I don’t stop after just a basic understanding.) <br/><br/>A good example is the popular question “Why is the sky blue?” At the time of writing this, this question in Google gives well over 26 million results. Most of these start off by describing the electromagnetic spectrum (in most cases, limiting it to the narrow range of visible light, even neglecting to mention the vast (technically infinite) range of other types of electromagnetic radiation, which differs from light only in that human eyes cannot detect it), followed by a brief description of how the atmosphere consists of particles (if you’re lucky, these particles are molecules. Often they are called atoms (which are actually rarely alone up in the sky), but more often, they are called dust or pollen. In reality, it is everything from the molecules, to the dust particles to natural density fluctuations in the atmosphere). This is followed by a description of how light (treated as a wave, despite the fact that modern physics considers light as a stream of particles when it interacts with matter) of different colours bounce at different angles off the particles in the atmosphere. Blue light is scattered more than other colours (which is not true, but within the range of colours the human eye is most sensitive to, it is close enough), and so blue light gets projected across the sky, and we see it as blue.<br/><br/>Most of them are valid explanations (once you correct the minor inaccuracies that arise from the authors’ own misunderstandings), and most people are satisfied. However, I am not.<br/><br/>The technical term for the scattering of light at the molecular level is called Rayleigh scattering. A Google query for “why is the sky blue rayleigh” gives just over 30000 results. The scientific theory that is used to (very accurately, despite its few shortcomings) model the interactions of light with matter is quantum electrodynamics. However, the number of results for “why is the sky blue quantum electrodynamics” is only around 7000. And the number of people out there who have a solid enough mathematical background to apply the necessary partial differential equations in the realm of complex probability amplitudes, and then solve them (even approximately with the aid of the world’s most powerful supercomputers) for something as simple as steady unidirectional white light interacting with a homogeneous mixture of diatomic nitrogen and oxygen molecules mixed at a ratio of 3.71:1 is practically zero. And quantum electrodynamics is just an approximation of reality. Wait until the real Theory of Everything is found... <br/><br/>What I am trying to get at (in a very roundabout way) is that a lot of people show a healthy curiosity and ask the question “Why?” about lots of things. But, as soon as the answer gets to the realm of basic physics, they are satisfied. Why people cannot accept such simple principles such as “The sky is blue” but do accept “particles scatter different colours differently” is beyond me.<br/><br/>I am satisfied by the fact that I cannot have the answers to everything, but I still refuse to stop asking “Why?” and understand as much as I can.<br/><br/></div>", "published": "2011-01-24T13:27:00.002000+02:00", "updated": "2013-01-21T14:22:01.813000+02:00", "draft": false, "categories": ["people", "incompetence", "annoying things", "mathematics", "sky"]}