{"id": "on-workload-productivity-correlation", "title": "On the Workload-Productivity Correlation", "content": "You may have noticed the steady decrease in interesting posts on this blog over the past few months. I have managed to correlate this with my workload.<div class=\"readmore\"> When the blog started, I was writing software for vacation work. It was nice and challenging, but I was still managing to get roughly 10 to 12 hours sleep a day, 6 days a week. My mind was operating perfectly under those conditions, and at maximum creativity. After three weeks, I went back to university, and started as a final year engineering student, with probably the biggest workload possibly imaginable. My sleep was immediately cut back to 5 hours a night (and I blame this for the nonsense my imagination spawned during that time). In June, I wrote my final exams, and suddenly, with the work pressure gone, my minds activity dropped too. The posting rates for June and July were 30% lower than the pace I had been maintaining for the first half of the year... However, August saw the approach of the first deadline for the biggest research project I had ever undertaken. The posting rate shot up. On the 17th, I had to present my research findings, and then submit a twenty thousand or so word paper later that week. I should have spent the 16th rehearsing and tweaking my presentation, and typing the report, but I typed up no fewer than six posts for my blog that day. After I finished my degree in October, I had almost nothing to do, and you can see the immediate drop in both the number of posts, and how interesting they are. I started reading for my Masters degree in November, but there has not really been any pressure to work. My mind has been fairly inactive since then. This is the reason that you now get four to five posts a month instead of nineteen, like you once were. I am even struggling to get one post a week; my mind is so bored... I need a challenge. I should probably just be more focused and work harder, but I can’t help it. I’m a naturally lazy person. You may ask what the point in this post was, but I can’t tell you myself... It’s just an observation.<br/><br/></div>", "published": "2010-03-28T17:48:00.001000+02:00", "updated": "2013-01-21T14:36:40.152000+02:00", "draft": false, "categories": ["engineering"]}