{"id": "on-zombie-rodents-part-ii", "title": "On Zombie Rodents: Part II", "content": "As if rats weren’t already rather <a href=\"http://alphanumericsheeppig.blogspot.com/2010/06/on-zombie-rodents.html\">zombie-like</a> creatures (apart from the quicker movements), there is a <a href=\"http://en.wikipedia.org/wiki/Toxoplasmosis\">parasitic disease</a> which affects their brain function.<div class=\"readmore\"> The parasite can infect most complex vertebrates, but can only breeds in cats, and is somehow aware of this. Somehow, the parasite has evolved the ability to increase dopamine levels in the part of the brain that controls emotional responses in the brain. Somehow, by doing this, the parasite is capable of replacing a rodent’s fear of cats (without affecting it’s other fears) with an urge to go into areas that are marked with cat urine – leading the rodents to be eaten by cats...<br/><br/>I wish I could say that this disease only affects rodents, but unfortunately, it does not. It can be carried by most complex vertebrates, including humans. I also wish it was rare, but it is not. In fact, it has been estimated that between 30% and 65% of the world’s population carry the virus, and it has several psychological effects on people. In particular, a <a href=\"http://www.biomedcentral.com/1471-2334/9/72\">study</a> carried out on draftees at the Central Military Hospital in Prague between 2000 and 2003 found that those infected with the parasite were up to <i>six times more likely</i> to have a traffic accident than those who were parasite free (when coupled with an Rh- blood type). It has also been linked to reckless and antisocial behaviour, and several studies have shown that the disease is especially prevalent in schizophrenics.<br/><br/>The world truly is a fascinating and scary place.</div>", "published": "2011-01-31T10:44:00.002000+02:00", "updated": "2011-04-07T13:15:35.198000+02:00", "draft": false, "categories": ["incompetence", "domesticated animals"]}