{"id": "pagerip", "title": "On Video Game Programming - Part II: Page Ripping Champion 2013", "content": "<div class=\"readmore\"> Back in May, I <a href=\"http://www.alphasheep.co.za/2013/05/on-video-game-programming.html\">announced my intention to develop a game</a>. I spent some time messing around with 3D engines, and was pretty happy with my progress. But then life and work got in the way, and it all ground to a halt. However, I did find time to lurk in the back of the last couple of meetings of the <a href=\"http://www.makegamessa.com/\">South African game development community</a> (which is actually far more active and talented than I'd imagined). Last month, they ran a competition, with an actual deadline that motivated me to actually do something. The only constraint was that the game could only use two inputs.<br/><br/>So, </div> I bring you a video game. No, it is not 3D, and actually has absolutely nothing to do with what I'd said I'd do, but it is more or less complete, relatively bug-free, and actually surprisingly enjoyable to play, if only for five minutes. I present to you: <a href=\"http://sylvermyst.com/PageRippingChamp/\">Page Ripping Champion 2013!</a> <div class=\"readmore\"> <br/><br/><div style=\"text-align: center;\"><a href=\"data/images/W7LzxYznvh8.png\"><img border=\"0\" src=\"data/images/W7LzxYznvh8.png\" width=\"520px\"/></a></div><br/>The player controls a pair of hands using the F and J keys and tries to pull out all 250 pages in a book. Points are awarded for good technique and deducted for bad technique. If you use a single hand for too long, then that hand cramps. If neither hand is moving, then all bonuses are dropped. If this happens too often, then it's game over.<br/><br/>It was written in <a href=\"http://python.org/\">Python</a>, using <a href=\"http://www.pygame.org/news.html\">pygame</a> for graphics, and <a href=\"https://code.google.com/p/pgu/\">PGU</a> for the text. Graphics were very quickly thrown together in <a href=\"http://inkscape.org/\">Inkscape</a>. The game runs on both Linux and Windows. I hope you enjoy it.<br/><br/></div>", "published": "2013-08-12T12:32:00.001000+02:00", "updated": "2014-02-24T08:50:17.921000+02:00", "draft": false, "categories": ["programming", "game development"]}