{"id": "petrol-price", "title": "On Why South Africans Don't Really Mind Petrol Price Hikes", "content": "South Africans love to complain, but I never see their words affect their actions. Sure the petrol price has an obvious affect on how much you land up paying to fill up your tank, but there are other factors that influence it too. Its difficult to take someone seriously if they complain about the petrol price after they've just bought an SUV, and even more so when you watch cars flying past on the highway at 140km/h<div class=\"readmore\">. If people were really concerned about the price of petrol, we'd see people buying smaller cars, and driving slower.<br/><br/>It's all very well to say this, but I'm basing it all on anecdotal evidence. It <i>seems</i> as if people are driving the same speed, and it <i>seems</i> that they're still buying larger cars, but what do the actual figures say?<br/><br/>It seems that no one in South Africa regularly reports statistics on traffic related charges. In fact, apart from a single report for KZN in 2007, I could not find anything about the number of speeding fines issued in a given period. Unfortunately, this means that my impression that people are driving just as fast as they were a few years ago will have to remain unconfirmed. However, we do have data on vehicle sales and the petrol price, so we'll just have to concentrate on those.<br/><br/><br/><span style=\"font-size: large;\">    <b>Fuel Prices</b></span><br/><br/>It's quite easy to find out past fuel prices. The AA of South Africa kindly lists <a href=\"http://www.aa.co.za/on-the-road/calculator-tools/fuel-pricing.html\">past fuel prices</a> for each month going back to 2008. The fuel price, as you're probably aware, has been steadily increasing over over that entire period. The exact value of the fuel price depends on whether it is sold at the coast or inland, and on the octane rating, but since I live inland and use 93 octane fuel, I used that price. Whichever price you choose to look at, however, the trend remains exactly the same.<br/><br/><br/><span style=\"font-size: large;\">    <b>Vehicle Sales</b></span><br/><br/>Data on vehicle sales is a little harder to find. The National Association of Automobile Manufactures of South Africa (<a href=\"http://www.naamsa.co.za/\">NAAMSA</a>) publishes vehicle sales data, broken down by manufacturer. The catch is that their <a href=\"http://www.naamsa.co.za/flash/portal.asp\">public access \"Flash Results\"</a> are the only freely available results that they publish, and they don't seem to keep data for previous months. Fortunately, our old friend Google does. There are a number of sites that publish the NAAMSA flash reports from time to time, and so using search phrases like <a href=\"http://www.google.com/#q=inurl:pdf+naamsa+%22new+vehicle+sales+statistics%22+may+2011\">\"inurl:pdf naamsa 'new vehicle sales statistics' may 2011\"</a>, I managed to find a complete record going back to January 2009. <br/><br/>These reports include a breakdown of sales by engine size for Associated Motor Holdings (Hyundai, Kia, etc.), and as of July 2009, Amalgamated Automobile Distributors (Chana, Foton, etc.). While ideally I'd like to include a lot more manufacturers in my analysis, and the reports do contain more detailed sales data for most other manufacturers, these figures don't help me unless they are combined and aggregated - a classic case of too much information being useless. (Of course, I could do this manually, but that would take too much time. I could also pay for access to more detailed information which just might contain the aggregated data I'm looking for, but I'd feel cheated if I paid for something which was essentially public information anyway.)<br/><br/>Just to get an indication of the market, we'll look at the combined AMH and AAD sales for the following four categories: small (1400cc or less), medium (more than 1400cc, up to 2500cc), and large (more than 2500cc) cars, and SUVs and 4x4 recreational vehicles. For reference, these figures cover roughly 10% of the total monthly sales for all manufacturers in South Africa.<br/><br/><br/><span style=\"font-size: large;\">    <b>Effect of Petrol Price on Small Vehicle Sales</b></span><br/><br/>Ideally, if people are smart and don't like spending a lot on petrol, we'd expect to see them buying more small cars as the petrol price increases.<br/><br/>Vehicle sales fluctuate wildly from month to month, but we're not concerned at this point with total sales. We just want to know what portion of those sales were small cars. So we simply take the number of cars with an engine size of 1400cc or less and divide by the total sales in the four categories (and naturally multiply by 100 to get a percentage). Since there's a bit of a fluctuation from month to month, we smooth the data out into a three month average. To keep things balanced, we compare this to the change in petrol price over the three months. The data is plotted below.<br/><br/><div align=\"center\"><a href=\"data/images/PzloW1XFLy0.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/PzloW1XFLy0.png\" width=\"540px\"/></a></div>Apart from the obviously steadily increasing petrol price, you can see that there's a definite seasonal fluctuation in the number of small cars purchased. There's a definite peak between October and March. I'd guess this is due to year-end bonuses and school leavers entering the vehicle market, but that's not really important. What is important is that if you ignore these seasonal variations, there is a definite <i>downward</i> trend. So while the petrol price is increasing, people are favouring medium to larger cars over the smaller cars - the complete opposite of what you'd expect.<br/><br/>If we take time out, and simply plot the 3 month sales figures against the 3 month change in fuel price, we see the picture a little more clearly.<br/><br/><a href=\"data/images/y4-5L6SrVI0.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/y4-5L6SrVI0.png\" width=\"540px\"/></a><br/><br/>There's obviously no linear relationship (for those who know their stats, R<sup>2</sup> is 0.00006), but if we try fit a trend anyway, we see that it comes out more or less flat - implying that the petrol price has very little effect on the percentage of small cars bought. Of course, in reality, this is not necessarily the case. It is more likely that there are other factors which buyers consider more important that petrol price when they're deciding what car to buy. Things like the state of the economy at the time.<br/><br/><br/><span style=\"font-size: large;\">    <b>Effect of the Economy on Small Vehicle Sales</b></span><br/><br/>The gross domestic product (GDP) is a pretty well recognised indicator of the state of a country's economy. Unfortunately, monthly GDP values are not published, but quarterly ones are. This suits us fine, because we're looking at sales date averaged over three months anyway. Lets plot the percentage of small cars sales against the GDP and see what happens. (Since the actual value of the GDP is not important, it's been normalised by dividing by the GDP at the start of our data - i.e. June 2009)<br/><br/><a href=\"data/images/o-J07en2AX4.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/o-J07en2AX4.png\" width=\"540px\"/></a><br/><br/>The scatter is primarily caused by the seasonal fluctuation I mentioned earlier. If we ignore that, we see a definite downward trend. As the GDP increases, we see people favouring medium to larger cars. <br/><br/><br/><span style=\"font-size: large;\">    <b>Conclusion</b></span><br/><br/>If people were concerned about the petrol price, we'd expect to see people favouring cars with smaller engines as the petrol price climbs, but we actually see the exact opposite behaviour. The country's economy is growing steadily at the moment, and the immediate future looks bright (because who thinks long term anyway), so who really cares how much it costs to fill up your tank?<br/><br/>Me? I drive a small car, and I've always made an effort to drive it economically. But I don't have much money to spare, and I realised long ago that I just don't think of things the way others do.<br/><br/></div>", "published": "2013-03-05T12:24:00+02:00", "updated": "2013-03-05T12:24:46.514000+02:00", "draft": false, "categories": ["traffic"]}