{"id": "QuickCoords", "title": "On QuickCoords - A tool for quickly capturing coordinates across a series of images.", "content": "I needed an easy way to manually track the positions of features across a series of more than 600 photographs. Loading each individual photo and copying the coordinates of each point one at a time gets very tedious very fast, and none of the programs that I tried really seemed to support a rapid workflow.<br/><br/>That's why I wrote my own.<div class=\"readmore\"> QuickCoords v0.1beta is now available, either from <a href=\"http://sylvermyst.com/QuickCoords/\">Sylvermyst Technologies</a> or from <a href=\"https://github.com/Sylvermyst-Technologies/QuickCoords/releases\">GitHub</a>.<br/><br/><br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/tNim8I6rrI8.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"data/images/tNim8I6rrI8.png\"/></a></div><br/><br/>It's still in beta, so if you have any need for a program like this, try it out. The following features are fully functional:<br/><ul><li>Select a folder, and load images from that folder.</li><li>Quickly switch between images using a range of keyboard shortcuts.</li><li>Click anywhere in the image to get the coordinates of that point with sub-pixel accuracy.</li><li>Select and remove points individually, or in groups.</li><li>Shift points around if your initial click was a handful of pixels off.</li><li>Copy a list of points for pasting into most spreadsheet programs.</li><li>Export the points as a CSV file or plain text.</li></ul><br/>Any feedback is welcome, and if you encounter any major bugs, <a href=\"https://github.com/Sylvermyst-Technologies/QuickCoords/issues\">please report them</a> (if they haven't been reported already).<br/><br/></div><br/>", "published": "2014-03-14T10:51:00.001000+02:00", "updated": "2014-03-14T11:24:24.556000+02:00", "draft": false, "categories": ["engineering", "programming"]}