{"id": "solar-system", "title": "On a Sense of Scale in the Solar System", "content": "Cary Huang has an awesome Flash application that you might have seen before, called <a href=\"http://htwins.net/scale2/\">The Scale of the Universe</a>. Although that app is awesome for getting a sense of the sizes of various objects, it is not very good at conveying a sense of distance. To convey a sense of size and distance, you need to portray both sizes and distances to scale, like the Earth and Moon in the image below. I've always wondered if I could make something that can convey that sense of distance.<div class=\"readmore\"> <br/><br/><div class=\"separator\" style=\"clear: both; text-align: center; font-size:smaller;\"><a href=\"data/images/xV4PXNqTjBs.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"data/images/xV4PXNqTjBs.png\"/></a><br/>Figure: The Earth and Moon with both sizes and distances to scale. <a href=\"http://en.wikipedia.org/wiki/File:Earth-moon-to-scale.svg\">[Source: Wikipedia]</a><br/></div><br/>I've been wanting to learn how to use HTML5 canvases and improve my JavaScript knowledge for a while, so I realised that this was a perfect opportunity to do that. On Christmas Eve 2013, I sat down and began to program it.<br/><br/><a href=\"http://sylvermyst.com/SolarSystem/\">Here is what I came up with</a>.<br/><br/><div style=\"text-align:center;\"><a href=\"http://sylvermyst.com/SolarSystem/\"><img src=\"data/images/YH6JkhFfulg.png\"/></a></div><br/>It's probably not complete, but an app like this could be added to forever, and it possibly will be. I'd like to go further than our Solar System, and add some neighbouring stars, the Milky Way Galaxy and it's neighbours, and so on, until I get to the observable universe. <br/><br/>The rest of this post will talk about the challenges I faced during development, so if that sort of thing doesn't interest you, you can move on. If it does, or you're bored enough not to care, then please read on.<br/><br/>Firstly, the distances between objects in our Solar System are just enormous relative to the sizes of those objects. For example, to display the Earth and Sun together in an image, with the sizes and distances to scale, the image would have to be well over eleven thousand pixels across for the Earth to even show up as a single pixel. That's six times the resolution of a widescreen monitor at 1080p.<br/>The second problem is the range of orders of magnitude that need to be dealt with. Many moons in the solar system have diameters of just a few hundred kilometres and orbit tens or hundreds of thousands of kilometres from their planets, yet the gas giants orbit at distances of a few billion kilometres from the sun.<br/><br/>Thirdly, there is the shear number of bodies in our solar system. The four gas giants have a couple hundred moons between them, and there are more than half a million bodies in our Solar System actively being tracked by the Minor Planet Center.<br/><br/>Finally, the orbit of each body in our solar system traces a unique path in three dimensional space, each with a different inclination, eccentricity, and other orbital parameters. Each body is at a different position in it's orbit, and many of these orbits (especially bodies in the outer solar system) intersect. For example, although Pluto is currently further from the sun than Neptune, it was actually closer than Neptune between 1979 and 1999.<br/><br/>The solutions described below were applied to solve the above problems, in reverse order. Each of these solutions has implications, which are also described below.<br/><br/>The program was restricted to a single dimension. Inclinations were ignored, and distance of each body is averaged across its entire orbit. The implication of this is that all bodies are incorrectly shown on the same plane, and distances between each body are completely inaccurate. Only the average distance from the body to the planet or star about which it orbits is accurate. A future incarnation of the program may remove this restriction.<br/><br/>All eight major planets were included, but only the five dwarf planets recognised by the IAU at the time of writing were included. This means that some bodies such as Sedna, Quaoar, Orcus and Salacia were not included, even though they are widely considered by many astronomers to be dwarf planets. Moons are only included if they are either massive enough to be rounded under it's own gravity, or larger than 10% of their parent planet's diameter. There are only two exceptions: Mars's moons Phobos and Deimos. These were included because they are widely known, and are the best studied moons in our solar system other than our own.<br/><br/>The ability to zoom was essential in order to get a sense of scale over a wider range of distances, with orders of magnitude varying from as little as tens of kilometres up to trillions and beyond. A constantly scaling grid in the background is essential for maintaining the sense of distance as the scale changes.<br/><br/>A minimum size (currently 3 pixels) had to be enforced so that a bodies position could still be seen, even when zoomed too far out for it to be visible. Bodies gradually fade from view as they get too close to their parent bodies on the screen.<br/><br/>I think the final approach comes close to what I originally imagined when I originally came up with the idea, and I hope someone at least finds it interesting and educational.<br/><br/></div>", "published": "2014-01-13T09:14:00+02:00", "updated": "2014-01-13T09:23:01.162000+02:00", "draft": false, "categories": ["spaaaaaace", "programming"]}