{"id": "south-african-drivers", "title": "On South African (and Possibly Other) Drivers", "content": "I don't know what it is, but people in general do not know how to drive. An alarming majority of drivers on the road act either impulsively and irrationally, or nervously and hesitantly. Both of these mindsets are incredibly dangerous and, let's face it, stupid. <div class=\"readmore\"><br/><br/>While the vast majority of my driving is around the Gauteng region, I've noticed no real difference in driver attitudes on trips to Durban or Cape Town in the last couple of years. It seems to be at least a national problem. It may even be that globally, attitudes are changing, but I don't have any experience driving in other countries, so I can't comment on that. This post is a pretty long rant, but I really hope you will take the time to read it, since these points apply to almost everyone (even me, in some cases).<br/><br/>    <span style=\"font-size: large;\"><b>Nervous Drivers.</b></span><br/><br/>Nervous or hesitant driving is indeed dangerous in many situations, and these drivers are a big problem on the road. Almost everyone knows how to solve this problem though, and I bet you're muttering some form of the solution to yourself right now:<br/><br/><div style=\"text-align:center;\">\"<i>Those drivers should just learn to be more confident on the road.</i>\"</div><br/>That is indeed the solution, in essence. Just like the solution to world hunger is that the starving should eat more food. Apart from making a major logical fallacy by simply posing the solution as a state in which the problem is absent, it subtly passes the blame onto those nervous drivers, completely ignoring the reasons for their nervousness. Lets face it. The reason most of those nervous drivers are so hesitant is because so many other drivers are impulsive and unpredictable. If everyone drove in a consistent and predictable manner, there would be an incredible reduction in the number of nervous drivers on the road. Which brings me to the next problem.<br/><br/>    <span style=\"font-size: large;\"><b>Impulsive Drivers.</b></span><br/><br/>First, let me define what I mean by impulsive driving. An impulsive driver is a driver who takes an action without having considered the entire state of his current situation. In other words, it is a driver who acts on a decision without considering all of the available information. It's not necessarily a driver who breaks the rules of the road (I'll get to that in a moment), but rather driver who changes into the left lane when they need to turn right at the next intersection, for example. Or a driver who doesn't stop at a yield when there is a car approaching. Or even a driver who keeps the same following distance regardless of weather conditions. <br/><br/>I don't think its a case of drivers consciously ignoring facts (that would be stupid). I think its simply a case of drivers not knowing what to look for, and not knowing where to look. Its a classic case of the <a href=\"http://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\">Dunning-Kruger effect</a>. They are incompetent drivers, but will never seek to be better drivers because they are not aware of their incompetence. The one point which many drivers have very little practical understanding of is stopping distances. <br/><br/>    <span style=\"font-size: large;\"><b>On Stopping Distances.</b></span><br/><br/>Most people have no clue when it comes to stopping distances. Braking as hard as possible without locking the brakes, driving at a speed of 60 km/h, a typical stopping distance is 50m or so. At 80 km/h, it's 70m. At 120 km/h, it's 120m. Great. Numbers. Distances. It's hard to know what they mean in real life. Time is something most of us understand a little better, so let's consider stopping times instead. <br/><br/>I hope you have a stop watch nearby. At 60 km/h, it takes around 5 seconds to stop the car (including a reaction time). But really, how long is 5 seconds? Hold your breath, tense up your right foot (as if you're pushing the brake pedal), and start the stop watch. When it hits 5 seconds, you can relax and breathe again. That wasn't bad. Now try 9 seconds (which corresponds to stopping from 120 km/h. You got it? That is about the shortest possible time in which an average car can come to a stop in dry conditions. If you're ever slightly slow on the brakes, if you push slightly softer, or if the wheels skid for even an instant, it's going to take longer. <br/><br/>Now consider a wet road. In wet conditions, a general rule of thumb is that the stopping distance doubles (but reaction time obviously stays the same), so the time increases to about 16 seconds. Try holding your breath and tensing your foot again, waiting for 16 seconds this time. 16 seconds is a pretty long time, when you're actually thinking about it. Now try the same thing again, but this time, imagine yourself on the freeway, just after an afternoon thunderstorm, doing 120km/h, slamming on brakes as a pedestrian steps into the road a couple hundred metres ahead of you...<br/><br/>    <span style=\"font-size: large;\"><b>On Intelligent Lane Selection.</b></span><br/><br/>This one is so obvious to those who can do it, but seemingly unreachable for those who can't. In general, you should get into the lane that is going to take you where you want to go. It's stupid to move over into the right lane when you're going to be turning left in a hundred metres. If you need to turn left, then you should move into the left lane <i>before</i> the turn. If the traffic in that lane is slow, then so be it. Drive slowly for a bit. Your priority should be to follow the general flow of traffic. To go against the flow is both futile and dangerous.<br/><br/>However, it's not necessary to get into the right hand lane if you're only going to be turning right several kilometres down the road. You should always be considering how you will be getting into the correct lane, but as a general rule of thumb, you only really need to start moving over to that lane when the turn approaches. In urban driving, this means getting into that lane a block or two before the turn, and on freeways, it means starting to move over to that lane when you start passing signs for the off-ramp you want.<br/><br/>When you're not planning on turning off the freeway any time soon, there's a general guideline to which most drivers seem oblivious.<br/><br/>    <span style=\"font-size: large;\"><b>Keep Left, Pass Right.</b></span><br/><br/>There are even signs at regular intervals along the freeway to remind drivers, but the vast majority (at least 80%, by my estimate) stick in the lane they are in if the road ahead is clear. The mentality of South African drivers seems pretty clear, and I can see those slow drivers mumbling under their breathes:<br/><br/><div style=\"text-align:center;\">\"<i>If you want to drive fast, go around.\"</i></div><br/>This attitude is absolutely correct. If the vehicle behind you wants to go faster than you, they should indeed overtake you. In fact, they should overtake you on the right. And if you want to do a speed that is slower than the speed limit (even if it's for a brief uphill stretch), then you should move over to the left so that there are lanes on the right for faster vehicles to overtake. I acknowledge that many drivers do move over when a vehicle approaches from behind, but these vehicles should move over to the left if it is safe to do so, even when there happen to be no vehicles behind them at the time.<br/><br/>Of course, this doesn't mean that the right hand lane is free to fly along at any speed. Which brings me to my next point.<br/><br/>    <span style=\"font-size: large;\"><b>Speed Limits.</b></span><br/><br/>Typically, speed limits on a road are set based on empirical data for similar roads. The actual limit is usually chosen from 60, 80, 100 or 120 km/h (it's a small set to make them easy to remember), and is the highest speed that gives an acceptably low accident rate on similar roads. When finding a similar road, typical factors that are considered are the surface type and quality, frequency and severity of bends, density of both vehicle and pedestrian traffic, and the number and type of intersections, amongst other things. <br/><br/>There are many arguments that speed limits are incorrect or outdated, and that modern cars have safety features, and all that. But there are a few things these arguments neglect. While accidents can happen at any speed, the severity of accidents goes up with speed. Also, while cars have safety features added all the time, pedestrians do not. Nor do fences, lamp posts, or buildings. Most importantly, nor do driver's brains. A driver in a modern car is no less likely to make a fatal mistake than a driver 50 years ago. In fact, based on the observations outlined in this post, drivers are more likely than ever to do something stupid.<br/><br/>But that aside, driving faster than the speed limit is illegal, just like it is illegal to steal, murder or rape. I know many people who drive way above the speed limit. Many of them do it because they know they won't get caught.<br/><br/>Lets face it, committing a crime for the thrill because you know you can get away from it is socially disturbing behaviour. To me, it's not to far removed from a person who breaks into a hospital and rapes patients while they're in a coma. <br/><br/>People who break the speed limit fall into one of two categories.<br/><ol><li>Those who are oblivious to the rules.</li><li>Those who know the rules, but deliberately ignore them.</li></ol>Both sorts of behaviour worry me, and in most other aspects of life, they would be considered socially unacceptable, and possibly even sociopathic. And this brings me to yet another point.<br/><br/>    <span style=\"font-size: large;\"><b>Lack of Regard for Rules in General.</b></span><br/><br/>Stop streets mean stop. No one knows how traffic circles work. Going straight from turning lanes, and turning from straight lanes is dangerous (and turning left from the right only lane in front of traffic going straight is just plain stupid). Solid line means no overtaking. Amber light means stop. Red light means don't go. Many traffic lights even need a sign saying \"wait for green\". How retarded do drivers need to be that they need to be reminded about the most fundamental principle behind traffic lights?<br/><br/>The extent to which people ignore rules on the road is absolutely terrifying. Many people will start thinking I'm talking about the minibus taxis here, but I'm not. I'm talking about you. I'm even talking about me.<br/><br/>    <span style=\"font-size: large;\"><b>Aggression.</b></span><br/><br/>I see aggression on the road all the time. A lot of the time, it's not even warranted. I'll give you the best example, and the one you're probably familiar with. Imagine yourself driving along, and a taxi is stopped in front of you to drop off passengers. You have to wait behind it. You get frustrated. When you finally manage to pass the taxi, you hoot and wave the driver your middle finger. Why? The taxi is carrying out a necessary function in society. Stopping to let off or pick up passengers is not against the rules of the road. Sure, hoot away if the taxi actually breaks the rules of the road, but don't just hoot because you're impatient and can't wait two seconds.<br/><br/>Also, if someone does hoot at you, consider why they are hooting. Many drivers are sent into an immediate rage at the sound of a hooter, or the sight of a middle finger. If you're on the receiving end of this, consider that you must have done something to trigger the incident. It may be that you did nothing wrong, but the other person made a mistake that they are unaware of. It's possible, but you should also consider the possibility that you made a mistake that you're not aware of.<br/><br/>Whatever happens, don't get angry, because that just limits your ability to think logically and act rationally. Just relax. Go with the flow.<br/><br/>    <span style=\"font-size: large;\"><b>Never Obstruct the General Flow Of Traffic.</b></span><br/><br/>This is far easier to do than it seems. Don't come to a stop when waiting to merge with high speed traffic, such as on a high way on-ramp. The correct way to do it (and the way that virtually prevents traffic jams) is to match speeds with the traffic by the time you need to merge. Similarly, if you are on the freeway, and there are cars entering from the on-ramp, leave enough space between yourself and the car in front for the cars entering to do so without slowing down the rest of the traffic. The same principle applies when the road narrows.<br/><br/>Another one is to not cross the intersection unless you can clear it. People ignoring this rule is the number one cause of urban gridlock worldwide. It's just frustrating, and it shows that the driver blocking the intersection wasn't driving with a full awareness of what was going on in the road around them. Which brings me to my final point.<br/><br/>    <span style=\"font-size: large;\"><b>Be Aware of <i>Everything</i> Around You.</b></span><br/><br/>This is too vast to cover completely, but I just have a couple of examples which will hopefully demonstrate my point. <br/><br/>You see how little people pay attention best when approaching a jam up on a two lane road due to an obstruction in one of the lanes. Both lanes get backed up, and since the cars in the clear lane usually are kind enough to each let a single car from the other lane in at the obstruction, you land up with both lanes moving at roughly the same average speeds. Every now and then, you'll get a car that's a bit slow to pull off, or car that doesn't let the car from the other lane in, or lets two or three cars through. These create waves which flow upstream. Often they are damped out, but sometimes they travel all the way up the jam, and make it seem as if vehicles in one of the lanes is moving quicker than vehicles in the other at any one point. You get these waves in both lanes, and they vary in frequency and magnitude. The net result is that to any driver far enough upstream of the jam, one lane will appear to be moving faster than the other. Many drivers will try to stay in the faster of the two lanes, and constantly change lanes to make sure that happens. If they were to look at more than just the cars immediately around them, but look at the entire traffic jam, they'd realise that their efforts are futile. If all cars wait patiently, and each vehicle from the unobstructed lane lets a single vehicle from the obstructed lane through before going, the maximum waiting time for any driver in the jam is minimised.<br/><br/>The other one is when people act based on the actions of the vehicle immediately in front of them, not looking at what's going on ahead of that vehicle. Consider the case of a very slow moving (or stationary) vehicle in the left lane, followed by cars A, B and C, all of which want to pass. The right lane is full of steadily flowing traffic. When a gap in the right lane approaches, C almost inevitably takes it. B takes the next gap, and A has to wait for the gap after that. Occasionally, C will move into the right lane, but then slow down and let A and B in, which is very nice and all, but this obstructs the general flow of traffic in the right lane, going against my previous point. In an ideal world (which is sadly very far away), B and C would leave the gap for A to take, since A has been waiting longest for the gap.<br/><br/>Even if A is the only car stuck behind the slow moving vehicle, he will usually follow immediately behind it, leaving only enough space to pull out. Ideally, A should leave enough space between himself and the vehicle in front that he can accelerate to match the speed of the traffic in the right lane if a large enough gap comes along. Sadly, I hardly ever see this happen.<br/><br/><br/>I know I am not the best driver out there. But acknowledging that is one step further than most South African drives have taken, and knowing that fact automatically makes me a better driver than many. Most of the points I've made above have equivalents in other aspects of life. Know your faults. Don't be ashamed when you make mistakes. Be aware of the actions of others, and the effects of your actions on their emotions. Basically, don't be an asshole.<br/><br/></div>", "published": "2012-08-20T13:58:00+02:00", "updated": "2012-08-20T13:58:42.218000+02:00", "draft": false, "categories": ["fixing the world", "incompetence", "traffic"]}