{"id": "spaaaaaace", "title": "On Space and Big Life Decisions", "content": "I don't know why, but I've always assumed I'd be going to space one day, and I still know that I somehow will, one day. <div class=\"readmore\"> When I was very young, I wanted to be president of the world and rule from orbit. As I grew into a teenager, I began to understand a little of how politics worked, and I quickly abandoned that idea. Instead, I wanted to make my fortune by starting a multi-national corporation involved in every aspect of people's lives, and run a private space agency. I still hang on to that idea, and dream of it every now and then, but reality gets in the way. The business needs to start somewhere, and that needs a big idea. While I have no shortage of ideas, I have an unfortunate tendency to analyse them to shreds. <br/><br/>I think I was 15 or so when I realised I wanted to be an engineer. When I finished high school, for some reason I can't remember, I decided to pick a career based on the pay and how many job opportunities were available. Being South African, and having grown up in a city with a deep history in mining, I chose to become a metallurgical engineer on a mine. After 18 months at university, I couldn't figure out why I was doing what I was doing, but I was doing incredibly well academically, and I was waiting to hear back from the big mining company that had flown me out to a mine for a second round of interviews for a really attractive bursary. I felt that my entire future had been decided, and that I was stuck. It frustrated me. I told my mom how I felt in the car one day. I made it quite clear. If I did get the bursary, I'd carry on. But if I didn't get it, I wanted to study something else.<br/><br/>I don't know what would have happened if I did get the bursary, or if my parents hadn't been so supportive, but I was lucky. At the beginning of the next year, I registered for a different degree, and a four years later, I graduated with a Bachelor's degree in aeronautical engineering. I went straight into a Master's program, which brought me to where I am now - just a handful of months from finishing off my PhD.<br/><br/>It may be a couple of years late, but this is where I wanted to be when I was 15 years old. Then, of course, there's a few years of some sort of work, and then space.<br/><br/>A few years of what work, exactly? It feels really weird to look back on things now and realise that I'd never really given it much thought. I kind of assumed that the right opportunity would come along, and I'd just go with it. And, to be honest, that's exactly what has always happened in the past, and I'm kind of waiting for it to happen again. For a while, I thought that I was stuck on the wrong continent, but of course, in Africa, there's no better place to be than South Africa. <a href=\"http://en.wikipedia.org/wiki/Category:South_African_astronauts\">Two South Africans</a> have already been into space - one as a test pilot, and the other by copying my idea of becoming a stinking rich businessman. The past few years have even seen the start of <a href=\"http://www.sansa.org.za/\">a proper space agency</a>, and the induction of <a href=\"http://www.engineeringnews.co.za/article/denel-spaceteq-inducted-into-international-astronautical-federation-2013-09-23\">a South African company into the International Astronautical Federation</a>.<br/><br/>Anyway, I'm at another awkward point in my life where I have to decide where to go next. There are two things that I really enjoy doing, and want to do for the rest of my life: accumulating knowledge, and sharing that knowledge. I do really enjoy research (it's why I landed up doing my PhD), so I really would like some sort of R&amp;D job. But at the same time, I've sort of grown to like teaching. While a year ago, I thought I'd never want to be an academic, I now think that's a career I could really enjoy, especially if I'm allowed to take courses unrelated to my field on the side. But, how many academics get to go to space?<br/><br/>Anyway, I don't post enough pictures, so here's a picture of my giving a thumbs-up when I finally get into space, made using my very limited artistic talent. Yes, I know the stars are no where near as visible outside the atmosphere, but how else can I portray that I'm in space without the stars?<br/><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"data/images/JXuwZkktRpo.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"data/images/JXuwZkktRpo.png\"/></a></div><br/></div>", "published": "2013-12-05T09:46:00.002000+02:00", "updated": "2013-12-05T09:51:41.788000+02:00", "draft": false, "categories": ["spaaaaaace", "sky"]}