{"id": "that-angry-parent", "title": "On the Seven-Year-Old Who Bought Stuff", "content": "Sorting out some paperwork in my cupboard, I came across an invoice for a cheap keyring, dated 5 July 2009. Its not that I don't clean out my cupboard very often (I try do it at least every six months), but I kept that particular invoice for a reason. You see, it's only a copy of an invoice, printed a week after the sale, and I wasn't the one who made the purchase, and, actually, I have never even touched the keyring in question.<div class=\"readmore\"><br/><br/>I printed and kept a copy of the invoice because, over that one little keyring, threats and accusations were made against me, and on two separate occasions, security guards were called. All thanks to a single cheap little keyring.<br/><br/>The whole issue revealed so many flaws in our society and the way people think that I just had to write a post about it. However, it didn't feel right posting it while I was still working at the shop where the incident occurred. After three and a half years of a two-sentence draft post sitting in my post list, and more than two and a half years since I stopped working at the shop, I finally feel that the time has come for me to write the things that I wish I had been quick enough to think of at the time.<br/><br/>Let me tell the whole story. It's pretty long, but I think I should include all the details.<br/><br/>It all started at about 4PM on a Sunday, where I was working as a casual in a small retail store. I about five hours into a nine hour shift (immediately after a three hour shift at my sound engineering job earlier that morning), and I was pretty tired. It had been a quiet afternoon, and I'd spent most of it doing reading for my final year research project that I didn't really understand. A small boy walked in alone, and spent quite a bit of time looking around. Now this wasn't unusual - the centre is primarily a casino complex (one of the most popular in the country), and an alarming number of parents would leave their kids to wander the centre while they were off gambling, rather than fork out money for the childcare facilities that were provided. Eventually, the child brought a keyring to the counter, and handed over his money. I ring it up, handed him his change and a receipt, and thought nothing more of it. If it hadn't been such a slow day (that was practically the only sale I'd made that afternoon), I wouldn't have remembered it at all.<br/><br/>(On a side note: The babysitting issue was pretty serious problem for us, but I'll get back to that later. We actually at one stage had a large TV in the store, and we used to play DVDs on it to attract customers. We got rid of it, because we'd inevitably land up with a row of kids seated in the middle of the store as parents left them for hours at a time while they went to watch a show or gamble.)<br/><br/>At around 6:30, the boy came back with a slightly older (maybe ten to twelve years old) girl. She holds out the keyring, and says \"You have to take it back. His father will kill him if he finds out.\" The store had a no returns policy, but if an item was still in the packaging, I often used to do a refund anyway. Unfortunately, the boy had thrown away the receipt and packaging (so we'd never be able to resell it even if I had taken it back), so I apologised, and explained that I couldn't give a refund. The two left disappointed.<br/><br/>Closing time was officially 8PM, but I noticed pretty soon after I started working there that there that the store's busy periods coincided with the end of each show at the cinema. I could normally make half a dozen or so extra sales for the day if I kept the store open an extra 30 minutes, and that day was no different. I cashed up and closed off the day's accounts, switched everything off, packed up my stuff and left. Just as I turned away after locking the door (this is 45 minutes after the official closing time), a woman approached me.<br/><br/>\"How could you sell this to my son!\" she yelled, waving the keyring in my face. \"He's a child of seven!\" I noticed the boy now hiding behind her, terrified. Tired, and just wanting to go home, I asked her calmly if she wouldn't mind coming back the next day - someone else worked Monday's, and I was hoping that by passing off the problem, I wouldn't have to deal with it. She did not accept that. I repeated what I had told her children - that without the packaging and receipt, there was nothing I could do. If a child is old enough to carry money and walk around a shopping mall alone, he's old enough to buy stuff. After around fifteen minutes of arguing, I gave up and began to walk away, but she grabbed my arm and violently pulled me back. That was my trigger - no one touches me aggressively. The two years of Taekwondo training that I'd had at the time probably showed a little in the way that I twisted my arm out of the grip, and I murmured \"Don't f****** touch me.\" Now, those who know me personally will be able to confirm that I almost never swear, and that I am almost always calm. In fact, this was the fourth time out of four that I have ever genuinely lost my temper in public. I turned and stormed off. I heard her calling for security, calling \"Stop him! That man stole from my son.\" I walked through the centre, people staring, straight past the security check point at the exit, made sure no one was going to stop me, got in my car, and drove home. I made a very angry Facebook status update, followed half an hour later by an apology, both to my friends and the woman I swore at (who would obviously never read it).<br/><br/>The following Sunday evening, an angry man with popping eyes and throbbing veins on his forehead came into the store and started yelling at me. With an awful lot of cursing, he was demanding his money back, but it took me a full five minutes to figure out that he was the husband of the woman I'd dealt with the week before. I explained, as I had to his wife and daughter, that I could not do the refund without a packaging and receipt. he demanded that I get the store owner on the phone. I did so, and the store owner (who'd heard the whole story the week before, and supported the way I'd handled it) explained our no refunds policy to him. The man stormed out. Ten minutes later, he stormed back in. This time, he had a security guard with him. \"This is the one. He's scamming children out of their money,\" he told the guard. The guard asked him to explain the whole story. The man started by explaining how I took advantage of his son's naivety and tricked him out of his money. Then he explained how I had not given his son any change or receipt, changing his story as he went along. Eventually, the story went that I did this all the time: I took advantage of children who had money and overcharged them for unmarked keyrings with no packaging from under the counter, and pocketed the cash. Naturally, I interjected to deny the allegations, to which he responded \"Shut up. You'd better watch your back when you go home tonight, because I'll follow you and smash your face in.\" I could see the situation resolving in the security guards face, even as he explained to the man that threats wouldn't help anything. He asked the man to step outside so that he could ask me my side of the story. When the man had gone, I began to explain to the security guard what had happened, but he stopped me. \"Its obvious what's happened here. Don't worry. We'll sort it out.\" He went out, and I didn't see the man again. Just to be on the safe side, I went back to the previous week's sales, found the transaction in question, and printed the copy invoice in case any more accusations came up. A security guard stood across the corridor for the rest of the day, and when I left that evening, I noticed a pair of security guards following me at a comfortable distance as I made my way through the car park. I put the invoice on my paperwork-awaiting-filing pile, and that's where it's been ever since.<br/><br/>That's pretty much the end of the story. I still have the father's eyes imprinted in my memory, and would almost certainly recognise him if I ever saw him again. I probably won't, but if I do see him again one day, I will direct him to this post. Unfortunately, it's a big world, and that's unlikely. Instead, all of you will be the ones who read this, and most of you are the ones who this least applies to. Nevertheless, I feel that it all still needs to be said.<br/><br/>First of all, the babysitting issue. I know childcare facilities can be expensive, and I know that a lot of people do not trust the people who work in them (they're mostly underpaid with very little experience and no qualifications anyway), but both of these points are easily addressed. The cost is easily argued away by pointing out that gambling is an extremely expensive habit in the first place. If a person cannot afford to pay for childcare services because of a gambling habit, one can't help wondering which other of the child's needs that person is neglecting. If this is a problem for you, you should probably seek free, confidential, expert help from the <a href=\"http://www.responsiblegambling.co.za/\">National Responsible Gambling Programme</a>. The second point is even simpler: if a person doesn't trust the childcare staff, then what exactly is it that makes you prefer to put your trust in the roughly 9 and a half million annual visitors to the centre? I wish I'd thought to point out these flaws in their parenting at the time.<br/><br/>Second, the age issue. It turns out that the money that the child spent on the keyring had been intended to buy his dinner. One of the principle arguments that the mother had brought up was that it was irresponsible of me to be selling to such a young child. This is a terrible notion. I started receiving pocket money at around the age of five, and by then my parents were already teaching me the basics of saving up to buy bigger things. I was raised from the very beginning to learn to make sure I really wanted something before I bought it, and if I ever ever decided that I didn't want something after buying it, my parents would simply laugh at me and point out that there was a lesson to be learnt. So when I see a seven-year-old, eagerly handing over money, having been staring at an item on the rack for several minutes, I naturally put my seven-year-old self in his shoes, and imagine that they are coming to a final decision regarding hard earned money. It's not my place to remind him (even if I had known) that he needed the money to buy dinner. I think going hungry for a night would be the best way to teach him where his priorities should lie (this is exactly the same way life likes to teach this same lesson to children and adults alike). That aside, surely if it's irresponsible for me to be selling to a seven-year-old, then it's also irresponsible for a fast food joint to be selling to a seven-year-old? Not to mention giving a seven-year-old money, expecting him to buy stuff?<br/> <br/>Thirdly, the blame and accusation issue, and this applies to people in general. Why on earth do some people feel the need to pile up accusation after accusation when they're angry? Even when the accusations turn out to be true (which wasn't the case in this situation), they are often irrelevant - merely constituting an argumentum ad hominem, one of the most common logical fallacies. In this case, of course, the accusations were actually relevant to the complaint, but the repeated exaggeration of the accusation, and adding additional false claims if the originals don't seem to have an impact is a deliberate malicious act. It only serves to weaken the case - inconsistencies in a testimonial form the biggest clue that it is false. It is completely irrational, and I don't think I'll ever understand the thought processes that would lead a person to do that sort of thing.<br/><br/>And finally, the threat. How on earth is threatening to smash a person's face in - in front of a security guard, no less - ever going to solve the situation. Especially since, from the security guards point of view, the party making the threats has been yelling and swearing excessively the whole time, while the other party just stood there calmly, unable to get a single word in. People do this all the time. They immediately want to revert to violence, when simple thought and calm debate would get both parties much further. Even if they can't reach agreement, there's always a compromise to be made.<br/><br/>Anyway, I'm glad that I've finally gotten around to writing this post. I'm sorry I lost my temper with a customer - something that I still feel guilty about today - and I'm sorry to everyone who saw me lose my temper. And even though she will never read it, I apologise to that woman. Most of all, I apologise for that poor little boy (who will be eleven this year), who has had to grow up with parents like that. I'm sorry.<br/><br/></div>", "published": "2013-02-13T00:06:00+02:00", "updated": "2013-02-13T00:06:09.907000+02:00", "draft": false, "categories": ["people", "fixing the world", "incompetence", "awkward situations"]}