{"id": "theory-of-relativity", "title": "On Applying the Theory of Relativity to Everyday Situations", "content": "I came across a question on Reddit the other day, in which someone asked how much time a flight attendant would \"gain\" over the course of an entire career. It got me wondering about applying the theory of relativity to everyday situations. For those who are unfamiliar with relativity, let me start by giving a quick explanation.<div class=\"readmore\"><br/><br/>If you're sitting on a small boat in a wide lake, aimed into the current, looking down at the water and watching the waves rushing past, its easy to imagine that you're cruising through the waves at speed. By looking at the shore, the illusion is broken, and you can see that you are in fact stationary, or merely drifting along. Now imagine the same scenario, but this time far out at sea, with no shoreline to look at to confirm your speed. It is impossible to tell how fast you are moving, if you are moving at all.<br/><br/>This effect was first described by <a href=\"http://en.wikipedia.org/wiki/Galileo_Galilei\">Galileo Galilei</a> in 1632, and is called the <a href=\"http://en.wikipedia.org/wiki/Principle_of_relativity\">principle of relativity</a>, and it basically says that you can't measure your absolute speed - you can only measure your speed relative to something else - and the laws of physics remain the same, regardless of what you choose to measure your speed against. So in a boat, you like to think of the shore as stationary, so you measure your speed relative to the shore, but you could just as easily have chosen another boat, or anything else with a constant speed for that matter. You should have covered this much in high school.<br/><br/>Fast forward two and a half centuries. People were thinking on a much greater scale. If we're on the surface of a rotating Earth, the Earth is rotating around the sun, the sun is in a spinning galaxy, so everything is in relative motion. It had to stop somewhere. Using the prevailing understanding of physics at the time, <a href=\"http://en.wikipedia.org/wiki/Michelson%E2%80%93Morley_experiment\">Albert Michelson and Edward Morley</a> realised that it should be possible to work out the absolute velocity of the Earth in space by measuring the speed of light in different directions. They set up their experiment, and got extremely accurate results. The only problem was that they measured exactly the same speed of light in all directions. Turns out, it doesn't matter how fast you're moving, or in which direction, you will always measure the same value for the speed of light.<br/><br/>A couple decades later, and a young Albert Einstein tried putting the two together to see what came out. He started by assuming that there is no preferred reference frame, and that measuring the speed of light will give the same value in all of them. He got some startling results. For that to remain true, space and time would have to distort for a moving body. He derived formulae for the dilation of time and space for a body moving at a constant velocity, and called it the <a href=\"http://en.wikipedia.org/wiki/Special_relativity\">special theory of relativity</a>. Special, because it only looks at the one special case of zero acceleration. Einstein then spent the rest of his life trying to remove that zero acceleration assumption, and eventually came up with a <a href=\"http://en.wikipedia.org/wiki/General_relativity\">general theory of relativity</a>, which could be applied to all moving bodies, and describes how space and time are distorted by gravitational fields.<br/><br/>It turns out that the passage of time slows down as you move faster, and speeds up as you move away from a heavy body (such as the Earth). So, if a particular journey causes the passage of time to go slower for a particular person, then they will have aged less than someone who did not go on that journey. To the stationary observer, it may appear that the traveller \"gained\" a certain amount of time, although to the traveller, time would actually seem to have passed normally.<br/><br/>The maths behind special relativity, as it turns out, is not too complicated - and space and time dilation depend only on the ratio of the object's velocity to the speed of light. The maths behind general relativity is a lot scarier, but for some simple cases (like constant gravitational pull), it reduces to some manageable formulae - the simple sort of plug-in-and-get-your-answer types.<br/><br/>So, can we apply some of these formulae to everyday situations? Like calculate the time that people who are up and moving are \"gaining\" over you, sitting in front of your computer? The answer is yes, and so I tried to do just that.<br/><br/>Lets start with something simple, like walking. A typical walking speed is just under one and a half meters per second, where as the speed of light is just under three hundred million meters per second. Lets put that ratio in numbers: 1/200 000 000, or in scientific notation, 1/2x10<sup>8</sup>. The time they'd \"gain\" over you is given by a simple equation:<br/><div style=\"text-align: center;\"><app-latex>{ \\frac{t_{traveller}}{t_{you}} = \\frac{1}{\\sqrt{1-\\left(\\frac{v}{c} \\right )^2}}}</app-latex></div>where <i>v</i> is the traveller's speed relative to you, <i>c</i> is the speed of light, and <i>t<sub>you</sub></i> and <i>t<sub>traveller</sub></i> are the times that you and the traveller experience passing respectively.<br/><br/>All very well, but if you plug the ratio into the formula on your calculator, you get one - i.e. for every minute that passes for the walker, one minute passes for you, but that's not exactly right. Using a higher precision calculator, the actual answer is not far from 1-1.25x10<sup>-17</sup>. That means that for every minute that passes for you, only 0.9999999999999999875 minutes pass for the walker. In other words, the walker \"gains\" an extra three quarters of a millionth of a nanosecond for each of your minutes he spends walking. Its not surprising that we don't notice time dilation in every day life.<br/><br/>Lets get a little faster. A car on the freeway travels at around 30m/s, which is a ten millionth of the speed of light. Plugging into the formula, we get about 0.999999999999995 minutes passing for the car for each minute that passes for you, the car \"gains\" three ten-thousandths of a nanosecond. Not much, but a lot more than walking.<br/><br/>Faster still, in an aircraft. Now things get complicated, because although you're quite happy at your 9.8 m/s<sup>2</sup> of gravitational acceleration in your chair, at the aeroplane's altitude of something around 35 000 ft (depending on flight conditions, of course), gravity is about a third of a percent weaker. This complicates things, because it means we can't just apply special relativity - we need to use general relativity to account for the differences in gravitational fields, and this means differential equations. Fortunately for us, they've been solved before, with a few approximations, so we can just use this simple equation:<br/><div style=\"text-align: center;\"><app-latex>{ \\frac{dt_\\text{E}}{dt_\\text{c}} = \\sqrt{ 1 - \\frac{2U}{c^2} - \\frac{v^2}{c^2} - \\left( \\frac{c^2}{2U} - 1 \\right)^{-1} \\frac{{v_\\shortparallel}^2}{c^2} }}</app-latex></div><br/>Sure, it involves a derivative, but in our aircraft example, the entire right hand side is a constant, so finding the solution is as simple as finding the ratio between two constants. In the above equation, <i>t<sub>E</sub></i> is the time that the object under consideration experiences, and <i>t<sub>c</sub></i> is the time that passes for some stationary object too far away from anything else to be affected by any gravitational field. <i>U</i> is the Newtonian gravitational potential, which in this case is simply the Earth's mass times gravitational constant, divided by the distance of the object from the earth's centre.<br/><br/>If we assume that the aircraft is travelling at a speed of 250 m/s, we find that although the special relativity equation slows time down on the aircraft, the difference in the gravitational field actually counteracts this effect to a slight degree (although it's still a net \"gain\" in time). The aircraft effectively \"gains\" 9 hundredths of a nanosecond for every minute that passes for you. <a href=\"http://www.npl.co.uk/news/time-flies\">This experiment</a> measured a 230 ns time shift on a round the world flight, which assuming 44.5 hours of flight time, can be converted to 8.6 hundredths of nanosecond per minute. I love it when my maths corresponds with reality.<br/><br/>Lets go faster still. It's not an every day situation for most, but lets consider the International Space Station. At 7700 m/s and an average altitude of 410 km, it's a lot higher and faster than the aircraft. Plugging the numbers into the formula, we get a \"gain\" of almost 23 nanoseconds for every minute that passes for you. That equates to astronauts on the ISS aging 0.006 seconds less than those of us stuck here on the ground <a href=\"http://en.wikipedia.org/wiki/Time_dilation#Overview\">Wikipedia</a> puts that value at 0.007 seconds. I'd assume that Wikipedia's value is more accurate than mine.<br/><br/>Fascinating, but it's hard to imagine how the space and time dilation would look and feel. If you missed it last year, MIT Game Lab made a game to demonstrate various relativistic effects as you approach the speed of light. If you haven't tried it yet, download and play <a href=\"http://gamelab.mit.edu/games/a-slower-speed-of-light/\">A Slower Speed of Light.</a><br/><br/></div>", "published": "2013-01-29T11:35:00+02:00", "updated": "2013-01-29T11:40:15.529000+02:00", "draft": false, "categories": ["time", "mathematics"]}