{"id": "why-the-stars-are-not-long-dead", "title": "On Why the Stars We See in the Sky are NOT Long Dead", "content": "The light from distant stars takes a long time to reach us. High powered telescopes can look at stars that are millions, even billions, of light-years away. Because of this, a surprising number of people believe that when they look up into the sky, they are seeing stars as they were millions of years ago. Unfortunately, that's not true. In most cases, you're only seeing the star as it was a couple of centuries ago, or in many cases, only a couple of decades ago.<div class=\"readmore\"> In fact, if you look at Rigel Kent (the left most of the two pointers to the Southern Cross) tonight, you'd be seeing it as it was back in January 2009.<br/><br/>In fact, for more than half of the 50 brightest stars in the sky, the light reaching us now left them some time in the 20<sup>th</sup> or 21<sup>st</sup> centuries. <br/><br/>It kind of ruins the popular anti-joke: \"According to astronomy, when you wish upon a star, you're actually a few million years late. That star is dead. Just like your dreams.\" Pretty much all the stars we see are almost certainly still alive. The one that's expected to die the soonest is Betelgeuse (that's pronounced Beetlejuice), which we see as it was in the late 14<sup>th</sup> century. Betelgeuse is due to explode any day now... Which in astronomical terms means some time in the next million or so years. <br/><br/>Just to give you an idea of how long ago the light left some of the stars in the sky, I used <a href=\"http://www.stellarium.org/\">Stellarium</a> to generate a map of the stars in the sky from Johannesburg, South Africa at 8 pm and 4 am last light. I've labelled most of the more prominent stars, and included the approximate date on Earth at which the light left the star. I didn't account for changes in calenders or anything, so some of the older dates may be a few days out, but it's still accurate enough to give you an idea.<br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>Johannesburg, 30 May 2013, 8PM:</b></span><br/><br/><a href=\"data/images/RUqmm6SBTv8.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/RUqmm6SBTv8.png\" width=\"540px\"/></a><br/><br/><a href=\"data/images/6IY3IXJ74n8.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/6IY3IXJ74n8.png\" width=\"540px\"/></a><br/><br/><br/><span style=\"font-size: large; color: #4070e0;\">    <b>Johannesburg, 31 May 2013, 4AM:</b></span><br/><br/><a href=\"data/images/F0se5HyyHug.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/F0se5HyyHug.png\" width=\"540px\"/></a><br/><br/><a href=\"data/images/fO5nITihzoI.png\" imageanchor=\"1\"><img border=\"0\" src=\"data/images/fO5nITihzoI.png\" width=\"540px\"/></a><br/><br/><br/>As always, you can click on the images for a higher resolution version.<br/><br/>Unfortunately, the constellation of Orion (of which Betelgeuse makes up the armpit) disappeared over the horizon shortly after sunset, so it was not visible for very long last night. For the briefest instant at around 4AM, the very dim Mu Cephei would have popped above the northern horizon if you had a clear enough view. Mu Cephei is one of the largest and most luminous stars in our galaxy, and yet it's barely visible with the naked eye. Light from Mu Cephei travels a mere 6000 years to reach us. If you think that's a long time, consider that light takes 100 000 years to travel from one side of the Milky Way to the other, and about 2.5 million years to get from here to our neighbouring galaxy, Andromeda.<br/><br/></div>", "published": "2013-05-31T11:02:00+02:00", "updated": "2013-09-12T11:55:28.882000+02:00", "draft": false, "categories": ["sky"]}